
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Настройки);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(Параметры.АдресСхемыКомпоновкиДанных);
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);

КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	сткРезультат = Новый Структура;
	сткРезультат.Вставить("Настройки", КомпоновщикНастроек.Настройки); 
	Закрыть(сткРезультат);
	
КонецПроцедуры // ЗавершитьРедактирование()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры // Отмена()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти
