

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазрешитьРедактированиеСрокаДоставки    = Истина;
	РазрешитьРедактированиеОбъема           = Истина;
	РазрешитьРедактированиеМассы            = Истина;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	
	Результат = Новый Массив;
	
	Если РазрешитьРедактированиеСрокаДоставки Тогда
		Результат.Добавить("СрокДоставки");
	КонецЕсли;
	
	Если РазрешитьРедактированиеМассы Тогда
		Результат.Добавить("Масса");
		Результат.Добавить("МассаНетто");
	КонецЕсли;
	
	Если РазрешитьРедактированиеОбъема Тогда
		Результат.Добавить("Объем");
		Результат.Добавить("ОбъемНетто");
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры // РазрешитьРедактирование()

#КонецОбласти