#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	текЭтоДата = Неопределено;
	Если Параметры.Свойство("ЭтоДата", текЭтоДата) Тогда
		текВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		Если текЭтоДата Тогда
			текВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		КонецЕсли; 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПараметрРасчета",упТарификацияКлиентСервер.ПолучитьСписокВременныхПараметров(),текВидСравнения);
	КонецЕсли; 
	
	ВернутьКод = Ложь;
	
	Если Параметры.Свойство("ВернутьКод", ВернутьКод) Тогда
		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ВернутьКод Тогда
		СтандартнаяОбработка = Ложь;
		Закрыть(Элемент.ТекущиеДанные.Код);		
	КонецЕсли;
КонецПроцедуры
	
#КонецОбласти
