#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура заполнения дополнительных свойств докуменат.
//
Процедура ИнициализироватьДанныеДокумента(Дата, Агрегаты, ДополнительноеОборудование, ДокументСсылка, СкладОтправитель, СкладПолучатель, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧДопОборудование.ДополнительноеОборудование КАК ДополнительноеОборудование
	|ПОМЕСТИТЬ втДопОборудование
	|ИЗ
	|	&ДополнительноеОборудование КАК ТЧДопОборудование
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧАгрегаты.Агрегат КАК Агрегат
	|ПОМЕСТИТЬ втАгрегаты
	|ИЗ
	|	&Агрегаты КАК ТЧАгрегаты
	|;
	|//{Запрос: 2 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&СкладОтправитель КАК Склад,
	|	втАгрегаты.Агрегат КАК Агрегат,
	|	1 КАК Количество
	|ИЗ
	|	втАгрегаты КАК втАгрегаты
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&СкладПолучатель КАК Склад,
	|	втАгрегаты.Агрегат КАК Агрегат,
	|	1 КАК Количество
	|ИЗ
	|	втАгрегаты КАК втАгрегаты
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	&СкладОтправитель КАК Склад,
	|	втДопОборудование.ДополнительноеОборудование КАК Агрегат,
	|	1 КАК Количество
	|ИЗ
	|	втДопОборудование КАК втДопОборудование
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	&СкладПолучатель КАК Склад,
	|	втДопОборудование.ДополнительноеОборудование КАК Агрегат,
	|	1 КАК Количество
	|ИЗ
	|	втДопОборудование КАК втДопОборудование
	|;
	|//{Запрос: 3 ////////////////////////////////////////
	|// Текущие склады и агрегаты, и те которые были в документе
	|// до его изменения
	|ВЫБРАТЬ
	|	втАгрегатыТ.Агрегат КАК Агрегат,
	|	&СкладОтправитель КАК Склад,
	|	1 КАК СтрокаДокумента
	|ПОМЕСТИТЬ втКонтрольАгрегатов
	|ИЗ
	|	втАгрегаты КАК втАгрегатыТ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втАгрегатыТ.Агрегат КАК Агрегат,
	|	&СкладПолучатель КАК Склад,
	|	1 КАК СтрокаДокумента
	|ИЗ
	|	втАгрегаты КАК втАгрегатыТ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втДопОборудованиеТ.ДополнительноеОборудование КАК Агрегат,
	|	&СкладОтправитель КАК Склад,
	|	1 КАК СтрокаДокумента
	|ИЗ
	|	втДопОборудование КАК втДопОборудованиеТ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втДопОборудованиеТ.ДополнительноеОборудование КАК Агрегат,
	|	&СкладПолучатель КАК Склад,
	|	1 КАК СтрокаДокумента
	|ИЗ
	|	втДопОборудование КАК втДопОборудованиеТ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	упАгрегатыНаСкладах.Агрегат КАК Агрегат,
	|	упАгрегатыНаСкладах.Склад КАК Склад,
	|	0 КАК СтрокаДокумента
	|ИЗ
	|	РегистрНакопления.упАгрегатыНаСкладах КАК упАгрегатыНаСкладах
	|ГДЕ упАгрегатыНаСкладах.Регистратор = &Ссылка
	|;
	|//{Запрос: 4 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКонтрольАгрегатовТ.Агрегат КАК Агрегат,
	|	втКонтрольАгрегатовТ.Склад КАК Склад,
	|	СУММА(втКонтрольАгрегатовТ.СтрокаДокумента) КАК СтрокаДокумента
	|ИЗ
	|	втКонтрольАгрегатов КАК втКонтрольАгрегатовТ
	|СГРУППИРОВАТЬ ПО
	|	втКонтрольАгрегатовТ.Агрегат,
	|	втКонтрольАгрегатовТ.Склад
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("Агрегаты", Агрегаты.Выгрузить(,"Агрегат"));
	Запрос.УстановитьПараметр("ДополнительноеОборудование", ДополнительноеОборудование.Выгрузить(,"ДополнительноеОборудование"));
	
	Результат = Запрос.Выполнить();			   
	
	ДополнительныеСвойства.Вставить("ОстаткиАгрегатов", Результат.Выгрузить());
	
	Результат = Запрос.ВыполнитьПакет();			   
	
	ИндексВыработкаАгрегатов = 2;
	ИндексКонтрольАгрегатов = 4; 
		
	ДополнительныеСвойства.Вставить("ОстаткиАгрегатов", Результат[ИндексВыработкаАгрегатов].Выгрузить());
	ДополнительныеСвойства.Вставить("КонтрольАгрегатов", Результат[ИндексКонтрольАгрегатов].Выгрузить());// Контролируются отрицательные остатки на складах.
	
КонецПроцедуры

// Процедура - выполнить контроль агрегатов.
//
Процедура ВыполнитьКонтрольАгрегатов(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокАгрегаты.Ссылка.СкладОтправитель КАК Склад,
	|	ДокАгрегаты.Агрегат КАК Агрегат
	|ПОМЕСТИТЬ втДокумент
	|ИЗ
	|	Документ.упПеремещениеАгрегатов.Агрегаты КАК ДокАгрегаты
	|ГДЕ
	|	ДокАгрегаты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упПеремещениеАгрегатовДополнительноеОборудование.Ссылка.СкладОтправитель,
	|	упПеремещениеАгрегатовДополнительноеОборудование.ДополнительноеОборудование
	|ИЗ
	|	Документ.упПеремещениеАгрегатов.ДополнительноеОборудование КАК упПеремещениеАгрегатовДополнительноеОборудование
	|ГДЕ
	|	упПеремещениеАгрегатовДополнительноеОборудование.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДокумент.Агрегат КАК Агрегат,
	|	ЕСТЬNULL(упАгрегатыНаСкладахОстатки.КоличествоОстаток, 0) КАК Количество
	|ИЗ
	|	втДокумент КАК втДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.упАгрегатыНаСкладах.Остатки(
	|				&Период,
	|				(Склад, Агрегат) В
	|					(ВЫБРАТЬ
	|						втДокумент.Склад,
	|						втДокумент.Агрегат
	|					ИЗ
	|						втДокумент КАК втДокумент)) КАК упАгрегатыНаСкладахОстатки
	|		ПО втДокумент.Склад = упАгрегатыНаСкладахОстатки.Склад
	|			И втДокумент.Агрегат = упАгрегатыНаСкладахОстатки.Агрегат
	|ГДЕ
	|	ЕСТЬNULL(упАгрегатыНаСкладахОстатки.КоличествоОстаток, 0) < 1";
	
	Граница = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая);
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Граница);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Агрегаты", ДополнительныеСвойства.Агрегаты);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.Агрегат) = Тип("СправочникСсылка.упШиныУзлыИАгрегаты") Тогда
				ТекстОшибки = НСтр(СтрШаблон("ru = 'Агрегат ""%1"" отсутствует в наличии на складе ""%2""'", Выборка.Агрегат, Реквизиты.Склад));
			Иначе
				ТекстОшибки = НСтр(СтрШаблон("ru = 'Доп. оборудование ""%1"" отсутствует в наличии на складе ""%2""'", Выборка.Агрегат, Реквизиты.Склад));
			КонецЕсли;
						
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,, Отказ);		
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
