#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрытьТекущуюФорму	= Ложь;
	
	мсвАдресов = Параметры.Адреса;
	
	Для каждого ЭлементАдрес Из мсвАдресов Цикл
		НоваяСтрока = СписокАдресов.Добавить();
		НоваяСтрока.Адрес = ЭлементАдрес;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НЕ ЗакрытьТекущуюФорму;	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КнопкаВыбратьНажатие(Элемент)
	ВыбраноЗначение();
КонецПроцедуры

&НаКлиенте
Процедура КнопкаВыходНажатие(Элемент)
	сткВозврата	= Новый Структура;
	сткВозврата.Вставить("ИмяФормыПерехода", "ФормаИсполнениеТочек");
	ЗакрытьТекущуюФорму	= Истина;
	Закрыть(сткВозврата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ВыбраноЗначение()
	ТекущиеДанные = Элементы.СписокАдресов.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ОповеститьОВыборе(ТекущиеДанные.Адрес)
	Иначе
		ОповеститьОВыборе(ПредопределенноеЗначение("Справочник.упАдреса.ПустаяСсылка"));
	КонецЕсли;
	сткВозврата =Новый Структура;
	сткВозврата.Вставить("ИмяФормыПерехода", "ФормаИсполнениеТочек");
	ЗакрытьТекущуюФорму = Истина;
	Закрыть(сткВозврата);
КонецПроцедуры

&НаКлиенте
Процедура СписокАдресовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбраноЗначение();
КонецПроцедуры
	
#КонецОбласти
