#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура БыстрыйПоиск(Команда)
	КлючЗаписи = сшпОбщегоНазначения.ПолучитьКлючЗаписиПоСтрокеПоиска("сшпОчередьВходящихСообщений", СтрокаБыстрогоПоиска);
	Если ТипЗнч(КлючЗаписи) = Тип("Строка") Тогда 
		ПоказатьОповещениеПользователя(КлючЗаписи);
	Иначе
		Элементы.Список.ТекущаяСтрока = КлючЗаписи;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурнал(Команда)
	
	ЭтаСтрока = Элементы.Список.ТекущиеДанные;
	Если ЭтаСтрока = Неопределено Тогда
		ПоказатьОповещениеПользователя("Укажите входящее сообщение");
	Иначе
		ПараметрыФормы = Новый Структура;
		//ПараметрыФормы.Вставить("СобытиеЖурналаРегистрации", "Обмен по ESB.Загрузка:");
		ПараметрыФормы.Вставить("ДатаНачала", ЭтаСтрока.ДатаРегистрации);
		ПараметрыФормы.Вставить("ДатаОкончания", ЭтаСтрока.ДатаИзменения);
		ФормаЖурнала = ПолучитьФорму("Обработка.ЖурналРегистрации.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
		ФормаЖурнала.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналПоИдентификаторуСообщения(Команда)
	ЭтаСтрока = Элементы.Список.ТекущиеДанные;
	Если ЭтаСтрока = Неопределено Тогда
		ПоказатьОповещениеПользователя("Укажите входящее сообщение");
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СобытиеЖурналаРегистрации", сшпМодульОбработкиДанных.СобытиеОбменПоESB());
		ПараметрыФормы.Вставить("Данные", ""+ЭтаСтрока.ИдентификаторСообщения);
		ПараметрыФормы.Вставить("ДатаНачала", ЭтаСтрока.ДатаРегистрации);
		ПараметрыФормы.Вставить("ДатаОкончания", ЭтаСтрока.ДатаИзменения);
		ФормаЖурнала = ПолучитьФорму("Обработка.ЖурналРегистрации.Форма",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор);
		ФормаЖурнала.Открыть();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
