
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	
	
	Если ЭтоПрицеп(ПараметрКоманды) Тогда
		ПараметрыФормы.Вставить("Отбор", Новый Структура("Прицеп", ПараметрКоманды));
		ПараметрыФормы.Вставить("КлючВарианта", "ВладелецПрицепа");
	Иначе
		ПараметрыФормы.Вставить("Отбор", Новый Структура("ТС", ПараметрКоманды));
		ПараметрыФормы.Вставить("КлючВарианта", "Основной");  
	КонецЕсли;

		ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОткрытьФорму("Отчет.упПрицепыТранспортныхСредств.Форма", 
	ПараметрыФормы, 
	ПараметрыВыполненияКоманды.Источник, 
	ПараметрыВыполненияКоманды.Уникальность, 
	ПараметрыВыполненияКоманды.Окно,
	ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ЭтоПрицеп(ТС) 
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТС,"Прицеп");
КонецФункции

#КонецОбласти


