
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Автообновление = Параметры.Автообновление;
	ПериодАвтообновления = Макс(Параметры.ПериодАвтообновления, 30);
	ОтображатьФакт = Параметры.ОтображатьФакт;
	ПоказыватьКарту = Параметры.ПоказыватьКарту;
	ПоказыватьПланировщик = Параметры.ПоказыватьПланировщик;
	
	ПроверятьРаботыСПроблемами = Параметры.ПроверятьРаботыСПроблемами;
	ПроверятьОпозданияВТочкиЗаданий = Параметры.ПроверятьОпозданияВТочкиЗаданий;
	ПроверятьНеотвеченныеСообщенияВодителя = Параметры.ПроверятьНеотвеченныеСообщенияВодителя;
	ПроверятьНаличиеФайлов = Параметры.ПроверятьНаличиеФайлов;
	ПроверятьИзмененныйПорядокЗаданий = Параметры.ПроверятьИзмененныйПорядокЗаданий;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	АвтообновлениеПриИзменении(Неопределено);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура АвтообновлениеПриИзменении(Элемент)
	
	Элементы.ПериодАвтообновления.Доступность = Автообновление;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	сткПараметры 	= Новый Структура();
	сткПараметры.Вставить("Автообновление", Автообновление);
	сткПараметры.Вставить("ПериодАвтообновления", ПериодАвтообновления);
	сткПараметры.Вставить("ОтображатьФакт", ОтображатьФакт);
	сткПараметры.Вставить("ПоказыватьКарту", ПоказыватьКарту);
	сткПараметры.Вставить("ПоказыватьПланировщик", ПоказыватьПланировщик);
	сткПараметры.Вставить("ПроверятьНеотвеченныеСообщенияВодителя", ПроверятьНеотвеченныеСообщенияВодителя);
	сткПараметры.Вставить("ПроверятьНаличиеФайлов", ПроверятьНаличиеФайлов);
	сткПараметры.Вставить("ПроверятьРаботыСПроблемами", ПроверятьРаботыСПроблемами);
	сткПараметры.Вставить("ПроверятьОпозданияВТочкиЗаданий", ПроверятьОпозданияВТочкиЗаданий);
	сткПараметры.Вставить("ПроверятьИзмененныйПорядокЗаданий", ПроверятьИзмененныйПорядокЗаданий);
	
	Закрыть(сткПараметры);
	
КонецПроцедуры

#КонецОбласти 