
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	МассивРемонтов = СформироватьРемонтИТОТСНаСервере(ПараметрКоманды, Отказ);
	Если ТипЗнч(МассивРемонтов) = Тип("Строка") Тогда
		ПоказатьОповещениеПользователя(МассивРемонтов);
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(МассивРемонтов, Истина);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Отказ Тогда
		Для каждого ТекущийРемонт Из МассивРемонтов Цикл
			ОткрытьФорму("Документ.упРемонтИТОТС.ФормаОбъекта", Новый Структура("Ключ", ТекущийРемонт), ПараметрыВыполненияКоманды.Источник);
		КонецЦикла;
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Ремонт не сформирован.'"),, НСтр("ru = 'Подробности см. в Журнале регистрации.'"), БиблиотекаКартинок.Ошибка32);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьРемонтИТОТСНаСервере(СписокЗаявокНаРемонт, Отказ)
	ТипРемонта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СписокЗаявокНаРемонт.ВидРемонта, "ТипРемонта");
	Если ЗначениеЗаполнено(ТипРемонта) Тогда
		Возврат Документы.упЗаявкаНаРемонтИТОТС.СформироватьРемонтИТОТС(СписокЗаявокНаРемонт, , , Отказ);
	Иначе
		ТекстОшибки = НСтр(СтрШаблон("ru = 'В документе %1 не заполнен вид ремонта'", СписокЗаявокНаРемонт)); 
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование Ремонта и ТО транспортного средства'"), УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
	
КонецФункции // СформироватьРемонтИТОТСНаСервере()

#КонецОбласти 
