
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Вызывается расширением формы при необходимости проверки заполнения реквизитов в форме.
//
// Параметры:
//  Отказ - Булево - Выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивУдаляемыхЭлементов = Новый Массив;
	
	Если НЕ Проезды Тогда 
		МассивУдаляемыхЭлементов.Добавить("НомерОкончанияПроезды");
		МассивУдаляемыхЭлементов.Добавить("НомерНачалоПроезды");
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовПроезды");
		МассивУдаляемыхЭлементов.Добавить("ТипСимволовПроезды");
	ИначеЕсли НЕ ПостояннаяДлинаНомераПроезды Тогда 	
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовПроезды");
	КонецЕсли;	
	
	Если НЕ Стеллажи Тогда 
		МассивУдаляемыхЭлементов.Добавить("НомерОкончанияСтеллажи");
		МассивУдаляемыхЭлементов.Добавить("НомерНачалоСтеллажи");
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовСтеллажи");
		МассивУдаляемыхЭлементов.Добавить("ТипСимволовСтеллажи");
	ИначеЕсли НЕ ПостояннаяДлинаНомераСтеллажи Тогда 	
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовСтеллажи");
	КонецЕсли;	
	
	Если НЕ Ярусы Тогда
		МассивУдаляемыхЭлементов.Добавить("НомерОкончанияЯрусы");
		МассивУдаляемыхЭлементов.Добавить("НомерНачалоЯрусы");
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовЯрусы");
		МассивУдаляемыхЭлементов.Добавить("ТипСимволовЯрусы");
	ИначеЕсли НЕ ПостояннаяДлинаНомераЯрусы Тогда
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовЯрусы");
	КонецЕсли;	
	
	Если НЕ Позиции Тогда 
		МассивУдаляемыхЭлементов.Добавить("НомерОкончанияПозиции");
		МассивУдаляемыхЭлементов.Добавить("НомерНачалоПозиции");
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовПозиции");
		МассивУдаляемыхЭлементов.Добавить("ТипСимволовПозиции");
	ИначеЕсли НЕ ПостояннаяДлинаНомераПозиции Тогда
		МассивУдаляемыхЭлементов.Добавить("КоличествоСимволовПозиции");		
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивУдаляемыхЭлементов);
	
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти

#КонецЕсли