#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	ДокументСсылка = СформироватьСписаниеПлановПоЗаданиюНаПеревозку(ПараметрКоманды, ТекстОшибки, Отказ);
	
	Если Не Отказ Тогда
		ОткрытьФорму("Документ.упСписаниеПлановПоЗаданиюНаПеревозку.ФормаОбъекта", Новый Структура("Ключ", ДокументСсылка), ПараметрыВыполненияКоманды.Источник);
	Иначе
		Если ТекстОшибки = "" Тогда
			ТекстОшибки = НСтр("ru = 'Документ не сформирован.'");		    
		КонецЕсли; 
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьСписаниеПлановПоЗаданиюНаПеревозку(ЗаданиеНаПеревозку, ТекстОшибки, Отказ)
	
	Возврат Документы.упСписаниеПлановПоЗаданиюНаПеревозку.СформироватьСписаниеПлановПоЗаданиюНаПеревозку(ЗаданиеНаПеревозку, ТекстОшибки, Отказ);
	
КонецФункции

#КонецОбласти 