#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	БлокируемыеРеквизиты.Добавить("Организация");
	БлокируемыеРеквизиты.Добавить("Подразделение");
	БлокируемыеРеквизиты.Добавить("ТранспортноеСредство");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Процедура заполнения дополнительного свойства "Прицепы".
//
Процедура ПолучениеПривязаныхПрицеповТСНаСервере(ДатаСнятияСУчета,пТранспортноеСредство, ДополнительныеСвойства) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упПрицепы.Прицеп КАК Прицеп,
	               |	упПрицепы.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	упПрицепы.Операция
	               |ПОМЕСТИТЬ Прицепы
	               |ИЗ
	               |	РегистрСведений.упПрицепыТранспортныхСредств.СрезПоследних(&ДатаСнятияСУчета, ТранспортноеСредство = &ТранспортноеСредство) КАК упПрицепы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Прицепы.Прицеп,
	               |	Прицепы.ТранспортноеСредство,
	               |	ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Снято) КАК Операция
	               |ИЗ
	               |	Прицепы КАК Прицепы
	               |ГДЕ
	               |	Прицепы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Установлено)";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство", пТранспортноеСредство);	
	Запрос.УстановитьПараметр("ДатаСнятияСУчета", Новый Граница(ДатаСнятияСУчета, ВидГраницы.Включая));
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ДополнительныеСвойства.Вставить("Прицепы", Результат.Выгрузить());
	КонецЕсли; 	
КонецПроцедуры

// Проверим какие агрегаты установленны на транспортное средство.
//
// Параметры:
//  ДатаСнятияСУчета  - Дата - Период с которго будет снято с учета транспортное средство.
//  ТранспортноеСредство  - СправочникСсылка.упТранспортныеСредства - Ссылка на транспортное средство.
//  ДополнительныеСвойства - Структура - В структура добавим результат проверки.
//
Процедура ПолучитьАгрегатыТС(ДатаСнятияСУчета, ТранспортноеСредство, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АгрегатыТССП.Агрегат КАК Агрегат,
	|	АгрегатыТССП.ХодоваяШина КАК ХодоваяШина,
	|	АгрегатыТССП.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Снято) КАК Операция
	|ИЗ
	|	РегистрСведений.упАгрегатыТранспортныхСредств.СрезПоследних(&Период, ТранспортноеСредство = &ТС) КАК АгрегатыТССП
	|ГДЕ
	|	АгрегатыТССП.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Установлено)";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(ДатаСнятияСУчета, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ТС", ТранспортноеСредство);
	
	Выборка = Запрос.Выполнить();
	
	Если НЕ Выборка.Пустой() Тогда
		ДополнительныеСвойства.Вставить("Агрегаты", Выборка.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры // ПолучитьАгрегатыТС()

#Область Проведение

#КонецОбласти

#КонецОбласти

#Область ПроцедурыФункцииПечати

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
  // Нет.
   	
КонецПроцедуры // ДобавитьКомандыПечати()

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//  ПараметрыПечати - Структура - дополнительные настройки печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати - СписокЗначений - объекты печати: 
//											  * значение - ссылка на объект.
//                                            * представление - имя области в которой был выведен объект (выходной параметр).
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Нет.
	
КонецПроцедуры // Печать()

#КонецОбласти

#КонецЕсли
