
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	упРаботаСоСтатусамиКлиент.УстановитьСтатусДокументам(ПараметрКоманды, ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.Новая"));
	
	Для каждого СсылкаНаЗаявку Из ПараметрКоманды Цикл	
		Структура = Новый Структура("Статус, Ссылка",ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.Новая"),СсылкаНаЗаявку);
		Оповестить("СменаСтатуса",Структура, ПараметрыВыполненияКоманды.Источник);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 

