
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокИсключений = Новый СписокЗначений;
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетПутевыхЛистов") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьПутевогоЛиста);
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ИзменениеСтатусаПутевогоЛиста);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьСобытияМониторинга);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяУсловияПеревозок") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьЗапросаУсловийПеревозки);
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ИзменениеСтатусаЗапросаУсловийПеревозки);
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьЗадачиНаОтправкуФайлов);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьЗадачиИсполнителя);
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяКонтейнерныеПеревозки") Тогда
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ЗаписьОперацийСКонтейнером);
		СписокИсключений.Добавить(Перечисления.упТипыДействийСобытий.ИзменениеСтатусаОперацийСКонтейнером);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упТипыДействийСобытий.Ссылка
	|ИЗ
	|	Перечисление.упТипыДействийСобытий КАК упТипыДействийСобытий
	|ГДЕ
	|	НЕ упТипыДействийСобытий.Ссылка В (&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	упТипыДействийСобытий.Порядок";
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти