
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыНастроекФормы = Параметры.ПараметрыНастроекФормы;
	Если НЕ ПараметрыНастроекФормы = Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыНастроекФормы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("ВключатьВЗаголовокВершиныНаГрафеНаименованиеАдреса", ВключатьВЗаголовокВершиныНаГрафеНаименованиеАдреса);
		сткПараметры.Вставить("ВыводитьИнформациюОПараметрахГрузовНаРебрахГрафа"  , ВыводитьИнформациюОПараметрахГрузовНаРебрахГрафа);
		сткПараметры.Вставить("ИспользоватьИерархическоеПредставлениеГрафа"       , ИспользоватьИерархическоеПредставлениеГрафа);
		сткПараметры.Вставить("ПоказыватьОтмененныеЭтапыПеревозкиНаГрафе"         , ПоказыватьОтмененныеЭтапыПеревозкиНаГрафе);
		сткПараметры.Вставить("ФигураВершиныГрафа"                                , ФигураВершиныГрафа);
		сткПараметры.Вставить("АвтоматическиОпределятьГрузовойСоставНовогоЭтапа"  , АвтоматическиОпределятьГрузовойСоставНовогоЭтапа);
		Закрыть(сткПараметры);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Заполните обязательные настройки!'"));
	КонецЕсли;
	
КонецПроцедуры // ЗавершитьРедактирование()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры // Отмена()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти 
