
#Область ПрограммныйИнтерфейс

// Функция возвращает значение константы.
//
// Параметры:
//  Константа - Строка - имя константы.
//
// Возвращаемое значение:
//  Произвольное - значение константы.
//
Функция ПолучитьЗначениеКонстанты(Константа) Экспорт
	
	Возврат Константы[Константа].Получить();
	
КонецФункции

// Получает текущий сеанс базы
Функция ТекущийСеанс() Экспорт 

	Сеансы = ПолучитьСеансыИнформационнойБазы();
	НомерСеанса = НомерСеансаИнформационнойБазы();
	Для Каждого Сеанс Из Сеансы Цикл 
		Если Сеанс.НомерСеанса = НомерСеанса Тогда 
			Результат = Сеанс;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Результат = Неопределено Тогда
		ТекстСообщения = Нстр("ru = 'Собственный сеанс не найден'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли; 
	Возврат Результат;

КонецФункции

// Функция - Получить построитель запроса объекта метаданных кэш
//
// Параметры:
//  ОпределительМетаданных	 - ОпределительМетаданных	 - тип или полное имя.
//  ВыбираемыеПоля			 - Строка	 - поля.
//  ЛиРазличные			 - Булево	 - различные.
//  Первые				 - Число	 - первые.
//  Автоупорядочивание		 - Булево	 - автоупорядочивание.
// 
// Возвращаемое значение:
//  ПостроительЗапроса - построитель запроса
//
Функция ПолучитьПостроительЗапросаОбъектаМетаданныхКэш(Знач ПолноеИмяМДИлиСсылкаТипа, ВыбираемыеПоля = "*", ЛиРазличные = Ложь,
	Первые = 0, Автоупорядочивание = Ложь) Экспорт
	
	Если ТипЗнч(ПолноеИмяМДИлиСсылкаТипа) = Тип("Строка") Тогда
		ПолноеИмяМД = ПолноеИмяМДИлиСсылкаТипа;
	Иначе
		ПолноеИмяМД = ПолноеИмяМДИлиСсылкаТипа.Метаданные().ПолноеИмя();
	КонецЕсли; 
	Построитель = упСервисныеФункции.ПолучитьПостроительЗапросаОбъектаМетаданных(ПолноеИмяМД, ВыбираемыеПоля, ЛиРазличные,
		Первые, Автоупорядочивание);
	Возврат Построитель;
	
КонецФункции // ПолучитьПостроительЗапроса()

// Функция - Проверяет совпадение часовых поясов.
//
// Параметры:
//  ЧасовойПояс1	 - СправочникСсылка.упЧасовыеПояса	 - часовой пояс1.
//  ЧасовойПояс2	 - СправочникСсылка.упЧасовыеПояса	 - часовой пояс2.
// 
// Возвращаемое значение:
//  Булево - Истина, если совпадают
//
Функция СовпадаютЧасовыеПояса(ЧасовойПояс1, ЧасовойПояс2) Экспорт
	
	Результат  = Истина;
	
	Если Истина
		И ЧасовойПояс1 <> ЧасовойПояс2 
		И ЗначениеЗаполнено(ЧасовойПояс2)
		И ЗначениеЗаполнено(ЧасовойПояс1)
	Тогда
	
	     УниверсальноеВремяВЧасовомПоясеUTC = УниверсальноеВремя(ТекущаяУниверсальнаяДата(), "UTC");
		
		СдвигUTCЧасовойПояс1       = СмещениеСтандартногоВремени(ЧасовойПояс1, УниверсальноеВремяВЧасовомПоясеUTC);
		СдвигUTCЛетнееЧасовойПояс1 = СмещениеЛетнегоВремени(ЧасовойПояс1, УниверсальноеВремяВЧасовомПоясеUTC);
		СдвигЧасовойПояс1 = СдвигUTCЧасовойПояс1 + СдвигUTCЛетнееЧасовойПояс1;
		
		СдвигUTCЧасовойПояс2       = СмещениеСтандартногоВремени(ЧасовойПояс2, УниверсальноеВремяВЧасовомПоясеUTC);
		СдвигUTCЛетнееЧасовойПояс2 = СмещениеЛетнегоВремени(ЧасовойПояс2, УниверсальноеВремяВЧасовомПоясеUTC);
		СдвигЧасовойПояс2 = СдвигUTCЧасовойПояс2 + СдвигUTCЛетнееЧасовойПояс2;
	
		Результат  = СдвигЧасовойПояс1 = СдвигЧасовойПояс2;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти