
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Для Каждого текЗначений Из Параметры.СписокЗначений Цикл 
		НоваяСтрока = СписокПеревозчиков.Добавить();
		НоваяСтрока.Перевозчик = текЗначений.Значение;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПеревозчиковОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	сткПоиска = Новый Структура("Перевозчик");
	Для Каждого текЗначение Из ВыбранноеЗначение Цикл 
		сткПоиска.Перевозчик = текЗначение;
		Если СписокПеревозчиков.НайтиСтроки(сткПоиска).Количество() = 0 Тогда 
			НоваяСтрока = СписокПеревозчиков.Добавить();
			НоваяСтрока.Перевозчик = текЗначение;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура Подбор(Команда)
	
	сткОтбор     = Новый Структура("Перевозчик", Истина);
	сткПараметры = Новый Структура("МножественныйВыбор, ЗакрыватьПриВыборе, Отбор", Истина, Ложь, сткОтбор);
	ОткрытьФорму("Справочник.упПартнеры.ФормаВыбора", сткПараметры, Элементы.СписокПеревозчиков);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	Для Каждого текЗначение Из СписокПеревозчиков Цикл 
		Если ЗначениеЗаполнено(текЗначение.Перевозчик) Тогда 
			СписокЗначений.Добавить(текЗначение.Перевозчик);
		КонецЕсли;	
	КонецЦикла;
	
	Закрыть(СписокЗначений);
	
КонецПроцедуры

#КонецОбласти 