
#Область ОбработчикиСобытийФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	УстановитьНастройкиДоступностьЭлементовФормы();
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПослеЗаписи" формы.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьНастройкиДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента "ТипЗначения"
//
Процедура ТипЗначенияПриИзменении(Элемент)
	УстановитьНастройкиДоступностьЭлементовФормы();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьНастройкиДоступностьЭлементовФормы()
	Элементы.СписокЗначенийДатчиков.Доступность = (Объект.ТипЗначения = ПредопределенноеЗначение("Перечисление.упТипыЗначений.Дискретный"));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗначенийДатчиков, "Владелец", Объект.Ссылка, ВидСравненияКомпоновкиДанных.Равно, "Владелец", Истина, , );
КонецПроцедуры

#КонецОбласти

