#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	

// Функция возвращает текущий статус документа
//
// Параметры:
//  Ссылка  - ДокументСсылка.упИсходящаяПретензия - документ, которого необходимо получить.
//
// Возвращаемое значение:
//   ПеречислениеСсылка   - Ссылка на перечисление.
//
Функция ПолучитьСтатус(Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда 
		Возврат Перечисления.упСтатусыИсходящейПретензии.Новая;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	упСтатусыИсходящихПретензийСрезПоследних.Статус,
	|	упИсходящаяПретензия.ПометкаУдаления
	|ИЗ
	|	Документ.упИсходящаяПретензия КАК упИсходящаяПретензия
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упСтатусыИсходящихПретензий.СрезПоследних(, Документ = &Документ) КАК упСтатусыИсходящихПретензийСрезПоследних
	|		ПО упСтатусыИсходящихПретензийСрезПоследних.Документ = упИсходящаяПретензия.Ссылка
	|ГДЕ
	|	упИсходящаяПретензия.Ссылка = &Документ";
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Статус) Тогда 
		Возврат Выборка.Статус;
	ИначеЕсли Выборка.ПометкаУдаления = Истина Тогда 	
		Возврат Перечисления.упСтатусыИсходящейПретензии.Отменена;
	Иначе	
		Возврат Перечисления.упСтатусыИсходящейПретензии.Новая;
	КонецЕсли;
	
КонецФункции	

#КонецОбласти

#Область ПроцедурыФункцииПечати

// Заполняет список команд печати.
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	  
КонецПроцедуры // ДобавитьКомандыПечати()

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//  ПараметрыПечати - Структура - дополнительные настройки печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати - СписокЗначений - объекты печати: 
//											  * значение - ссылка на объект.
//                                            * представление - имя области в которой был выведен объект (выходной параметр).
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

КонецПроцедуры // Печать()

// Функция формирует печатную форму документа.
//
// Параметры:
//  Тип - Строка - тип печатной формы.
//  МассивОбъектов - Массив - массив документов для печати.
//  ОбъектыПечати - СписокЗначений - объект печати.
//
// Возвращаемое значение:
//  ТабличныйДокумент
//
Функция СформироватьПечатнуюФорму_ВходящаяПретензия(МассивОбъектов, ОбъектыПечати, ПараметрыПечати) Экспорт
	
КонецФункции // СформироватьПечатнуюФорму_ЗаявкаНаТС()

#КонецОбласти

#Область ИнтерфейсДляРаботыСПодсистемойВзаимодействия

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Взаимодействия.

// Возвращает партнера и контактных лиц сделки.
// 
// Параметры:
//  Ссылка  - ДокументСсылка.упВходящаяПретензия - Ссылка на документ.
//
// Возвращаемое значение:
//   Массив   - Контакты - Ссылки на контакты.
//
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПоКонтактам();
	Запрос.УстановитьПараметр("Предмет",Ссылка);
	
	НачатьТранзакцию();
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Результат = Неопределено;
		Иначе
			Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контакт");
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Вовращает текст запроса по контактам.
//
// Параметры:
//  ТекстВременнаяТаблица  - Строка - Данные.
//  Объединить - Булево - Выпонлить.
//
// Возвращаемое значение:
//   Строка - Результат выполнения.
//
Функция ТекстЗапросаПоКонтактам(ТекстВременнаяТаблица = "", Объединить = Ложь) Экспорт
	
	ШаблонВыбрать = ?(Объединить,"ВЫБРАТЬ РАЗЛИЧНЫЕ","ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ");
	
	ТекстЗапроса = "
	|%ШаблонВыбрать%
	|	упИсходящаяПретензия.Партнер КАК Контакт " + ТекстВременнаяТаблица + "
	|ИЗ
	|	Документ.упИсходящаяПретензия КАК упИсходящаяПретензия
	|ГДЕ
	|	упИсходящаяПретензия.Ссылка = &Предмет
	|	И (НЕ упИсходящаяПретензия.Партнер = ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка))";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ШаблонВыбрать%",ШаблонВыбрать);
	
	Если Объединить Тогда
		
		ТекстЗапроса = "
		| ОБЪЕДИНИТЬ ВСЕ
		|" + ТекстЗапроса;
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли