&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("ВидПравила") Тогда
		
		ДанныеВыбора = Справочники.упТипыСобытийМониторинга.ПолучитьДанныеВыбораПоВидуПравил(Параметры.ВидПравила);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", ДанныеВыбора, ВидСравненияКомпоновкиДанных.ВСписке,, Истина);	
		
	КонецЕсли;
	
КонецПроцедуры