#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий	

Процедура ПриКопировании(ОбъектКопирования)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РеквизитыОбъекта = Новый Структура();
	РеквизитыОбъекта.Вставить("Период",					Дата);
	РеквизитыОбъекта.Вставить("ДатаНачалаДвижения",		ДатаНачалаДвижения);
	РеквизитыОбъекта.Вставить("ДатаОкончанияДвижения", 	ДатаОкончанияДвижения);
	РеквизитыОбъекта.Вставить("ДолготаВьезда", 			ДолготаВьезда);
	РеквизитыОбъекта.Вставить("ДолготаСъезда", 			ДолготаСъезда);
	РеквизитыОбъекта.Вставить("НаименованиеОперации", 	НаименованиеОперации);
	РеквизитыОбъекта.Вставить("НомерБортовогоУстройства", НомерБортовогоУстройства);
	РеквизитыОбъекта.Вставить("Расстояние", 			Расстояние);
	РеквизитыОбъекта.Вставить("ТранспортноеСредство", 	ТранспортноеСредство);
	РеквизитыОбъекта.Вставить("Трасса", 				Трасса);
	РеквизитыОбъекта.Вставить("УникальныйНомер", 		УникальныйНомер);
	РеквизитыОбъекта.Вставить("ШиротаВьезда", 			ШиротаВьезда);
	РеквизитыОбъекта.Вставить("ШиротаСъезда", 			ШиротаСъезда);
				
	// Формируются расходы
	упОперацияСистемыПлатон.СформироватьДвиженияОперацииСистемыПлатон(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);	

КонецПроцедуры

#КонецОбласти

#КонецЕсли
