
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстОшибки = "";
	МассивДокументов = Новый СписокЗначений;
    МассивДокументов.ЗагрузитьЗначения(ПараметрКоманды);
    МассивДокументов = МассивДокументов.ВыгрузитьЗначения();
	ПроверитьВозможностьУстановкиСтатуса(МассивДокументов,ТекстОшибки);
	Если НЕ ТекстОшибки = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли; 
	упРаботаСоСтатусамиКлиент.УстановитьСтатусДокументам(МассивДокументов, ПредопределенноеЗначение("Перечисление.упСтатусыЗаданияНаПеревозкуГруза.КПланированию"));
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьУстановкиСтатуса(МассивДокументов,ТекстОшибки)
	
	МассивДокументовДляСменыСтатуса = Новый Массив;
		
	Для каждого Задание Из МассивДокументов Цикл
		
		ОбъектЗадание = Задание.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(ОбъектЗадание.ВидПеревозки) Тогда
		    МассивДокументовДляСменыСтатуса.Добавить(Задание);
		Иначе	
			ТекстОшибки = ТекстОшибки + НСтр("ru = ' Статус не изменен, не заполнен реквизит ""Вид перевозки""  '") +  Задание;
		КонецЕсли;
		
	КонецЦикла;	
	
	МассивДокументов = МассивДокументовДляСменыСтатуса;

КонецПроцедуры


#КонецОбласти 
