
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ТолькоПросмотр Тогда 
		Если Запись.ПериодичностьОтправкиКоординат = 0 Тогда 
			Запись.ПериодичностьОтправкиКоординат = 60;
		КонецЕсли;	
		Если Запись.ВремяОжиданияПодтвержденияНовыхТочек = 0 Тогда 
			Запись.ВремяОжиданияПодтвержденияНовыхТочек = 300;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Истина
		И Запись.ЗапрещеноИзменениеПорядкаПогрузкиНаСкладах
		И Не ЗначениеЗаполнено(Запись.ВидАдресаСклада)
	Тогда
		ТекстСообщения = Нстр("ru = 'Не заполнено поле ""Вид адреса склада""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ВидАдресаСклада",	"Запись",	Отказ);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РазрешеноИзменятьПорядокТочекПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоОднаТочкаПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноОтменятьНовыеТочкиПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВедетсяРозничнаяПродажаВРейсеПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКассовойТехникиПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноОтложенноеВыполнениеЧастиРаботПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()

	Элементы.РазрешеноИзменятьПорядокТочек.Доступность                    = НЕ Запись.ТолькоОднаТочка;
	Элементы.ТолькоОднаТочка.Доступность                                  = НЕ Запись.РазрешеноИзменятьПорядокТочек;
	Элементы.ВремяОжиданияПодтвержденияНовыхТочек.Доступность             = Запись.РазрешеноОтменятьНовыеТочки;
	Элементы.РазрешенаНастройкаКассовогоОборудования.Доступность          = Запись.ВедетсяРозничнаяПродажаВРейсе;
	Элементы.ЗакрыватьКассовуюСменуПослеВыполненияРейса.Доступность       = Запись.ВедетсяРозничнаяПродажаВРейсе;
	Элементы.ВидКассовойТехники.Доступность                               = Запись.ВедетсяРозничнаяПродажаВРейсе;
	Элементы.КассаККМПоУмолчанию.Доступность                              = (Запись.ВедетсяРозничнаяПродажаВРейсе И Не Запись.ВидКассовойТехники = ПредопределенноеЗначение("Перечисление.упВариантыВыбораВидовКассовойТехники.АТОЛ"));
	Элементы.ВидДоступаДействиеОтложенноеВыполнениеЧастиРабот.Доступность = Запись.РазрешеноОтложенноеВыполнениеЧастиРабот;
	
КонецПроцедуры

#КонецОбласти 
