
// Функция - ВыполнитьОтладкуОбработчика
// 
// Возвращаемое значение:
// ЗаписьXML  - параметры подключения к информационной базе 1С.
//
Функция ВыполнитьОтладкуОбработчика(ФорматСообщения, Пакет, текИдентификатор) Экспорт
	
	xdtoПакет = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, Пакет);
	сткПараметры = сшпОбщегоНазначения.ПолучитьПараметрыСообщенияСтруктурой(xdtoПакет);
	
	ОписаниеОшибки = "";		 

	Если сткПараметры.Свойство("Type") Тогда                     
		ЭтоВходящийОбработчик = сткПараметры.Type = "InputHandler";
	Иначе
		ОписаниеОшибки = "В запросе отсутсвует свойство Type";
		Возврат сшпВзаимодействиеСАдаптером.ОтправитьСистемноеСообщение(СформироватьСообщениеСОшибкой(ОписаниеОшибки, текИдентификатор, xdtoПакет.ReplyTo));
	КонецЕсли;
	
	Если ЭтоВходящийОбработчик Тогда 
		ОбъектОбработки = сшпОбщегоНазначения.ПолучитьОбъектXDTO(ФорматСообщения, xdtoПакет.Body);
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НачатьТранзакцию();
		Попытка
			ОбъектОбработки = ВыполнитьПоискОбъектаОтладки(xdtoПакет.Body);
		Исключение
			ОписаниеОшибки = "Ошибка при поиске объекта для отладки: " + ОписаниеОшибки();
			Если ТранзакцияАктивна() Тогда 
				ОтменитьТранзакцию();
			КонецЕсли;
			Возврат сшпВзаимодействиеСАдаптером.ОтправитьСистемноеСообщение(СформироватьСообщениеСОшибкой(ОписаниеОшибки, текИдентификатор, xdtoПакет.ReplyTo));		
		КонецПопытки;
		ОтменитьТранзакцию();
		
		Если ОбъектОбработки = Неопределено Тогда 
			ОписаниеОшибки = "Ошибка при поиске объекта для отладки: значение переменной ""ОбъектОбработки"" не установлено.";
			Возврат сшпВзаимодействиеСАдаптером.ОтправитьСистемноеСообщение(СформироватьСообщениеСОшибкой(ОписаниеОшибки, текИдентификатор, xdtoПакет.ReplyTo));		
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	КодОтладки = сткПараметры.Code;
	СостояниеСообщения = Перечисления.сшпСтатусыСообщений.Обработано; 
	
	//Выполнение кода
	РезультатОбработки = Неопределено;
	МассивЗамеров = Новый Массив;
	РезультатОтладки = Новый ТаблицаЗначений;   
	РезультатОтладки.Колонки.Добавить("ЗначениеПеременной");
	РезультатОтладки.Колонки.Добавить("ИмяПеременной");
	РезультатОтладки.Колонки.Добавить("ТипПеременной");
	РезультатОтладки.Колонки.Добавить("ПеременнаяНеОпределена");
	РезультатОтладки.Колонки.Добавить("НомерСтроки");
	РезультатОтладки.Колонки.Добавить("ВложенныеЗначения"); 
	
	НомерСтроки = 0;                                                                                                                       
	НачатьТранзакцию();   				                    			 
	Попытка 
		ИмяПрофиляБезопасности = "Datareon";
		УстановитьБезопасныйРежим(ИмяПрофиляБезопасности);
		Если БезопасныйРежим() = Истина Тогда //полученный профиль безопасности отсутствует
			УстановитьБезопасныйРежим(Ложь);
		КонецЕсли;
		УстановитьПривилегированныйРежим(Истина);	 
		
		Если ЭтоВходящийОбработчик Тогда 
			ВыполнитьКодОтладкиВходящий(КодОтладки, НомерСтроки, РезультатОтладки, ОбъектОбработки, ФорматСообщения, СостояниеСообщения, МассивЗамеров);	
		Иначе
			РезультатОбработки = ВыполнитьКодОтладкиИсходящий(КодОтладки, НомерСтроки, РезультатОтладки, ОбъектОбработки, ФорматСообщения, СостояниеСообщения, МассивЗамеров);	
		КонецЕсли;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		НоваяСтрока = РезультатОтладки.Добавить();
		НоваяСтрока.ИмяПеременной = "Исключение";
		НоваяСтрока.ЗначениеПеременной = ИнформацияОбОшибке.Описание + ?(не ИнформацияОбОшибке.Причина = Неопределено, ": " + ИнформацияОбОшибке.Причина.Описание, "");
		НоваяСтрока.ТипПеременной = ИнформацияОбОшибке.ИсходнаяСтрока;
		НоваяСтрока.НомерСтроки = НомерСтроки;
		СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОшибкаОбработки;
	КонецПопытки;  	
	Если ТранзакцияАктивна() Тогда 
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Если ТипЗнч(МассивЗамеров) = Тип("Массив") Тогда 
		СобраноСчетчиков = МассивЗамеров.Количество();
	Иначе
		СобраноСчетчиков = 0;
	КонецЕсли;
	
	xmlРезультат = Новый ЗаписьXML;
	xmlРезультат.УстановитьСтроку("UTF-8");
	xmlРезультат.ЗаписатьНачалоЭлемента("result");
	
	//Значения переменных
	РезультатОтладки.Колонки.Добавить("НомерИтерации");
	КоличествоИтераций = 0;
	НомерСтроки = -1;
	Для Каждого текСтрока Из РезультатОтладки Цикл 
		Если Не НомерСтроки = текСтрока.НомерСтроки Тогда
			КоличествоИтераций = КоличествоИтераций + 1;
			НомерСтроки = текСтрока.НомерСтроки;
		КонецЕсли;
		текСтрока.НомерИтерации = КоличествоИтераций;
	КонецЦикла;

	Для НомерИтерации = 1 По КоличествоИтераций Цикл 
		
		РезультатПоИтерации = РезультатОтладки.НайтиСтроки(Новый Структура("НомерИтерации", НомерИтерации));
		
		xmlРезультат.ЗаписатьНачалоЭлемента("row");
		xmlРезультат.ЗаписатьАтрибут("number", XMLСтрока(РезультатПоИтерации[0].НомерСтроки));
		xmlРезультат.ЗаписатьАтрибут("duration", ?(НомерИтерации <= СобраноСчетчиков, XMLСтрока(МассивЗамеров[НомерИтерации-1]), ""));
		
		Для каждого текСтрока из РезультатПоИтерации цикл
			ЗаписатьЗначениеПеременной(xmlРезультат, текСтрока);
		КонецЦикла;
			
		xmlРезультат.ЗаписатьКонецЭлемента();
	КонецЦикла;
	
	//Результат выполнения обработчика
	xmlРезультат.ЗаписатьНачалоЭлемента("esbmessage");
	xmlРезультат.ЗаписатьАтрибут("result", XMLСтрока(СостояниеСообщения));
	Если Не ЭтоВходящийОбработчик И Не РезультатОбработки = Неопределено Тогда 
		xmlРезультат.ЗаписатьСекциюCDATA(сшпОбщегоНазначения.СформироватьСообщениеESB_HTTP(ФабрикаXDTO, РезультатОбработки));
	КонецЕсли;
	xmlРезультат.ЗаписатьКонецЭлемента();
		
	xmlРезультат.ЗаписатьКонецЭлемента();
	
	РезультатОбработки = сшпОбщегоНазначения.СформироватьСтруктуруПакета("SSM","Esb-DebugResult", xmlРезультат.Закрыть());
	РезультатОбработки.CorrelationId = текИдентификатор;
	РезультатОбработки.ReplyTo = xdtoПакет.ReplyTo;
	                           
	Возврат сшпВзаимодействиеСАдаптером.ОтправитьСистемноеСообщение(РезультатОбработки);
КонецФункции

Функция СформироватьСообщениеСОшибкой(ОписаниеОшибки, CorrelationId, ReplyTo)
	
	xmlРезультат = Новый ЗаписьXML;
	xmlРезультат.УстановитьСтроку("UTF-8");
	xmlРезультат.ЗаписатьНачалоЭлемента("result");
	xmlРезультат.ЗаписатьНачалоЭлемента("request");
	xmlРезультат.ЗаписатьАтрибут("error", 	ОписаниеОшибки);
	xmlРезультат.ЗаписатьКонецЭлемента();
	xmlРезультат.ЗаписатьКонецЭлемента();
	РезультатОбработки = сшпОбщегоНазначения.СформироватьСтруктуруПакета("SSM","Esb-DebugResult", xmlРезультат.Закрыть());
	РезультатОбработки.CorrelationId = CorrelationId;
	РезультатОбработки.ReplyTo = ReplyTo;
	
	Возврат РезультатОбработки;
КонецФункции

Процедура ЗаписатьЗначениеПеременной(xmlРезультат, текСтрока)
	xmlРезультат.ЗаписатьНачалоЭлемента("variable");
	xmlРезультат.ЗаписатьАтрибут("name", 	XMLСтрока(текСтрока.ИмяПеременной));
	xmlРезультат.ЗаписатьАтрибут("value", 	XMLСтрока(текСтрока.ЗначениеПеременной));
	xmlРезультат.ЗаписатьАтрибут("type", 	Строка(текСтрока.ТипПеременной));
	Если ТипЗнч(текСтрока.ВложенныеЗначения) = Тип("Массив") И текСтрока.ВложенныеЗначения.Количество() > 0 Тогда
		xmlРезультат.ЗаписатьНачалоЭлемента("containsvalues");
		Для Каждого ЭлементМассива Из текСтрока.ВложенныеЗначения Цикл
			ЗаписатьЗначениеПеременной(xmlРезультат, ЭлементМассива);
		КонецЦикла;
		xmlРезультат.ЗаписатьКонецЭлемента();
	КонецЕсли;
	xmlРезультат.ЗаписатьКонецЭлемента();
КонецПроцедуры

Функция ВыполнитьПоискОбъектаОтладки(_сшп_Код)
	
	ОбъектОбработки = Неопределено;
	Выполнить(_сшп_Код);
	Возврат ОбъектОбработки;
	
КонецФункции

функция ВыполнитьКодОтладкиИсходящий(_сшп_Код, _сшп_НомерСтроки, _сшп_РезультатОтладки, ОбъектОбработки, ФорматСообщения, СостояниеСообщения, сшп_МассивЗамеров)
	ЭтоУдаление = Ложь;
	ДатаРегистрации = ТекущаяДата();
	РезультатОбработки = сшпОбщегоНазначения.СформироватьСтруктуруПакета();
	Задержка = 0;
	Идентификатор = Новый УникальныйИдентификатор();
	РезультатОбработки.Id = Идентификатор;

	Выполнить(_сшп_Код);
	Возврат РезультатОбработки;
КонецФункции

Процедура ВыполнитьКодОтладкиВходящий(_сшп_Код, _сшп_НомерСтроки, _сшп_РезультатОтладки, ОбъектСообщение, ФорматСообщения, СостояниеСообщения, сшп_МассивЗамеров)
	ДатаРегистрации = ТекущаяДата();
	Задержка = 0;
	Идентификатор = ОбъектСообщение.Id;

	Выполнить(_сшп_Код);
КонецПроцедуры

Процедура ДобавитьЗначениеПеременной(_сшп_РезультатОтладки, ИмяПеременной, НомерСтроки, _сшп_рез)
	_сшп_новСтр = _сшп_РезультатОтладки.Добавить(); 
	_сшп_новСтр.ИмяПеременной = ИмяПеременной;
	_сшп_новСтр.НомерСтроки = НомерСтроки; 
	_сшп_новСтр.ПеременнаяНеОпределена = _сшп_рез = Null;
	Если Не _сшп_новСтр.ПеременнаяНеОпределена=Истина Тогда 
		_сшп_ТипПеременной = ТипЗнч(_сшп_рез); 
		_сшп_новСтр.ТипПеременной = _сшп_ТипПеременной; 
		Если _сшп_ТипПеременной = Тип("Структура") Или _сшп_ТипПеременной = Тип("Соответствие") Тогда 
			_сшп_ВложенныеЗначения = Новый Массив; 
			Для Каждого сшп_Элемент Из _сшп_рез Цикл 
				_сшп_ВложенноеЗначение = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
				_сшп_ВложенноеЗначение.ИмяПеременной = сшп_Элемент.Ключ; 
				_сшп_ВложенноеЗначение.ЗначениеПеременной = сшп_Элемент.Значение; 
				_сшп_ВложенноеЗначение.ТипПеременной = ТипЗнч(_сшп_ВложенноеЗначение.ЗначениеПеременной); 
				Если Не (_сшп_ВложенноеЗначение.ТипПеременной = Тип("Строка") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Число") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Булево") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Дата")) Тогда 
					_сшп_ВложенноеЗначение.ЗначениеПеременной = Строка(_сшп_ВложенноеЗначение.ЗначениеПеременной); 
				КонецЕсли; 
				_сшп_ВложенныеЗначения.Добавить(_сшп_ВложенноеЗначение); 
			КонецЦикла; 
			_сшп_новСтр.ВложенныеЗначения = _сшп_ВложенныеЗначения; 
			_сшп_новСтр.ЗначениеПеременной = Строка(_сшп_рез); 
		ИначеЕсли _сшп_ТипПеременной = Тип("Массив") Тогда	
			_сшп_ВложенныеЗначения = Новый Массив; 
			Для _сшп_Индекс = 0 По _сшп_рез.Количество()-1 Цикл 
				_сшп_ВложенноеЗначение = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
				_сшп_ВложенноеЗначение.ИмяПеременной = "[" + _сшп_Индекс + "]"; _сшп_ВложенноеЗначение.ЗначениеПеременной = _сшп_рез[_сшп_Индекс]; 
				_сшп_ВложенноеЗначение.ТипПеременной = ТипЗнч(_сшп_ВложенноеЗначение.ЗначениеПеременной); 
				Если Не (_сшп_ВложенноеЗначение.ТипПеременной = Тип("Строка") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Число") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Булево") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Дата")) Тогда 
					_сшп_ВложенноеЗначение.ЗначениеПеременной = Строка(_сшп_ВложенноеЗначение.ЗначениеПеременной); 
				КонецЕсли; 
				_сшп_ВложенныеЗначения.Добавить(_сшп_ВложенноеЗначение); 
			КонецЦикла; 
			_сшп_новСтр.ВложенныеЗначения = _сшп_ВложенныеЗначения; 
			_сшп_новСтр.ЗначениеПеременной = Строка(_сшп_рез); 
		ИначеЕсли _сшп_ТипПеременной = Тип("ТаблицаЗначений") Тогда 
			_сшп_ВложенныеЗначения = Новый Массив;	
			Для Каждого _сшп_СтрокаТЧ Из _сшп_рез Цикл 
				_сшп_ИндексСтрокиТЧ = _сшп_рез.Индекс(_сшп_СтрокаТЧ); 
				_сшп_ВложенноеЗначение = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
				_сшп_ВложенноеЗначение.ИмяПеременной ="[" + _сшп_ИндексСтрокиТЧ + "]"; 
				_сшп_ВложенноеЗначение.ЗначениеПеременной = _сшп_ИндексСтрокиТЧ; 
				_сшп_ВложенныеЗначения2 = Новый Массив;	
				Для Каждого _сшп_Колонка Из _сшп_рез.Колонки Цикл 
					_сшп_ВложенноеЗначение2 = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
					_сшп_ВложенноеЗначение2.ИмяПеременной = _сшп_Колонка.Имя; 
					_сшп_ВложенноеЗначение2.ЗначениеПеременной = _сшп_СтрокаТЧ[_сшп_Колонка.Имя]; 
					_сшп_ВложенноеЗначение2.ТипПеременной = ТипЗнч(_сшп_ВложенноеЗначение2.ЗначениеПеременной); 
					Если Не (_сшп_ВложенноеЗначение2.ТипПеременной = Тип("Строка") Или _сшп_ВложенноеЗначение2.ТипПеременной = Тип("Число") Или _сшп_ВложенноеЗначение2.ТипПеременной = Тип("Булево") Или _сшп_ВложенноеЗначение2.ТипПеременной = Тип("Дата")) Тогда 
						_сшп_ВложенноеЗначение2.ЗначениеПеременной = Строка(_сшп_ВложенноеЗначение2.ЗначениеПеременной); 
					КонецЕсли;	
					_сшп_ВложенныеЗначения2.Добавить(_сшп_ВложенноеЗначение2); 
				КонецЦикла; 
				_сшп_ВложенноеЗначение.ВложенныеЗначения = _сшп_ВложенныеЗначения2; 
				_сшп_ВложенныеЗначения.Добавить(_сшп_ВложенноеЗначение); 
			КонецЦикла; 
			_сшп_новСтр.ВложенныеЗначения = _сшп_ВложенныеЗначения; 
			_сшп_новСтр.ЗначениеПеременной = Строка(_сшп_рез); 
		ИначеЕсли _сшп_ТипПеременной = Тип("Строка") Или _сшп_ТипПеременной = Тип("Число") Или _сшп_ТипПеременной = Тип("Булево") Или _сшп_ТипПеременной = Тип("Дата") Тогда 
			_сшп_новСтр.ЗначениеПеременной = _сшп_рез; 
		ИначеЕсли Не XMLТипЗнч(_сшп_рез) = Неопределено Тогда 
			_сшп_ТипXML = XMLТипЗнч(_сшп_рез).ИмяТипа;	
			Если СтрНайти(_сшп_ТипXML, "Ref") > 0 Или СтрНайти(_сшп_ТипXML, "Object") > 0 Тогда
				ТипМетаданных = "";	
				Если СтрНайти(_сшп_ТипXML, "CatalogRef.") > 0 Тогда 
					ИмяМетаданных = Сред(_сшп_ТипXML,СтрДлина("CatalogRef.")+1); 
					ТипМетаданных = "Справочники";	
				ИначеЕсли СтрНайти(_сшп_ТипXML, "CatalogObject.") > 0 Тогда 
					ИмяМетаданных = Сред(_сшп_ТипXML,СтрДлина("CatalogObject.")+1); 
					ТипМетаданных = "Справочники"; 
				ИначеЕсли СтрНайти(_сшп_ТипXML, "DocumentRef.") > 0 Тогда 
					ИмяМетаданных = Сред(_сшп_ТипXML,СтрДлина("DocumentRef.")+1); 
					ТипМетаданных = "Документы"; 
				ИначеЕсли СтрНайти(_сшп_ТипXML, "DocumentObject.") > 0 Тогда 
					ИмяМетаданных = Сред(_сшп_ТипXML,СтрДлина("DocumentObject.")+1); 
					ТипМетаданных = "Документы"; 
				КонецЕсли; 
				Если Не ТипМетаданных = "" И Не Метаданные[ТипМетаданных].Найти(ИмяМетаданных) = Неопределено Тогда 
					_сшп_ВложенныеЗначения = Новый Массив; 
					_сшп_Метаданные = _сшп_рез.Метаданные();	
					Для Каждого _сшп_Реквизит Из _сшп_Метаданные.СтандартныеРеквизиты Цикл 
						_сшп_ВложенноеЗначение = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
						_сшп_ВложенноеЗначение.ИмяПеременной = _сшп_Реквизит.Имя; 
						_сшп_ВложенноеЗначение.ЗначениеПеременной = _сшп_рез[_сшп_Реквизит.Имя]; 
						_сшп_ВложенноеЗначение.ТипПеременной = ТипЗнч(_сшп_ВложенноеЗначение.ЗначениеПеременной); 
						Если Не (_сшп_ВложенноеЗначение.ТипПеременной = Тип("Строка") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Число") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Булево") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Дата")) Тогда 
							_сшп_ВложенноеЗначение.ЗначениеПеременной = Строка(_сшп_ВложенноеЗначение.ЗначениеПеременной); 
						КонецЕсли; 
						_сшп_ВложенныеЗначения.Добавить(_сшп_ВложенноеЗначение); 
					КонецЦикла; 
					Для Каждого _сшп_Реквизит Из _сшп_Метаданные.Реквизиты Цикл 
						_сшп_ВложенноеЗначение = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
						_сшп_ВложенноеЗначение.ИмяПеременной = _сшп_Реквизит.Имя; 
						_сшп_ВложенноеЗначение.ЗначениеПеременной = _сшп_рез[_сшп_Реквизит.Имя];
						_сшп_ВложенноеЗначение.ТипПеременной = ТипЗнч(_сшп_ВложенноеЗначение.ЗначениеПеременной);
						Если Не (_сшп_ВложенноеЗначение.ТипПеременной = Тип("Строка") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Число") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Булево") Или _сшп_ВложенноеЗначение.ТипПеременной = Тип("Дата")) Тогда 
							_сшп_ВложенноеЗначение.ЗначениеПеременной = Строка(_сшп_ВложенноеЗначение.ЗначениеПеременной); 
						КонецЕсли; 
						_сшп_ВложенныеЗначения.Добавить(_сшп_ВложенноеЗначение); 
					КонецЦикла; 
					Для Каждого _сшп_ТабличнаяЧасть Из _сшп_Метаданные.ТабличныеЧасти Цикл 
						_сшп_ВложенноеЗначение = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
						_сшп_ВложенноеЗначение.ИмяПеременной = _сшп_ТабличнаяЧасть.Имя; 
						_сшп_ВложенноеЗначение.ЗначениеПеременной = Неопределено; 
						_сшп_ВложенноеЗначение.ТипПеременной = "ТабличнаяЧасть"; 
						_сшп_ВложенныеЗначения2 = Новый Массив; 
						Для Каждого _сшп_СтрокаТЧ Из _сшп_рез[_сшп_ТабличнаяЧасть.Имя] Цикл 
							_сшп_ВложенноеЗначение2 = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
							_сшп_ВложенноеЗначение2.ИмяПеременной = "[" + _сшп_СтрокаТЧ.НомерСтроки + "]"; 
							_сшп_ВложенноеЗначение2.ЗначениеПеременной = _сшп_СтрокаТЧ.НомерСтроки; 
							_сшп_ВложенныеЗначения3 = Новый Массив; 
							Для Каждого _сшп_Колонка Из _сшп_Метаданные.ТабличныеЧасти[_сшп_ТабличнаяЧасть.Имя].Реквизиты Цикл	
								_сшп_ВложенноеЗначение3 = Новый Структура("ИмяПеременной, ЗначениеПеременной, ТипПеременной, ВложенныеЗначения"); 
								_сшп_ВложенноеЗначение3.ИмяПеременной = _сшп_Колонка.Имя; 
								_сшп_ВложенноеЗначение3.ЗначениеПеременной = _сшп_СтрокаТЧ[_сшп_Колонка.Имя]; 
								_сшп_ВложенноеЗначение3.ТипПеременной = ТипЗнч(_сшп_ВложенноеЗначение3.ЗначениеПеременной); 
								Если Не (_сшп_ВложенноеЗначение3.ТипПеременной = Тип("Строка") Или _сшп_ВложенноеЗначение3.ТипПеременной = Тип("Число") Или _сшп_ВложенноеЗначение3.ТипПеременной = Тип("Булево") Или _сшп_ВложенноеЗначение3.ТипПеременной = Тип("Дата")) Тогда 
									_сшп_ВложенноеЗначение3.ЗначениеПеременной = Строка(_сшп_ВложенноеЗначение3.ЗначениеПеременной); 
								КонецЕсли; _сшп_ВложенныеЗначения3.Добавить(_сшп_ВложенноеЗначение3); 
							КонецЦикла; 
							_сшп_ВложенноеЗначение2.ВложенныеЗначения = _сшп_ВложенныеЗначения3; 
							_сшп_ВложенныеЗначения2.Добавить(_сшп_ВложенноеЗначение2); 
						КонецЦикла; 
						_сшп_ВложенноеЗначение.ВложенныеЗначения = _сшп_ВложенныеЗначения2; 
						_сшп_ВложенныеЗначения.Добавить(_сшп_ВложенноеЗначение); 
					КонецЦикла; 
					_сшп_новСтр.ВложенныеЗначения = _сшп_ВложенныеЗначения;	
				Иначе 
					_сшп_новСтр.ЗначениеПеременной = Строка(_сшп_рез); 
				КонецЕсли; 
			Иначе 
				_сшп_новСтр.ЗначениеПеременной = Строка(_сшп_рез); 
			КонецЕсли;	
		Иначе 
			_сшп_новСтр.ЗначениеПеременной = Строка(_сшп_рез); 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры
