
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает текущее Состояние Оборудования
//
// Параметры:
//  Ссылка  - СправочникСсылка - Ссылка на элемент.
//
// Возвращаемое значение:
//   СправочникСсылка.упСостоянияОборудования - Результат выполнения.
//
Функция ПолучитьСостояние(Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда 
		Возврат Справочники.упСостоянияОборудования.НеИспользуется;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	упСостоянияОборудованияСрезПоследних.Состояние КАК Состояние
	              |ИЗ
	              |	РегистрСведений.упСостоянияОборудования.СрезПоследних(, Оборудование = &Оборудование) КАК упСостоянияОборудованияСрезПоследних
	              |ГДЕ
	              |	упСостоянияОборудованияСрезПоследних.Оборудование = &Оборудование";
	Запрос.УстановитьПараметр("Оборудование", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Состояние) Тогда 
		Возврат Выборка.Состояние;
	Иначе	
		Возврат Справочники.упСостоянияОборудования.НеИспользуется;
	КонецЕсли;
	
КонецФункции // ПолучитьСостояние()

#КонецОбласти 

#КонецЕсли
