
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		Если ИспользуетсяУчетПодразделений
					И НЕ ЗначениеЗаполнено(Объект.Подразделение) Тогда
				Объект.Подразделение = Справочники.упСтруктураПредприятия.ПодразделениеПоУмолчанию(Справочники.упВидыПеревозок.ПустаяСсылка(), Объект.Автор);
		КонецЕсли;
	КонецЕсли;
	
	упСервисныеФункции.УстановитьЗаголовокФормыИнформацияПроведения(ЭтотОбъект);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ВедетсяВалютныйУчет = ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	Если ЭтаФорма.ВедетсяВалютныйУчет Тогда
		ЭтаФорма.ВалютаУпрУчета 	= упСервисныеФункцииВызовСервера.ВалютаУправленческогоУчета();
	КонецЕсли; 
	ЭтаФорма.ИспользуетсяУчетПодразделений	= ПолучитьФункциональнуюОпцию("упИспользуетсяУчетПодразделений"); 
		
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упСервисныеФункции.УстановитьЗаголовокФормыИнформацияПроведения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

#Область Элементы_ГСМ

&НаКлиенте
Процедура ГСМПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если ВедетсяВалютныйУчет И НоваяСтрока И Не Копирование Тогда
		текСтрока = Элементы.ГСМ.ТекущиеДанные;
		текСтрока.Валюта = ВалютаУпрУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтоговуюСуммуРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМПослеУдаления(Элемент)
	
	РассчитатьИтоговуюСуммуРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМЦенаПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "ГСМ");
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "ГСМ");
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМСуммаПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "ГСМ");
	
КонецПроцедуры

&НаКлиенте
Процедура ГСМСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "ГСМ");
	
КонецПроцедуры

#КонецОбласти 

#Область Элементы_Запчасти

&НаКлиенте
Процедура ЗапчастиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если ВедетсяВалютныйУчет И НоваяСтрока И Не Копирование Тогда
		текСтрока = Элементы.Запчасти.ТекущиеДанные;
		текСтрока.Валюта = ВалютаУпрУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтоговуюСуммуРасходы();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапчастиПослеУдаления(Элемент)
	
	РассчитатьИтоговуюСуммуРасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиЦенаПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "Запчасти");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиКоличествоПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "Запчасти");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиСуммаПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "Запчасти");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапчастиСтавкаНДСПриИзменении(Элемент)
	
	ПересчитатьСтроку(Элемент, "Запчасти");
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПересчитатьСтроку(Элемент, ИмяТаблЧасти)
	
	ТекущаяСтрока	= Элементы[ИмяТаблЧасти].ТекущиеДанные;
	СтруктураДанные	= Новый Структура("Ссылка", Объект.Ссылка);
	упОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСтрокуРасходовПриИзмененииЗначения(ТекущаяСтрока, ПолучитьИмяПоля(Элемент.Имя, ИмяТаблЧасти), СтруктураДанные);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяПоля(ИмяПоля, ИмяТаблЧасти)
	
	Возврат СтрЗаменить(ИмяПоля, ИмяТаблЧасти,"");
	
КонецФункции

&НаСервере
Процедура РассчитатьИтоговуюСуммуРасходы()
	
	ИтоговаяСумма 		= 0;
	ИтоговаяСуммаНДС 	= 0;
	
	сткСоответствиеРеквизитов = Новый Структура();
	сткСоответствиеРеквизитов.Вставить("СуммаРасходы",		"Сумма");
	сткСоответствиеРеквизитов.Вставить("СуммаРасходыНДС",	"СуммаНДС");
	
	упОбработкаТабличнойЧастиКлиентСервер.ПересчитатьИтогиПоСтрокам(Объект, "ГСМ", сткСоответствиеРеквизитов, ВедетсяВалютныйУчет);
	ИтоговаяСумма 	 = ИтоговаяСумма + Объект.СуммаРасходы;
	ИтоговаяСуммаНДС = ИтоговаяСуммаНДС + Объект.СуммаРасходыНДС;
	
	упОбработкаТабличнойЧастиКлиентСервер.ПересчитатьИтогиПоСтрокам(Объект, "Запчасти", сткСоответствиеРеквизитов, ВедетсяВалютныйУчет);
	ИтоговаяСумма 	 = ИтоговаяСумма + Объект.СуммаРасходы;
	ИтоговаяСуммаНДС = ИтоговаяСуммаНДС + Объект.СуммаРасходыНДС;
	
	Объект.СуммаРасходы 	= ИтоговаяСумма;
	Объект.СуммаРасходыНДС	= ИтоговаяСуммаНДС; 
		
КонецПроцедуры // РассчитатьИтоговуюСумму()

#КонецОбласти 