#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отказ = Ложь;
	ТекстОшибки = "";
	ПрочиеРасходыСсылка = СформироватьПрочиеРасходыНаСервере(ПараметрКоманды, ТекстОшибки,Отказ);
	Если НЕ Отказ Тогда
		ОткрытьФорму("Документ.упПрочиеРасходы.ФормаОбъекта", Новый Структура("Ключ", ПрочиеРасходыСсылка), ПараметрыВыполненияКоманды.Источник);
	Иначе
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПрочиеРасходыНаСервере(ДокументТранспортногоСредстваВодителя, ТекстОшибки, Отказ)
	
	Возврат Документы.упДокументТранспортногоСредстваВодителя.СформироватьПрочиеРасходы(ДокументТранспортногоСредстваВодителя, ТекстОшибки, Отказ);
	
КонецФункции

#КонецОбласти 
