
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	упВидыСобытийМониторинга.Ссылка
	|ИЗ
	|	Перечисление.упВидыСобытийМониторинга КАК упВидыСобытийМониторинга
	|ГДЕ
	|	НЕ упВидыСобытийМониторинга.Ссылка В (ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.СобытиеВнешнейСистемыМониторинга), ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ОпозданиеВТочкеМаршрута), ЗНАЧЕНИЕ(Перечисление.упВидыСобытийМониторинга.ПланируемоеОпозданиеВТочкеМаршрута))
	|
	|УПОРЯДОЧИТЬ ПО
	|	упВидыСобытийМониторинга.Порядок";
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти