#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ФормулаНомер = ТекстФормулыПоУмолчанию();
		Объект.ФормулаДата 	= ТекстФормулыПоУмолчанию(Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаблокироватьЭлементы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособОпределенияНомераЭкземпляраПриИзменении(Элемент)
	УстановитьДоступностьФормулыНомера();
КонецПроцедуры

&НаКлиенте
Процедура СпособОпределенияДатыЭкземпляраПриИзменении(Элемент)
	УстановитьДоступностьФормулыДаты();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьДоступностьФормулыНомера()
	   Элементы.ФормулаНомер.Доступность = Объект.СпособОпределенияНомераЭкземпляра = ПредопределенноеЗначение("ПеречислениЕ.упСпособыОпределенияНомераДокумента.ПоФормуле");
КонецПроцедуры
   
&НаКлиенте
Процедура УстановитьДоступностьФормулыДаты()
	   Элементы.ФормулаДата.Доступность = Объект.СпособОпределенияДатыЭкземпляра = ПредопределенноеЗначение("ПеречислениЕ.упСпособыОпределенияДатыДокумента.ПоФормуле");
КонецПроцедуры   

&НаКлиенте
Процедура ЗаблокироватьЭлементы()
	УстановитьДоступностьФормулыДаты();
	УстановитьДоступностьФормулыНомера();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстФормулыПоУмолчанию(ЭтоНомер = Истина)
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("// Допускается использовать значения переменных: ДокументОснование, Номер, НомерКИС, Дата, ДатаКИС.");
		
	Если ЭтоНомер Тогда
		Текст.ДобавитьСтроку("НомерЭкземпляра = """";");
	Иначе
		Текст.ДобавитьСтроку("ДатаЭкземпляра = """";");	
	КонецЕсли;

	Возврат Текст.ПолучитьТекст();
КонецФункции

#КонецОбласти
