
#Область СлужебныеПроцедурыИФункции

// Процедура производит первоначальное заполнение справочника.
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	текЭлемент = Справочники.упСтилиЛиний.Основной.ПолучитьОбъект();
	текЭлемент.Наименование = НСтр("ru = 'Синий'");
	текЭлемент.Цвет         = "#0000FF";
	текЭлемент.Толщина      = 2;
	текЭлемент.Прозрачность = 0;
	текЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Белый'");
	НовыйЭлемент.Цвет         = "#FFFFFF";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Голубой'");
	НовыйЭлемент.Цвет         = "#00FFFF";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Желтый'");
	НовыйЭлемент.Цвет         = "#FFFF00";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Зеленый'");
	НовыйЭлемент.Цвет         = "#00FF00";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Красный'");
	НовыйЭлемент.Цвет         = "#FF0000";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Оранжевый'");
	НовыйЭлемент.Цвет         = "#FFA500";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Розовый'");
	НовыйЭлемент.Цвет         = "#FFC0CB";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Серый'");
	НовыйЭлемент.Цвет         = "#BEBEBE";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Фиолетовый'");
	НовыйЭлемент.Цвет         = "#EE82EE";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Черный'");
	НовыйЭлемент.Цвет         = "#000000";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
КонецПроцедуры	

#КонецОбласти 