#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидЗадачиОптимизации <> Перечисления.упВидыЗадачОптимизации.ЗадачаКоммивояжера Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "МетодРешенияЗКДляТиповыхНастроек");
	КонецЕсли;	
	
	Если ВидЗадачиОптимизации <> Перечисления.упВидыЗадачОптимизации.ЗадачаМаршрутизацииТранспорта Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "МетодРешенияЗМТДляТиповыхНастроек");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли