
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		// Нужно для загрузки в сервис
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное("упЗапуститьОбработкуПотоков");
	Если сшпФункциональныеОпции.ИспользоватьСШП() И Значение = Перечисления.упТипОбмена.Web Тогда 
		РегламентноеЗадание.Использование = Истина;
	Иначе	
		РегламентноеЗадание.Использование = Ложь;
	КонецЕсли;	
	РегламентноеЗадание.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти 