#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	сткЗаявкиНаТС = СформироватьЗаявкуНаТС(ПараметрКоманды, ОписаниеОшибки, Отказ);
	
	Если Не Отказ Тогда
		Если НЕ сткЗаявкиНаТС.ЗаявкиНаТС = Неопределено Тогда
			Оповестить("СформированыЗаявкиНаТС",сткЗаявкиНаТС.ЗаявкиНаТС);
		ИначеЕсли сткЗаявкиНаТС.ФормироватьЗаявки Тогда	
			ПараметрыФормы = Новый Структура("Рейс", ПараметрКоманды);
			ОткрытьФорму("Справочник.упПартнеры.Форма.ФормаВыбораПеревозчики", 
			ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, 
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
		КонецЕсли;
		
	Иначе
		//ПоказатьПредупреждение(, ОписаниеОшибки);
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ОписаниеОшибки, Истина);
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Возвращает массив заявок на ТС и флаг необходимости формирования заявок
//
Функция СформироватьЗаявкуНаТС(Рейс, ОписаниеОшибки, Отказ)
	
	Возврат Документы.упРейс.СформироватьЗаявкуНаТСПоКоманде(Рейс, ОписаниеОшибки, Отказ);
	
КонецФункции

#КонецОбласти 