
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ПорядокИсполненияЗаявки = Неопределено;
	Если Параметры.Свойство("ПорядокИсполненияЗаявки", ПорядокИсполненияЗаявки) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		Если ПорядокИсполненияЗаявки = ПредопределенноеЗначение("Перечисление.упПорядокИсполненияЗаявок.ПутевымЛистом") Тогда
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяЗаявкиНаПассажирскиеПеревозки") Тогда
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.ПеревозкаПассажиров"));	
			КонецЕсли;
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяЗаявкиНаСпецтехнику") Тогда
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.УслугиСпецтехники"));
			КонецЕсли;
		Иначе	
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.ПеревозкаГрузов"));		
		КонецЕсли;
		
		
	КонецЕсли;
КонецПроцедуры
