#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ИспользуетсяУчетШинУзловИАгрегатов          = ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов");
	Если ИспользуетсяУчетШинУзловИАгрегатов Тогда
		ДанныеВыбора.Добавить(Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиАгрегатовНаСкладах);	
	КонецЕсли;
	
	ИспользуетсяУчетМатериалов                  = ПолучитьФункциональнуюОпцию("упИспользуетсяУчетМатериалов");
	Если ИспользуетсяУчетМатериалов Тогда
		ДанныеВыбора.Добавить(Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиМатериаловНаСкладах);	
	КонецЕсли;
	
	ИспользуетсяУчетДополнительногоОборудования = ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования");
	Если ИспользуетсяУчетДополнительногоОборудования Тогда
		ДанныеВыбора.Добавить(Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиОборудованияНаСкладах);	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
