#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает таблицу значений с данными ОКСМ.
// 
// Возвращаемое значение:
//  Произвольные - Результат выполнения.
//  Колонки:
//  * Код                - Строка - Строка(3, Переменная),
//  * Наименование       - Строка - Строка(60, Переменная),
//  * НаименованиеПолное - Строка - Строка(100, Переменная),
//  * КодАльфа2          - Строка - Строка(2, Переменная),
//  * КодАльфа3          - Строка - Строка(3, Переменная).
//  Индексы:
//  * Код - Строка - Код.
//  * Наименование - Строка - Наименование.
//
Функция ТаблицаКлассификатора() Экспорт
	Макет = Справочники.упРегионы.ПолучитьМакет("Классификатор");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(Макет.ПолучитьТекст());
	
	Возврат СериализаторXDTO.ПрочитатьXML(Чтение);
КонецФункции

#КонецОбласти 

#КонецЕсли