
// Функция вовзращает текст для html документа, отображающего сетевой граф
//
Функция ПолучитьТекстОбщегоМакетаСетевогоГрафа() Экспорт 
	
	Результат = ПолучитьОбщийМакет("HTML_NetworkGraph").ПолучитьТекст();
	
	БиблиотекаVIS = ПолучитьОбщийМакет("JS_Vis").ПолучитьТекст();	
	Результат = СтрЗаменить(Результат, "src="".../dist/vis.js"">", ">" + БиблиотекаVIS);
	
	СтилиVIS = ПолучитьОбщийМакет("CSS_Vis").ПолучитьТекст();	
	Результат = СтрЗаменить(Результат, "<link type=""text/css"" rel=""stylesheet"" href="".../dist/vis.css""/>", "<style type=""text/css"">" + СтилиVIS + "</style>");
	
	БиблиотекаГраф = ПолучитьОбщийМакет("JS_NetworkGraph").ПолучитьТекст();	
	Результат = СтрЗаменить(Результат, "src="".../dist/networkgraph.js"">", ">" + БиблиотекаГраф);
	
	Возврат Результат;
	
КонецФункции