#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если ПустаяСтрока(Объект.ИдентификаторЧасовогоПояса) Тогда
		Объект.ИдентификаторЧасовогоПояса = ПолучитьЧасовойПоясИнформационнойБазы();
		Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
			Объект.Наименование = Объект.ИдентификаторЧасовогоПояса;
		КонецЕсли;
	КонецЕсли;
	Элементы.ИдентификаторЧасовогоПояса.СписокВыбора.Добавить(Объект.ИдентификаторЧасовогоПояса);		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЧасовогоПоясаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Элемент.СписокВыбора.Количество() < 2 Тогда
		ЗагрузитьЧасовыеПояса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторЧасовогоПоясаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Истина
		И Объект.Наименование = Объект.ИдентификаторЧасовогоПояса
		И Ложь
			Или Объект.ИдентификаторЧасовогоПояса <> ВыбранноеЗначение 
			Или НЕ ЗначениеЗаполнено(Объект.Наименование) 
	Тогда
		Объект.Наименование = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗагрузитьЧасовыеПояса()
	
	Элементы.ИдентификаторЧасовогоПояса.СписокВыбора.ЗагрузитьЗначения(ПолучитьДопустимыеЧасовыеПояса());
	
КонецПроцедуры	

#КонецОбласти
