

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура производит первоначальное заполнение справочника/
//
// Параметры:
//  Параметры  - Структура - Параметры.
//
Процедура ПервоначальноеЗаполнение(Параметры = Неопределено) Экспорт
	
	текЭлемент = Справочники.упТипыДокументовТСВодителей.ПропускНаПроездТранспортаЧерезЗону.ПолучитьОбъект();
	текЭлемент.ДокументВыдается = Перечисления.упОбъектДокументовТСВодителей.ТранспортноеСредство;
	текЭлемент.КоличествоТС = Перечисления.упКоличествоОбъектовДокументовТСВодителей.Один;
	текЭлемент.СрокДействия = Перечисления.упСрокДействияДокумента.СрокУказываетсяВДокументе;
	текЭлемент.Записать();	

КонецПроцедуры // ПервоначальноеЗаполнение()

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
	// Нет.
	
#КонецОбласти
	
#КонецЕсли
