
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыМониторинга = Параметры.ПараметрыМониторинга;
	Если ПараметрыМониторинга <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыМониторинга);
	КонецЕсли;
	
	Если ПериодОтображенияТрека > 0 Тогда
		ВремяОтображениеТрекаЧасов = Цел(ПериодОтображенияТрека);
		ВремяОтображениеТрекаМинут = Окр((ПериодОтображенияТрека - ВремяОтображениеТрекаЧасов)*60);
	КонецЕсли;
	
	Если ПериодОтображенияСобытийМониторинга > 0 Тогда
		ВремяОтображениеСобытийМониторингаЧасов = Цел(ПериодОтображенияСобытийМониторинга);
		ВремяОтображениеСобытийМониторингаМинут = Окр((ПериодОтображенияСобытийМониторинга - ВремяОтображениеСобытийМониторингаЧасов)*60);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьНастроекПланирования();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ИспользоватьАвтообновлениеДанных Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПериодАвтообновления"));
	КонецЕсли; 
	
	Если НЕ ОтображатьТрекиДвиженияТранспорта Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ПериодОтображенияТрека"));
	КонецЕсли;
	
	Если НЕ (ОтображатьТрекЦветомПоСкоростиДвиженияТС И ОтображатьТрекиДвиженияТранспорта) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ЦветоваяШкалаТС"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтображатьТрекЦветомПоСкоростиДвиженияПриИзменении(Элемент)
	Элементы.ГруппаПодчиненыеЦветовойШкале.Доступность = ОтображатьТрекЦветомПоСкоростиДвиженияТС;
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТрекиДвиженияТранспортаПриИзменении(Элемент)
	
	УстановитьДоступностьНастроекПланирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьАвтообновлениеДанныхПриИзменении(Элемент)
	
	УстановитьДоступностьНастроекПланирования();
	
КонецПроцедуры

&НаКлиенте
Процедура ДопустимыйПериодОтсутствияСвязиСТрекеромПриИзменении(Элемент)
	
	УстановитьДоступностьНастроекПланирования();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ПроверитьЗаполнение()Тогда
		ПериодОтображенияТрека              = ВремяОтображениеТрекаЧасов + ВремяОтображениеТрекаМинут/60;
		ПериодОтображенияСобытийМониторинга = ВремяОтображениеСобытийМониторингаЧасов + ВремяОтображениеСобытийМониторингаМинут/60;
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("ОтображатьПоследниеДанныеТрекера"                    , ОтображатьПоследниеДанныеТрекера);
		сткПараметры.Вставить("ОтображатьПоследниеДанныеДатчиков"                   , ОтображатьПоследниеДанныеДатчиков); 
		сткПараметры.Вставить("ОтображатьТекущиеСостоянияТранспортныхСредствНаКарте", ОтображатьТекущиеСостоянияТранспортныхСредствНаКарте);
		сткПараметры.Вставить("ОтображатьСобытияМониторингаНаКарте"                 , ОтображатьСобытияМониторингаНаКарте);
		сткПараметры.Вставить("ОтображатьТрекиДвиженияТранспорта"                   , ОтображатьТрекиДвиженияТранспорта);
		сткПараметры.Вставить("ПериодОтображенияТрека"                              , ПериодОтображенияТрека);
		сткПараметры.Вставить("ПериодОтображенияСобытийМониторинга"                 , ПериодОтображенияСобытийМониторинга);
		сткПараметры.Вставить("ИспользоватьАвтообновлениеДанных"                    , ИспользоватьАвтообновлениеДанных);
		сткПараметры.Вставить("ПериодАвтообновления"                                , ПериодАвтообновления);
		сткПараметры.Вставить("ДопустимыйПериодОтсутствияСвязиСТрекером"            , ДопустимыйПериодОтсутствияСвязиСТрекером);
		сткПараметры.Вставить("ОтображатьПериодыОтсутствияСвязи"                    , ОтображатьПериодыОтсутствияСвязи);
		сткПараметры.Вставить("ОтображатьТрекЦветомПоСкоростиДвиженияТС"            , ОтображатьТрекЦветомПоСкоростиДвиженияТС);
		сткПараметры.Вставить("ЦветоваяШкалаТС"                                     , ЦветоваяШкалаТС);
		Закрыть(сткПараметры);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Заполните обязательные настройки!'"));
	КонецЕсли;
	
КонецПроцедуры // ЗавершитьРедактирование()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры // Отмена()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьНастроекПланирования()
	
	Элементы.ГруппаПериодАвтообновления.Доступность = ИспользоватьАвтообновлениеДанных;
	Элементы.ГруппаТаймерОбновления.Доступность = ИспользоватьАвтообновлениеДанных;
	Элементы.ПериодАвтообновления.АвтоОтметкаНезаполненного = ИспользоватьАвтообновлениеДанных;
	Элементы.ГруппаПериодОтображенияТрека.Доступность = ОтображатьТрекиДвиженияТранспорта;
	Элементы.ГруппаСобытияМониторинга.Доступность = ОтображатьТрекиДвиженияТранспорта;
	Элементы.ГруппаНетСвязи.Доступность = ОтображатьТрекиДвиженияТранспорта;
	Элементы.ГруппаОтображатьПериодыОтсутствияСвязи.Доступность = (ДопустимыйПериодОтсутствияСвязиСТрекером > 0);
	Элементы.ГруппаПодчиненыеЦветовойШкале.Доступность = ОтображатьТрекЦветомПоСкоростиДвиженияТС;
	Элементы.ГруппаЦветоваяШкала.Доступность = ОтображатьТрекиДвиженияТранспорта;
	
КонецПроцедуры // УстановитьДоступностьНастроекПланирования()

#КонецОбласти 
