
#Область ПрограммныйИнтерфейс

// Функция подбирает водителей по ТС.
//
// Параметры:
//  Дата - Дата - на которую подбирать водителей.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки ТранспортноеСредство и Водитель.
//
Функция ПодобратьВодителейТСПоДокументам(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упТранспортныеСредства.Ссылка КАК ТС,
	|	упТранспортныеСредства.ПакетНеобходимыхДокументов
	|ПОМЕСТИТЬ втТС
	|ИЗ
	|	Справочник.упТранспортныеСредства КАК упТранспортныеСредства
	|ГДЕ
	|	НЕ упТранспортныеСредства.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упСотрудники.Ссылка КАК Водитель
	|ПОМЕСТИТЬ втВодители
	|ИЗ
	|	Справочник.упСотрудники КАК упСотрудники
	|ГДЕ
	|	НЕ упСотрудники.ПометкаУдаления
	|	И упСотрудники.ТипСотрудника В (ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.ВодительЭкспедитор), ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.Водитель))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.ТС КАК ТС,
	|	упПакетыДокументовТССписокДокументов.ТипДокумента КАК ТипДокумента,
	|	втВодители.Водитель КАК Водитель
	|ПОМЕСТИТЬ втПакетДокументов
	|ИЗ
	|	втТС КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упПакетыДокументовТС.СписокДокументов КАК упПакетыДокументовТССписокДокументов
	|		ПО втТС.ПакетНеобходимыхДокументов = упПакетыДокументовТССписокДокументов.Ссылка,
	|	втВодители КАК втВодители
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипДокумента,
	|	ТС,
	|	Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упДействующиеДокументыТСВодителейСрезПоследних.ТипДокумента КАК ТипДокумента,
	|	упДействующиеДокументыТСВодителейСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упДействующиеДокументыТСВодителейСрезПоследних.Водитель КАК Водитель
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	РегистрСведений.упДействующиеДокументыТСВодителей.СрезПоследних(&Дата, ) КАК упДействующиеДокументыТСВодителейСрезПоследних
	|ГДЕ
	|	КОНЕЦПЕРИОДА(упДействующиеДокументыТСВодителейСрезПоследних.ДействуетПо, ДЕНЬ) >= &Дата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТипДокумента,
	|	ТранспортноеСредство,
	|	Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втПакетДокументов.ТС КАК ТС,
	|	втПакетДокументов.Водитель КАК Водитель
	|ПОМЕСТИТЬ втЗапрещенныеСочетания
	|ИЗ
	|	втПакетДокументов КАК втПакетДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДокументы КАК втДокументы
	|		ПО втПакетДокументов.ТипДокумента = втДокументы.ТипДокумента
	|			И (втПакетДокументов.ТС В (втДокументы.ТранспортноеСредство, ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)))
	|			И (втПакетДокументов.Водитель В (втДокументы.Водитель, ЗНАЧЕНИЕ(Справочник.упСотрудники.ПустаяСсылка)))
	|ГДЕ
	|	втДокументы.ТипДокумента ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТС,
	|	Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.ТС КАК ТС,
	|	втВодители.Водитель КАК Водитель
	|ПОМЕСТИТЬ втВсеСочетания
	|ИЗ
	|	втТС КАК втТС,
	|	втВодители КАК втВодители
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТС,
	|	Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеСочетания.ТС,
	|	втВсеСочетания.Водитель
	|ИЗ
	|	втВсеСочетания КАК втВсеСочетания
	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗапрещенныеСочетания КАК втЗапрещенныеСочетания
	|		ПО втВсеСочетания.ТС = втЗапрещенныеСочетания.ТС
	|			И втВсеСочетания.Водитель = втЗапрещенныеСочетания.Водитель
	|ГДЕ
	|	втЗапрещенныеСочетания.ТС ЕСТЬ NULL ";
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	

// Процедура распределения транспортых средств по типам рейсов.
//
// Параметры:
//  МассивРейсов - Массив - ССылкам на элементы.
//  ПараметрыКонтроляСовместимости - Структура - Параметры.
//  Приоритеты - ТаблицаЗначений - Таблица данных.
//  ТипыТС - СправочникСсылка.упТипыТС - Тип ТС.
//  АдресВременногоХранилища - Строка - Строковое прдеставление адреса.
//
Процедура РаспределитьТипыТСПоРейсам(МассивРейсов, ПараметрыКонтроляСовместимости, Приоритеты, ТипыТС, АдресВременногоХранилища) Экспорт
	
	мсвРезультатов = Новый Массив;
	
	РассчитыватьРасходы = Не (Приоритеты.Найти("РасходыПоРейсу", "ИмяПараметра") = Неопределено);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ТекстЗапроса = ПолучитьТекстЗапросаАвтоматическоеНазначениеТипыТС();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРейсов"                       , МассивРейсов);
	Запрос.УстановитьПараметр("КонтрольМассы"                      , ПараметрыКонтроляСовместимости.КонтрольМассы);
	Запрос.УстановитьПараметр("КонтрольОбъема"                     , ПараметрыКонтроляСовместимости.КонтрольОбъема);
	Запрос.УстановитьПараметр("КонтрольКоличестваМест"             , ПараметрыКонтроляСовместимости.КонтрольКоличестваМест);
	Запрос.УстановитьПараметр("КонтрольКоличестваЗагрузочныхМетров", ПараметрыКонтроляСовместимости.КонтрольКоличестваЗагрузочныхМетров);
	Запрос.УстановитьПараметр("КонтрольГабаритовГрузовогоМеста"    , ПараметрыКонтроляСовместимости.КонтрольГабаритовГрузовогоМеста);
	Запрос.УстановитьПараметр("КонтрольДоступностиЗон"             , ПараметрыКонтроляСовместимости.ДоступностьЗон);
	Запрос.УстановитьПараметр("КонтрольТиповКузовов"               , ПараметрыКонтроляСовместимости.КонтрольТиповКузовов);
	Запрос.УстановитьПараметр("КонтрольКлассовОпасности"           , ПараметрыКонтроляСовместимости.КонтрольКлассовОпасности);
	Запрос.УстановитьПараметр("КонтрольТемпературногоРежима"       , ПараметрыКонтроляСовместимости.КонтрольТемпературногоРежима);
	
	Если РассчитыватьРасходы Тогда
		
		ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
		ПакетЗапросов.Удалить(ПакетЗапросов.Количество() - 1);
		
		ЗапросВыбораСхемыЗапроса = ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	втРеальныеПеревозчики.Рейс КАК Рейс,
		|	втРеальныеПеревозчики.Перевозчик,
		|	втРеальныеПеревозчики.ТипТС
		|ИЗ
		|	втРеальныеПеревозчики КАК втРеальныеПеревозчики
		|ИТОГИ ПО
		|	Рейс";
		ЗапросВыбораСхемыЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПоместитьВоВременноеХранилище(мсвРезультатов, АдресВременногоХранилища);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("true");
			Возврат;
		Иначе
			
			тзРасходыПоРейсам = Новый ТаблицаЗначений;
			тзРасходыПоРейсам.Колонки.Добавить("Рейс"          , Новый ОписаниеТипов("ДокументСсылка.упРейс"));
			тзРасходыПоРейсам.Колонки.Добавить("Перевозчик"    , Новый ОписаниеТипов("СправочникСсылка.упПартнеры"));
			тзРасходыПоРейсам.Колонки.Добавить("ТипТС"         , Новый ОписаниеТипов("СправочникСсылка.упТипыТС"));
			тзРасходыПоРейсам.Колонки.Добавить("РасходыПоРейсу", Новый ОписаниеТипов("Число"));
			
			ВыборкаРейсов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаРейсов.Следующий() Цикл
				
				тзРейсы = Новый ТаблицаЗначений;
				тзРейсы.Колонки.Добавить("Рейс"                  , Новый ОписаниеТипов("ДокументСсылка.упРейс"));
				тзРейсы.Колонки.Добавить("ПлановыеРасходыПоРейсу", Новый ОписаниеТипов("Число"));
				
				ЗаполнитьЗначенияСвойств(тзРейсы.Добавить(), ВыборкаРейсов);
				
				ВыборкаПеревозчиков = ВыборкаРейсов.Выбрать();
				тзПеревозчики = Новый ТаблицаЗначений;
				тзПеревозчики.Колонки.Добавить("Перевозчик");
				тзПеревозчики.Колонки.Добавить("ТипТС");
				
				Пока ВыборкаПеревозчиков.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(тзПеревозчики.Добавить(), ВыборкаПеревозчиков);
				КонецЦикла;
				
				ВходныеПараметры = Новый Структура();
				ВходныеПараметры.Вставить("СпособРасчета",  "РассчитатьРейсыПоПеревозчикам");
				ВходныеПараметры.Вставить("тбзПеревозчики", тзПеревозчики);
				ВходныеПараметры.Вставить("РезультатАдресВоВременномХранилище", 				  Неопределено);
				ВходныеПараметры.Вставить("ПризнакЗавершенияВыполненияАдресВоВременномХранилище", Неопределено);
				
				сткВозврат = упТарификацияВызовСервера.РассчитатьРейсыПоПеревозчикам(тзРейсы, ВходныеПараметры, Неопределено);
				
				Для каждого текРейс Из сткВозврат.Рейсы Цикл
					Для каждого текСтрока Из текРейс.ПлановыеРасходыПоРейсам Цикл
						НоваяСтрока = тзРасходыПоРейсам.Добавить();
						НоваяСтрока.Рейс           = текРейс.Рейс;
						НоваяСтрока.Перевозчик     = текСтрока.Перевозчик;
						НоваяСтрока.ТипТС          = текСтрока.ТипТС;
						НоваяСтрока.РасходыПоРейсу = текСтрока.Сумма;
					КонецЦикла; 
				КонецЦикла; 
				
			КонецЦикла; 
			
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			
			Если тзРасходыПоРейсам.Количество() Тогда
				
				СхемаЗапроса = Новый СхемаЗапроса;
				ТекстЗапроса = 						
				"ВЫБРАТЬ
				|	ТаблицаРасходов.Рейс,
				|	ТаблицаРасходов.Перевозчик,
				|	ТаблицаРасходов.ТипТС,
				|	ТаблицаРасходов.РасходыПоРейсу
				|ПОМЕСТИТЬ втРасходы
				|ИЗ
				|	&ТаблицаРасходов КАК ТаблицаРасходов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	втРеальныеПеревозчики.Рейс,
				|	втРеальныеПеревозчики.Перевозчик,
				|	втРеальныеПеревозчики.РейтингПеревозчика,				
				|	втРеальныеПеревозчики.СобственныйПеревозчик,
				|	ИСТИНА КАК РеальныйПеревозчик,
				|	ЛОЖЬ КАК ВиртуальныйПеревозчик,
				|	втРеальныеПеревозчики.КоличествоТС,
				|	втРеальныеПеревозчики.ТипТС,
				|	втРеальныеПеревозчики.Высота,
				|	втРеальныеПеревозчики.Ширина,
				|	втРеальныеПеревозчики.Длина,
				|	втРеальныеПеревозчики.Грузоподъемность,
				|	втРеальныеПеревозчики.Объем,
				|	втРеальныеПеревозчики.КоличествоМест,
				|	втРеальныеПеревозчики.КоличествоЗагрузочныхМетров,
				|	втРеальныеПеревозчики.ГрузоподъемностьПроцентЗагрузки,
				|	втРеальныеПеревозчики.ОбъемПроцентЗагрузки,
				|	втРеальныеПеревозчики.КоличествоМестПроцентЗагрузки,
				|	втРеальныеПеревозчики.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	ЕСТЬNULL(втРасходы.РасходыПоРейсу, 0) КАК РасходыПоРейсу,
				|	0 КАК Порядок
				|ПОМЕСТИТЬ втРезультат
				|ИЗ
				|	втРеальныеПеревозчики КАК втРеальныеПеревозчики
				|		ЛЕВОЕ СОЕДИНЕНИЕ втРасходы КАК втРасходы
				|		ПО втРеальныеПеревозчики.Рейс = втРасходы.Рейс
				|			И втРеальныеПеревозчики.Перевозчик = втРасходы.Перевозчик
				|			И втРеальныеПеревозчики.ТипТС = втРасходы.ТипТС
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	втТипыТС.Рейс,
				|	ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка),
				|	0,
				|	ЛОЖЬ,
				|	ЛОЖЬ,
				|	ИСТИНА,
				|	-1,
				|	втТипыТС.ТипТС,
				|	втТипыТС.Высота,
				|	втТипыТС.Ширина,
				|	втТипыТС.Длина,
				|	втТипыТС.Грузоподъемность,
				|	втТипыТС.Объем,
				|	втТипыТС.КоличествоМест,
				|	втТипыТС.КоличествоЗагрузочныхМетров,
				|	втТипыТС.ГрузоподъемностьПроцентЗагрузки,
				|	втТипыТС.ОбъемПроцентЗагрузки,
				|	втТипыТС.КоличествоМестПроцентЗагрузки,
				|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	0,
				|	1
				|ИЗ
				|	втТипыТС КАК втТипыТС
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
				|		ПО втТипыТС.Рейс = втВидыПеревозок.Рейс
				|			И (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
				|			И (втТипыТС.Перевозчик = ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка))
				|;
				|ВЫБРАТЬ
				|	втРезультат.Рейс,
				|	втРезультат.Перевозчик,
				|	втРезультат.РейтингПеревозчика,				
				|	втРезультат.СобственныйПеревозчик,
				|	втРезультат.РеальныйПеревозчик,
				|	втРезультат.ВиртуальныйПеревозчик,
				|	втРезультат.КоличествоТС,
				|	втРезультат.ТипТС,
				|	втРезультат.Высота,
				|	втРезультат.Ширина,
				|	втРезультат.Длина,
				|	втРезультат.Грузоподъемность,
				|	втРезультат.Объем,
				|	втРезультат.КоличествоМест,
				|	втРезультат.КоличествоЗагрузочныхМетров,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
				|	втРезультат.ОбъемПроцентЗагрузки,
				|	втРезультат.КоличествоМестПроцентЗагрузки,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	втРезультат.РасходыПоРейсу,
				|	втРезультат.Порядок
				|ИЗ втРезультат КАК втРезультат";
				СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
				
				Запрос.УстановитьПараметр("ТаблицаРасходов", тзРасходыПоРейсам); 
			Иначе
				СхемаЗапроса = Новый СхемаЗапроса;
				ТекстЗапроса = 						
				"ВЫБРАТЬ
				|	втРеальныеПеревозчики.Рейс,
				|	втРеальныеПеревозчики.Перевозчик,
				|	втРеальныеПеревозчики.РейтингПеревозчика,				
				|	втРеальныеПеревозчики.СобственныйПеревозчик,
				|	ИСТИНА КАК РеальныйПеревозчик,
				|	ЛОЖЬ КАК ВиртуальныйПеревозчик,
				|	втРеальныеПеревозчики.КоличествоТС,
				|	втРеальныеПеревозчики.ТипТС,
				|	втРеальныеПеревозчики.Высота,
				|	втРеальныеПеревозчики.Ширина,
				|	втРеальныеПеревозчики.Длина,
				|	втРеальныеПеревозчики.Грузоподъемность,
				|	втРеальныеПеревозчики.Объем,
				|	втРеальныеПеревозчики.КоличествоМест,
				|	втРеальныеПеревозчики.КоличествоЗагрузочныхМетров,
				|	втРеальныеПеревозчики.ГрузоподъемностьПроцентЗагрузки,
				|	втРеальныеПеревозчики.ОбъемПроцентЗагрузки,
				|	втРеальныеПеревозчики.КоличествоМестПроцентЗагрузки,
				|	втРеальныеПеревозчики.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	0 КАК РасходыПоРейсу,
				|	0 КАК Порядок
				|ПОМЕСТИТЬ втРезультат
				|ИЗ
				|	втРеальныеПеревозчики КАК втРеальныеПеревозчики
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	втТипыТС.Рейс,
				|	ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка),
				|	0,
				|	ЛОЖЬ,
				|	ЛОЖЬ,
				|	ИСТИНА,
				|	-1,
				|	втТипыТС.ТипТС,
				|	втТипыТС.Высота,
				|	втТипыТС.Ширина,
				|	втТипыТС.Длина,
				|	втТипыТС.Грузоподъемность,
				|	втТипыТС.Объем,
				|	втТипыТС.КоличествоМест,
				|	втТипыТС.КоличествоЗагрузочныхМетров,
				|	втТипыТС.ГрузоподъемностьПроцентЗагрузки,
				|	втТипыТС.ОбъемПроцентЗагрузки,
				|	втТипыТС.КоличествоМестПроцентЗагрузки,
				|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	0,
				|	1
				|ИЗ
				|	втТипыТС КАК втТипыТС
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
				|		ПО втТипыТС.Рейс = втВидыПеревозок.Рейс
				|			И (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
				|			И (втТипыТС.Перевозчик = ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка))
				|;
				|ВЫБРАТЬ
				|	втРезультат.Рейс,
				|	втРезультат.Перевозчик,
				|	втРезультат.РейтингПеревозчика,				
				|	втРезультат.СобственныйПеревозчик,
				|	втРезультат.РеальныйПеревозчик,
				|	втРезультат.ВиртуальныйПеревозчик,
				|	втРезультат.КоличествоТС,
				|	втРезультат.ТипТС,
				|	втРезультат.Высота,
				|	втРезультат.Ширина,
				|	втРезультат.Длина,
				|	втРезультат.Грузоподъемность,
				|	втРезультат.Объем,
				|	втРезультат.КоличествоМест,
				|	втРезультат.КоличествоЗагрузочныхМетров,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
				|	втРезультат.ОбъемПроцентЗагрузки,
				|	втРезультат.КоличествоМестПроцентЗагрузки,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	втРезультат.РасходыПоРейсу,
				|	втРезультат.Порядок
				|ИЗ втРезультат КАК втРезультат";
				СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);

			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
	Если ЗначениеЗаполнено(ТипыТС) Тогда
		ПакетЗапросов[ПакетЗапросов.Количество() - 1].Операторы[0].Отбор.Добавить("ТипТС В (&ТипыТС)");
		Запрос.УстановитьПараметр("ТипыТС", ТипыТС);
	КонецЕсли; 
	
	ИтоговаяВыборка = ПакетЗапросов[ПакетЗапросов.Количество() - 1];
	ВыраженияПорядка = ИтоговаяВыборка.Порядок;
	
	Если Приоритеты.Количество() Тогда
		ВыраженияПорядка.Очистить();
		
		КолонкиЗапроса = ИтоговаяВыборка.Колонки;
		Для каждого текПриоритет Из Приоритеты Цикл
			Для каждого текКолонка Из КолонкиЗапроса Цикл
				Если текКолонка.Псевдоним = текПриоритет.ИмяПараметра Тогда
					НовоеВыражениеПорядка = ВыраженияПорядка.Добавить(текКолонка);
					Если текПриоритет.Направление = 2 Тогда
						НовоеВыражениеПорядка.Направление = НаправлениеПорядкаСхемыЗапроса.ПоУбыванию;
					КонецЕсли; 
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли; 
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		тзТипыТС = Результат.Выгрузить();
		
		Для каждого текРейс Из МассивРейсов Цикл
			
			тзДоступныеТипыТС = тзТипыТС.НайтиСтроки(Новый Структура("Рейс", текРейс));
			Для каждого текТипТС Из тзДоступныеТипыТС Цикл
				Если текТипТС.КоличествоТС = -1 Тогда // Виртуальное ТС.
					сткРезультатПодбора = Новый Структура("Рейс, Перевозчик, ТипТС", текРейс, текТипТС.Перевозчик, текТипТС.ТипТС);
					мсвРезультатов.Добавить(сткРезультатПодбора);
					Прервать;
				Иначе
					// Проверка на использование в результатах подбора.
					КоличествоТС = текТипТС.КоличествоТС;
					Для каждого текРезультат Из мсвРезультатов Цикл
						Если текРезультат.Перевозчик = текТипТС.Перевозчик И текРезультат.ТипТС = текТипТС.ТипТС Тогда
							КоличествоТС = КоличествоТС - 1;
						КонецЕсли; 
					КонецЦикла; 
					
					Если КоличествоТС > 0 Тогда
						сткРезультатПодбора = Новый Структура("Рейс, Перевозчик, ТипТС", текРейс, текТипТС.Перевозчик, текТипТС.ТипТС);
						мсвРезультатов.Добавить(сткРезультатПодбора);
						Прервать;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(мсвРезультатов, АдресВременногоХранилища);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("true");
	
КонецПроцедуры

// Процедура распределения транспортых средств по рейсам.
//
// Параметры:
//  МассивРейсов - Массив - ССылкам на элементы.
//  ПараметрыКонтроляСовместимости - Структура - Параметры.
//  Приоритеты - ТаблицаЗначений - Таблица данных.
//  ТранспортныеСредства - СправочникСсылка.упТранспортныеСредства - Транспортное средство.
//  АдресВременногоХранилища - Строка - Строковое прдеставление адреса.
//
Процедура РаспределитьТСПоРейсам(МассивРейсов, ПараметрыКонтроляСовместимости, Приоритеты, ТранспортныеСредства, АдресВременногоХранилища) Экспорт
	
	мсвРезультатов = Новый Массив;
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ТекстЗапроса = ПолучитьТекстЗапросаАвтоматическоеНазначениеТС();
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРейсов"                       , МассивРейсов);
	Запрос.УстановитьПараметр("КонтрольМассы"                      , ПараметрыКонтроляСовместимости.КонтрольМассы);
	Запрос.УстановитьПараметр("КонтрольОбъема"                     , ПараметрыКонтроляСовместимости.КонтрольОбъема);
	Запрос.УстановитьПараметр("КонтрольКоличестваМест"             , ПараметрыКонтроляСовместимости.КонтрольКоличестваМест);
	Запрос.УстановитьПараметр("КонтрольКоличестваЗагрузочныхМетров", ПараметрыКонтроляСовместимости.КонтрольКоличестваЗагрузочныхМетров);
	Запрос.УстановитьПараметр("КонтрольГабаритовГрузовогоМеста"    , ПараметрыКонтроляСовместимости.КонтрольГабаритовГрузовогоМеста);
	Запрос.УстановитьПараметр("КонтрольРасписанияРаботыТС"         , ПараметрыКонтроляСовместимости.КонтрольРасписанияРаботыТС);
	Запрос.УстановитьПараметр("КонтрольДоступностиЗон"             , ПараметрыКонтроляСовместимости.ДоступностьЗон);
	Запрос.УстановитьПараметр("КонтрольДоступностиТС"              , ПараметрыКонтроляСовместимости.ДоступностьРесурсовПартнера);
	Запрос.УстановитьПараметр("КонтрольТиповКузовов"               , ПараметрыКонтроляСовместимости.КонтрольТиповКузовов);
	Запрос.УстановитьПараметр("КонтрольКлассовОпасности"           , ПараметрыКонтроляСовместимости.КонтрольКлассовОпасности);
	Запрос.УстановитьПараметр("КонтрольТемпературногоРежима"       , ПараметрыКонтроляСовместимости.КонтрольТемпературногоРежима);
	ВедетсяУчетДокументов 	= ПараметрыКонтроляСовместимости.КонтрольДокументов;
	Запрос.УстановитьПараметр("КонтрольДокументов"       		   , ВедетсяУчетДокументов);
	текТекущаяДата 			= НачалоДня(ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ТекущаяДата", текТекущаяДата);

	РассчитыватьРасходы = Не (Приоритеты.Найти("РасходыПоРейсу", "ИмяПараметра") = Неопределено);
	
	Если РассчитыватьРасходы Тогда
		
		ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
		ПакетЗапросов.Удалить(ПакетЗапросов.Количество() - 1);
		Если ВедетсяУчетДокументов Тогда
			ПакетЗапросов.Удалить(ПакетЗапросов.Количество() - 1);
		КонецЕсли;
		
		ЗапросВыбораСхемыЗапроса = ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втРезультат.Рейс КАК Рейс,
		|	втРезультат.Перевозчик,
		|	втРезультат.ТипТС
		|ИЗ
		|	втРезультат КАК втРезультат
		|ИТОГИ ПО
		|	Рейс";
		ЗапросВыбораСхемыЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			ПоместитьВоВременноеХранилище(мсвРезультатов, АдресВременногоХранилища);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("true");
			Возврат;
			
		Иначе	
			тзРасходыПоРейсам = Новый ТаблицаЗначений;
			тзРасходыПоРейсам.Колонки.Добавить("Рейс"          , Новый ОписаниеТипов("ДокументСсылка.упРейс"));
			тзРасходыПоРейсам.Колонки.Добавить("Перевозчик"    , Новый ОписаниеТипов("СправочникСсылка.упПартнеры"));
			тзРасходыПоРейсам.Колонки.Добавить("ТипТС"         , Новый ОписаниеТипов("СправочникСсылка.упТипыТС"));
			тзРасходыПоРейсам.Колонки.Добавить("РасходыПоРейсу", Новый ОписаниеТипов("Число"));
			
			ВыборкаРейсов = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
			Пока ВыборкаРейсов.Следующий() Цикл
				
				тзРейсы = Новый ТаблицаЗначений;
				тзРейсы.Колонки.Добавить("Рейс"                  , Новый ОписаниеТипов("ДокументСсылка.упРейс"));
				тзРейсы.Колонки.Добавить("ПлановыеРасходыПоРейсу", Новый ОписаниеТипов("Число"));
				
				ЗаполнитьЗначенияСвойств(тзРейсы.Добавить(), ВыборкаРейсов);
				
				ВыборкаПеревозчиков = ВыборкаРейсов.Выбрать();
				тзПеревозчики = Новый ТаблицаЗначений;
				тзПеревозчики.Колонки.Добавить("Перевозчик");
				тзПеревозчики.Колонки.Добавить("ТипТС");
				
				Пока ВыборкаПеревозчиков.Следующий() Цикл
					ЗаполнитьЗначенияСвойств(тзПеревозчики.Добавить(), ВыборкаПеревозчиков);
				КонецЦикла;
				
				ВходныеПараметры = Новый Структура();
				ВходныеПараметры.Вставить("СпособРасчета",  "РассчитатьРейсыПоПеревозчикам");
				ВходныеПараметры.Вставить("тбзПеревозчики", 										тзПеревозчики);
				ВходныеПараметры.Вставить("РезультатАдресВоВременномХранилище", 				  	Неопределено);
				ВходныеПараметры.Вставить("ПризнакЗавершенияВыполненияАдресВоВременномХранилище", 	Неопределено);
				
				сткВозврат = упТарификацияВызовСервера.РассчитатьРейсыПоПеревозчикам(тзРейсы, ВходныеПараметры, Неопределено);
				
				Для каждого текРейс Из сткВозврат.Рейсы Цикл
					Для каждого текСтрока Из текРейс.ПлановыеРасходыПоРейсам Цикл
						НоваяСтрока = тзРасходыПоРейсам.Добавить();
						НоваяСтрока.Рейс           = текРейс.Рейс;
						НоваяСтрока.Перевозчик     = текСтрока.Перевозчик;
						НоваяСтрока.ТипТС          = текСтрока.ТипТС;
						НоваяСтрока.РасходыПоРейсу = текСтрока.Сумма;
					КонецЦикла; 
				КонецЦикла; 
				
			КонецЦикла; 
			
			Если тзРасходыПоРейсам.Количество() Тогда
				
				СхемаЗапроса = Новый СхемаЗапроса;
				ТекстЗапроса = 						
				"ВЫБРАТЬ
				|	ТаблицаРасходов.Рейс,
				|	ТаблицаРасходов.Перевозчик,
				|	ТаблицаРасходов.ТипТС,
				|	ТаблицаРасходов.РасходыПоРейсу
				|ПОМЕСТИТЬ втРасходы
				|ИЗ
				|	&ТаблицаРасходов КАК ТаблицаРасходов
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	втДействующиеДокументы.ТранспортноеСредство,
				|	втДействующиеДокументы.ТипДокумента,
				|	втДействующиеДокументы.Регистратор,
				|	втДействующиеДокументы.ДействуетПо,
				|	втДействующиеДокументы.ДействуетС,
				|	втДействующиеДокументы.ИнтервалПредупреждения,
				|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия,
				|	втДействующиеДокументы.ДокументВыдается
				|ИЗ
				|	втТС КАК втТС
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
				|		ПО (&КонтрольДокументов)
				|			И втТС.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
				|ГДЕ
				|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия
				|	И РАЗНОСТЬДАТ(&ТекущаяДата, втДействующиеДокументы.ДействуетПо, ДЕНЬ) <= втДействующиеДокументы.ИнтервалПредупреждения
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	втРезультат.Рейс,
				|	втРезультат.СобственныйПеревозчик,
				|	втРезультат.ТранспортноеСредство,
				|	втРезультат.ПлановоеНачалоВыполнения,
				|	втРезультат.ПлановоеОкончаниеВыполнения,
				|	втРезультат.ТипТС,
				|	втРезультат.Перевозчик,
				|	втРезультат.РейтингПеревозчика,
				|	втРезультат.Высота,
				|	втРезультат.Ширина,
				|	втРезультат.Длина,
				|	втРезультат.Грузоподъемность,
				|	втРезультат.Объем,
				|	втРезультат.КоличествоМест,
				|	втРезультат.КоличествоЗагрузочныхМетров,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
				|	втРезультат.ОбъемПроцентЗагрузки,
				|	втРезультат.КоличествоМестПроцентЗагрузки,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	ЕСТЬNULL(втРасходы.РасходыПоРейсу, 0) КАК РасходыПоРейсу
				|ИЗ
				|	втРезультат КАК втРезультат
				|		ЛЕВОЕ СОЕДИНЕНИЕ втРасходы КАК втРасходы
				|		ПО втРезультат.Рейс = втРасходы.Рейс
				|			И втРезультат.Перевозчик = втРасходы.Перевозчик
				|			И втРезультат.ТипТС = втРасходы.ТипТС
				|ГДЕ
				|	НЕ &КонтрольДокументов
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	втРезультат.Рейс,
				|	втРезультат.СобственныйПеревозчик,
				|	втРезультат.ТранспортноеСредство,
				|	втРезультат.ПлановоеНачалоВыполнения,
				|	втРезультат.ПлановоеОкончаниеВыполнения,
				|	втРезультат.ТипТС,
				|	втРезультат.Перевозчик,
				|	втРезультат.РейтингПеревозчика,
				|	втРезультат.Высота,
				|	втРезультат.Ширина,
				|	втРезультат.Длина,
				|	втРезультат.Грузоподъемность,
				|	втРезультат.Объем,
				|	втРезультат.КоличествоМест,
				|	втРезультат.КоличествоЗагрузочныхМетров,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
				|	втРезультат.ОбъемПроцентЗагрузки,
				|	втРезультат.КоличествоМестПроцентЗагрузки,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	ЕСТЬNULL(втРасходы.РасходыПоРейсу, 0) КАК РасходыПоРейсу
				|ИЗ
				|	втРезультат КАК втРезультат
				|		ЛЕВОЕ СОЕДИНЕНИЕ втРасходы КАК втРасходы
				|		ПО втРезультат.Рейс = втРасходы.Рейс
				|			И втРезультат.Перевозчик = втРасходы.Перевозчик
				|			И втРезультат.ТипТС = втРасходы.ТипТС
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеСредстваСНеобходимымПакетомДокументов КАК втТранспортныеСредстваСНеобходимымПакетомДокументов
				|		ПО (&КонтрольДокументов)
				|			И втРезультат.ТранспортноеСредство = втТранспортныеСредстваСНеобходимымПакетомДокументов.ТранспортноеСредство
				|
				|УПОРЯДОЧИТЬ ПО
				|	втРезультат.Рейс,
				|	втРезультат.СобственныйПеревозчик УБЫВ,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки УБЫВ,
				|	втРезультат.ОбъемПроцентЗагрузки УБЫВ,
				|	втРезультат.КоличествоМестПроцентЗагрузки УБЫВ,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки УБЫВ";
				
				СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				Запрос.УстановитьПараметр("ТаблицаРасходов", 	тзРасходыПоРейсам); 
				Запрос.УстановитьПараметр("КонтрольДокументов", ВедетсяУчетДокументов); 
				Запрос.УстановитьПараметр("ТекущаяДата", 		текТекущаяДата);	
				
			Иначе
				СхемаЗапроса = Новый СхемаЗапроса;
				ТекстЗапроса = 						
				"ВЫБРАТЬ
				|	втДействующиеДокументы.ТранспортноеСредство,
				|	втДействующиеДокументы.ТипДокумента,
				|	втДействующиеДокументы.Регистратор,
				|	втДействующиеДокументы.ДействуетПо,
				|	втДействующиеДокументы.ДействуетС,
				|	втДействующиеДокументы.ИнтервалПредупреждения,
				|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия,
				|	втДействующиеДокументы.ДокументВыдается
				|ИЗ
				|	втТС КАК втТС
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
				|		ПО (&КонтрольДокументов)
				|			И втТС.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
				|ГДЕ
				|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия
				|	И РАЗНОСТЬДАТ(&ТекущаяДата, втДействующиеДокументы.ДействуетПо, ДЕНЬ) <= втДействующиеДокументы.ИнтервалПредупреждения
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	втРезультат.Рейс,
				|	втРезультат.СобственныйПеревозчик,
				|	втРезультат.ТранспортноеСредство,
				|	втРезультат.ПлановоеНачалоВыполнения,
				|	втРезультат.ПлановоеОкончаниеВыполнения,
				|	втРезультат.ТипТС,
				|	втРезультат.Перевозчик,
				|	втРезультат.РейтингПеревозчика,
				|	втРезультат.Высота,
				|	втРезультат.Ширина,
				|	втРезультат.Длина,
				|	втРезультат.Грузоподъемность,
				|	втРезультат.Объем,
				|	втРезультат.КоличествоМест,
				|	втРезультат.КоличествоЗагрузочныхМетров,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
				|	втРезультат.ОбъемПроцентЗагрузки,
				|	втРезультат.КоличествоМестПроцентЗагрузки,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	0 КАК РасходыПоРейсу
				|ИЗ
				|	втРезультат КАК втРезультат
				|ГДЕ
				|	НЕ &КонтрольДокументов
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	втРезультат.Рейс,
				|	втРезультат.СобственныйПеревозчик,
				|	втРезультат.ТранспортноеСредство,
				|	втРезультат.ПлановоеНачалоВыполнения,
				|	втРезультат.ПлановоеОкончаниеВыполнения,
				|	втРезультат.ТипТС,
				|	втРезультат.Перевозчик,
				|	втРезультат.РейтингПеревозчика,
				|	втРезультат.Высота,
				|	втРезультат.Ширина,
				|	втРезультат.Длина,
				|	втРезультат.Грузоподъемность,
				|	втРезультат.Объем,
				|	втРезультат.КоличествоМест,
				|	втРезультат.КоличествоЗагрузочныхМетров,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
				|	втРезультат.ОбъемПроцентЗагрузки,
				|	втРезультат.КоличествоМестПроцентЗагрузки,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
				|	0 КАК РасходыПоРейсу
				|ИЗ
				|	втРезультат КАК втРезультат
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеСредстваСНеобходимымПакетомДокументов КАК втТранспортныеСредстваСНеобходимымПакетомДокументов
				|		ПО (&КонтрольДокументов)
				|			И втРезультат.ТранспортноеСредство = втТранспортныеСредстваСНеобходимымПакетомДокументов.ТранспортноеСредство
				|
				|УПОРЯДОЧИТЬ ПО
				|	втРезультат.Рейс,
				|	втРезультат.СобственныйПеревозчик УБЫВ,
				|	втРезультат.ГрузоподъемностьПроцентЗагрузки УБЫВ,
				|	втРезультат.ОбъемПроцентЗагрузки УБЫВ,
				|	втРезультат.КоличествоМестПроцентЗагрузки УБЫВ,
				|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки УБЫВ";
				
				СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
				Запрос.УстановитьПараметр("КонтрольДокументов", ВедетсяУчетДокументов); 
				Запрос.УстановитьПараметр("ТекущаяДата", 		текТекущаяДата);
				
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 

	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
	Если ЗначениеЗаполнено(ТранспортныеСредства) Тогда
		ПакетЗапросов[ПакетЗапросов.Количество() - 1].Операторы[0].Отбор.Добавить("ТранспортноеСредство В (&ТранспортныеСредства)");
		Запрос.УстановитьПараметр("ТранспортныеСредства", ТранспортныеСредства);
	КонецЕсли; 
	
	// исключаем собственные ТС не принятые к учету
	ПакетЗапросов[ПакетЗапросов.Количество() - 1].Операторы[0].Отбор.Добавить(
	"ТранспортноеСредство В (ВЫБРАТЬ Т.Ссылка ИЗ Справочник.упТранспортныеСредства КАК Т ГДЕ НЕ Т.СобственноеТранспортноеСредство) ИЛИ 
	|ТранспортноеСредство В (ВЫБРАТЬ Т.ТранспортноеСредство ИЗ РегистрСведений.упУчетныеПараметрыТранспортныхСредств.СрезПоследних КАК Т ГДЕ Т.ПринятоКУчету)");
	
	ИтоговаяВыборка 	= ПакетЗапросов[ПакетЗапросов.Количество() - 1];
	ВыраженияПорядка 	= ИтоговаяВыборка.Порядок;
	
	Если Приоритеты.Количество() Тогда
	    ВыраженияПорядка.Очистить();
		КолонкиЗапроса = ИтоговаяВыборка.Колонки;
		Для каждого текПриоритет Из Приоритеты Цикл
			Для каждого текКолонка Из КолонкиЗапроса Цикл
				Если текКолонка.Псевдоним = текПриоритет.ИмяПараметра Тогда
					НовоеВыражениеПорядка = ВыраженияПорядка.Добавить(текКолонка);
					Если текПриоритет.Направление = 2 Тогда
						НовоеВыражениеПорядка.Направление = НаправлениеПорядкаСхемыЗапроса.ПоУбыванию;
					КонецЕсли; 
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли; 
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		
	КоличествоЗапросовВПакете 			= ПакетЗапросов.Количество();
	ИндексЗапросаТранспортныеСредства 	= КоличествоЗапросовВПакете-1;
	ИндексЗапросаДокументы 				= КоличествоЗапросовВПакете-2;
	
	мсвРезультатыЗапроса    = Запрос.ВыполнитьПакет();
	РезультатЗапросаТранспортныеСредства 				= мсвРезультатыЗапроса[ИндексЗапросаТранспортныеСредства];
	РезультатЗапросаДокументыСИстекшимСрокомГодности	= мсвРезультатыЗапроса[ИндексЗапросаДокументы];
	
	Если Не РезультатЗапросаТранспортныеСредства.Пустой() Тогда
		
		тбзДокументыСИстекающимСрокомГодности	= РезультатЗапросаДокументыСИстекшимСрокомГодности.Выгрузить();
		
		соотПериодыРейсов = Новый Соответствие;
		тзТС = РезультатЗапросаТранспортныеСредства.Выгрузить();
		
		Для каждого текРейс Из МассивРейсов Цикл
			тзДоступныеТС = тзТС.НайтиСтроки(Новый Структура("Рейс", текРейс));
			Для каждого текТС Из тзДоступныеТС Цикл
				НазначитьТС = Истина;
				
				// Проверка на использование в результатах подбора.
				Для каждого текРезультат Из мсвРезультатов Цикл
					Если НазначитьТС И текРезультат.ТранспортноеСредство = текТС.ТранспортноеСредство Тогда
						мсвПериодов = соотПериодыРейсов.Получить(текТС.ТранспортноеСредство);
						Если мсвПериодов <> Неопределено Тогда
							Для каждого текПериод Из мсвПериодов Цикл
								Если Ложь
									Или (Истина
										И текПериод.ПлановоеНачалоВыполнения >= текТС.ПлановоеНачалоВыполнения 
										И текПериод.ПлановоеНачалоВыполнения <= текТС.ПлановоеОкончаниеВыполнения)
									Или (Истина
										И текПериод.ПлановоеОкончаниеВыполнения >= текТС.ПлановоеНачалоВыполнения 
										И текПериод.ПлановоеОкончаниеВыполнения <= текТС.ПлановоеОкончаниеВыполнения) 
								Тогда
									НазначитьТС = Ложь;
									Прервать;
								КонецЕсли; 
							КонецЦикла; 
						КонецЕсли; 
					КонецЕсли; 
				КонецЦикла; 
				
				Если НазначитьТС Тогда
					мсвСообщений = Новый Массив;
					Если ВедетсяУчетДокументов Тогда
						мсвДокументы = тбзДокументыСИстекающимСрокомГодности.НайтиСтроки(Новый Структура("ТранспортноеСредство",текТС.ТранспортноеСредство)); 
						Для каждого текСтрока Из мсвДокументы Цикл
							Отказ = Ложь;
							текСообщение = упРейс.ПроверитьДокумент(текСтрока.Регистратор,  	
																	текСтрока.ТипДокумента,
																	текСтрока.ДокументВыдается,
																	текСтрока.ДействуетС,
																	текСтрока.ДействуетПо,
																	текСтрока.ПредупреждатьОбОкончанииСрокаДействия,
																	текСтрока.ИнтервалПредупреждения,
																	текСтрока.ТранспортноеСредство,
																	Справочники.упСотрудники.ПустаяСсылка(),
																	Отказ);
							
							Если ЗначениеЗаполнено(текСообщение) Тогда
								сткСообщение = Новый Структура("Текст, Ссылка", текСообщение, текСтрока.Регистратор);
								мсвСообщений.Добавить(сткСообщение);
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					сткРезультатПодбора = Новый Структура("Рейс, Перевозчик, ТипТС, ТранспортноеСредство, мсвСообщения", текРейс, текТС.Перевозчик, текТС.ТипТС, текТС.ТранспортноеСредство, мсвСообщений);
					мсвРезультатов.Добавить(сткРезультатПодбора);
					
					мсвПериодов = соотПериодыРейсов.Получить(текТС.ТранспортноеСредство);
					сткПериод = Новый Структура("ПлановоеНачалоВыполнения, ПлановоеОкончаниеВыполнения", текТС.ПлановоеНачалоВыполнения, текТС.ПлановоеОкончаниеВыполнения);
					Если мсвПериодов = Неопределено Тогда
						соотПериодыРейсов.Вставить(текТС.ТранспортноеСредство, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(сткПериод));
					Иначе
						мсвПериодов.Добавить(сткПериод);
					КонецЕсли; 
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли;	
	
	ПоместитьВоВременноеХранилище(мсвРезультатов, АдресВременногоХранилища);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("true");
	
КонецПроцедуры

// Процедура распределения водителей по рейсам.
//
// Параметры:
//  МассивРейсов - Массив - ССылкам на элементы.
//  ПараметрыКонтроляСовместимости - Структура - Параметры.
//  Водители - СправочникСсылка.упСотрудники - ССылка на элемент.
//  АдресВременногоХранилища - Строка - Строковое прдеставление адреса.
//
Процедура РаспределитьВодителейПоРейсам(МассивРейсов, ПараметрыКонтроляСовместимости, Водители, АдресВременногоХранилища) Экспорт
	
	мсвРезультатов = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРейсов", МассивРейсов);
	Запрос.УстановитьПараметр("КонтрольДоступностиВодителей", ПараметрыКонтроляСовместимости.ДоступностьРесурсовПартнера);
	Запрос.УстановитьПараметр("КонтрольРасписанияРаботыВодителей", ПараметрыКонтроляСовместимости.КонтрольРасписанияРаботыВодителей);
	ВедетсяУчетДокументов = ПараметрыКонтроляСовместимости.КонтрольДокументов;
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КонтрольДокументов", ВедетсяУчетДокументов);
	ТекстЗапроса = ПолучитьТекстЗапросаАвтоматическоеНазначениеВодителей();
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов;
	КоличествоЗапросовВПакете = ПакетЗапросов.Количество();
	
	ИндексЗапросВодители = 3;
	ИндексЗапросВодителиИтог = КоличествоЗапросовВПакете - 2;
	ИндексЗапросДокументы = КоличествоЗапросовВПакете - 1;   
	
	Если ЗначениеЗаполнено(Водители) Тогда
		ПакетЗапросов[ИндексЗапросВодители].Операторы[0].Отбор.Добавить("Сотрудник В (&Водители)");
		Запрос.УстановитьПараметр("Водители", Водители);
	КонецЕсли; 
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	мсвРезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатЗапросаВодители = мсвРезультатыЗапроса[ИндексЗапросВодителиИтог];
	РезультатЗапросаДокументыСИстекшимСрокомГодности = мсвРезультатыЗапроса[ИндексЗапросДокументы];

	Если Не РезультатЗапросаВодители.Пустой() Тогда
		тзВодители = РезультатЗапросаВодители.Выгрузить();
		
		Для каждого текРейс Из МассивРейсов Цикл
			тзДоступныеВодители = тзВодители.НайтиСтроки(Новый Структура("Рейс", текРейс));
			Для каждого текВодитель Из тзДоступныеВодители Цикл
				НазначитьВодителя = Истина;
				
				// Проверка на использование в результатах подбора.
				Для каждого текРезультат Из мсвРезультатов Цикл
					Если текРезультат.Водитель1 = текВодитель.Водитель1 Тогда
						НазначитьВодителя = Ложь;
						Прервать;
					КонецЕсли; 
				КонецЦикла; 
				
				Если НазначитьВодителя Тогда
					мсвСообщений = Новый Массив;
					
					Если ВедетсяУчетДокументов Тогда
						тбзДоступныеДокументы 	=  РезультатЗапросаДокументыСИстекшимСрокомГодности.Выгрузить();
						мсвДоступныхДокументов 	= тбзДоступныеДокументы.НайтиСтроки(Новый Структура("ТранспортноеСредство, Водитель1", 
																										текВодитель.ТранспортноеСредство, 
																										текВодитель.Водитель1));
						Для каждого текСтрока Из мсвДоступныхДокументов Цикл
							Отказ = Ложь;
							текСообщение = упРейс.ПроверитьДокумент(текСтрока.Регистратор,  	
																	текСтрока.ТипДокумента,
																	текСтрока.ДокументВыдается,
																	текСтрока.ДействуетС,
																	текСтрока.ДействуетПо,
																	текСтрока.ПредупреждатьОбОкончанииСрокаДействия,
																	текСтрока.ИнтервалПредупреждения,
																	текСтрока.ТранспортноеСредство,
																	текСтрока.Водитель1,Отказ);
							
							Если ЗначениеЗаполнено(текСообщение) Тогда
								сткСообщение = Новый Структура("Текст, Ссылка", текСообщение, текСтрока.Регистратор);
								мсвСообщений.Добавить(сткСообщение);
							КонецЕсли;
							
						КонецЦикла;
						
					КонецЕсли;
					
					сткРезультатПодбора = Новый Структура("Рейс, Перевозчик, ТипТС, ТранспортноеСредство, Водитель1, мсвСообщения", 
															текРейс, 
															текВодитель.Перевозчик, 
															текВодитель.ТипТС, 
															текВодитель.ТранспортноеСредство, 
															текВодитель.Водитель1, 
															мсвСообщений);
					мсвРезультатов.Добавить(сткРезультатПодбора);
					Прервать;
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла; 
	КонецЕсли;

	ПоместитьВоВременноеХранилище(мсвРезультатов, АдресВременногоХранилища);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("true");
	
КонецПроцедуры

// Получает экипаж по умолчанию для рейса.
//
// Параметры:
//  ПлановоеНачалоВыполнения				 - Дата	 - Дата
//  ПлановоеОкончаниеВыполнения			 - Дата	 - Дата
//  УчитыватьГрафикиРаботыОсновныхВодителей	 - Булево	 - признак учета графика.
//  РеквизитыПоУмолчанию					 - Структура	 - в нее добавляются Водитель1, Водитель2, Экспедитор
//
Процедура ПолучитьЭкипажПоУмолчаниюДляРейса(ПлановоеНачалоВыполнения, ПлановоеОкончаниеВыполнения, УчитыватьГрафикиРаботыОсновныхВодителей, РеквизитыПоУмолчанию) Экспорт 
	
	ОсновныеВодители = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыПоУмолчанию.ТранспортноеСредство, "ОсновнойВодитель, ВторойОсновнойВодитель, ОсновнойЭкспедитор");
	Если Не УчитыватьГрафикиРаботыОсновныхВодителей Тогда
		РеквизитыПоУмолчанию.Вставить("Водитель1", ОсновныеВодители.ОсновнойВодитель);
		РеквизитыПоУмолчанию.Вставить("Водитель2", ОсновныеВодители.ВторойОсновнойВодитель);
		РеквизитыПоУмолчанию.Вставить("Экспедитор", ОсновныеВодители.ОсновнойЭкспедитор);
	Иначе
		Водитель1Доступен = Истина
						И ЗначениеЗаполнено(ОсновныеВодители.ОсновнойВодитель)
						И упРейс.ВодительМожетБытьНазначенНаРейсПоПлановымДатам(ОсновныеВодители.ОсновнойВодитель, ПлановоеНачалоВыполнения, ПлановоеОкончаниеВыполнения);
		Водитель2Доступен = Истина
						И ЗначениеЗаполнено(ОсновныеВодители.ВторойОсновнойВодитель)
						И упРейс.ВодительМожетБытьНазначенНаРейсПоПлановымДатам(ОсновныеВодители.ВторойОсновнойВодитель, ПлановоеНачалоВыполнения, ПлановоеОкончаниеВыполнения);
		Если Водитель1Доступен Тогда 
			РеквизитыПоУмолчанию.Вставить("Водитель1", ОсновныеВодители.ОсновнойВодитель);
			Если Водитель2Доступен Тогда
				РеквизитыПоУмолчанию.Вставить("Водитель2", ОсновныеВодители.ВторойОсновнойВодитель);
			КонецЕсли; 
		Иначе
			Если Водитель2Доступен Тогда
				РеквизитыПоУмолчанию.Вставить("Водитель1", ОсновныеВодители.ВторойОсновнойВодитель);
			КонецЕсли; 
		КонецЕсли;
		ЭкспедиторДоступен = Истина
			И ЗначениеЗаполнено(ОсновныеВодители.ОсновнойЭкспедитор)
			И упРейс.ВодительМожетБытьНазначенНаРейсПоПлановымДатам(ОсновныеВодители.ОсновнойЭкспедитор, ПлановоеНачалоВыполнения, ПлановоеОкончаниеВыполнения);
		Если ЭкспедиторДоступен Тогда
			РеквизитыПоУмолчанию.Вставить("Экспедитор", ОсновныеВодители.ОсновнойЭкспедитор);
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры

// Возвращает текст запроса для определения доступных типов транспортных средств.
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаДоступныеТипыТС() Экспорт

	Возврат
	"
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упРейс.Ссылка КАК Рейс,
	|	упРейс.Организация КАК Организация,
	|	упРейс.ВидПеревозки КАК ВидПеревозки,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.Регистратор, ЗНАЧЕНИЕ(Документ.упРейс.ПустаяСсылка)) КАК Подтверждение,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.Перевозчик, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)) КАК Перевозчик,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТипТС, ЗНАЧЕНИЕ(Справочник.упТипыТС.ПустаяСсылка)) КАК ТипТС,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство, ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)) КАК ТранспортноеСредство,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Масса, 0) КАК Масса,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоЗагрузочныхМетров, 0) КАК КоличествоЗагрузочныхМетров
	|ПОМЕСТИТЬ втРейсыОтбор
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	|	ПО упРейс.Ссылка = упПлановыеПараметрыРейса.Рейс
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(
	|		,
	|		Рейс В (&МассивРейсов)) КАК упПеревозчикПоРейсуСрезПоследних
	|	ПО упРейс.Ссылка = упПеревозчикПоРейсуСрезПоследних.Рейс
	|ГДЕ упРейс.Ссылка В (&МассивРейсов)
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА втРейсы.ТранспортноеСредство <> ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьНарушенияТС,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА втРейсы.Перевозчик <> ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьПеревозчики,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА втРейсы.Подтверждение ССЫЛКА Документ.упПодтверждениеЗаявкиНаТС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ) КАК ЕстьПодтвержденныеЗаявки,
	|	МАКСИМУМ(втРейсы.ВидПеревозки) КАК ВидПеревозки,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втРейсы.ВидПеревозки) КАК КоличествоВидовПеревозок,
	|	МАКСИМУМ(втРейсы.Организация) КАК Организация,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втРейсы.Организация) КАК КоличествоОрганизаций
	|ПОМЕСТИТЬ втКонтроль
	|ИЗ
	|	втРейсыОтбор КАК втРейсы
	|;
	|//{Запрос: 2 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсы.Рейс КАК Рейс,
	|	втРейсы.ВидПеревозки КАК ВидПеревозки,
	|	втРейсы.Организация КАК Организация,
	|	втРейсы.Перевозчик КАК Перевозчик,
	|	втРейсы.ТипТС КАК ТипТС,
	|	втРейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втРейсы.Масса КАК Масса,
	|	втРейсы.Объем КАК Объем,
	|	втРейсы.КоличествоМест КАК КоличествоМест,
	|	втРейсы.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров
	|ПОМЕСТИТЬ втРейсы
	|ИЗ
	|	втРейсыОтбор КАК втРейсы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтроль КАК втКонтроль
	|	ПО ИСТИНА
	|		И НЕ (втКонтроль.ЕстьНарушенияТС)
	|		И НЕ (втКонтроль.ЕстьПодтвержденныеЗаявки)
	|		И НЕ (втКонтроль.КоличествоВидовПеревозок > 1)
	|		И ВЫБОР
	|				КОГДА &ТолькоСобственныеПеревозчики
	|						И втКонтроль.КоличествоОрганизаций > 1
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|;
	|//{Запрос: 3 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упВидыПеревозок.ВыборПеревозчика КАК ВариантВыбораПеревозчика,
	|	упВидыПеревозок.Перевозчик КАК Перевозчик
	|ПОМЕСТИТЬ втВидыПеревозок
	|ИЗ
	|	Справочник.упВидыПеревозок КАК упВидыПеревозок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтроль КАК втКонтроль
	|	ПО ИСТИНА
	|		И упВидыПеревозок.Ссылка = втКонтроль.ВидПеревозки
	|		И втКонтроль.КоличествоВидовПеревозок = 1
	|		И НЕ (втКонтроль.ЕстьНарушенияТС)
	|		И НЕ (втКонтроль.ЕстьПодтвержденныеЗаявки)
	|;
	|//{Запрос: 4 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упРейсЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
	|	упРейсЗадания.Задание КАК Задание,
	|	упРейсЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
	|	втРейсы.ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах КАК ПараметрыВводаИнформацииОГрузовыхМестах
	|ПОМЕСТИТЬ втЗаданияРейса
	|ИЗ
	|	Документ.упРейс.Задания КАК упРейсЗадания
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|	ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	|;
	|//{Запрос: 5 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втРейсы.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	|	втРейсы.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)) КАК Ширина,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)) КАК Длина,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0)) КАК Высота
	|ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|		,
	|		ЗаявкаНаПеревозку В (
	|			ВЫБРАТЬ
	|				втЗадания.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза
	|			ИЗ
	|				втЗаданияРейса КАК втЗадания
	|			ГДЕ НЕ (втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка)))) КАК упПараметрыЗаявкиНаПеревозку
	|	ПО ИСТИНА
	|		И втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|		И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|		,
	|		ЗаданиеНаПеревозку В (
	|			ВЫБРАТЬ
	|				втЗадания.Задание КАК Задание
	|			ИЗ
	|				втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|	ПО ИСТИНА
	|		И втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|		И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|	ПО ИСТИНА
	|		И &КонтрольТиповКузовов
	|		И втРейсы.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|ГДЕ втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах В (ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку),
	|		ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса))
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)) КАК Ширина,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)) КАК Длина,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0)) КАК Высота
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
	|	ПО ИСТИНА
	|		И втРейсы.Задание = упГрузовыеМеста.Ссылка
	|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|		,
	|		ЗаявкаНаПеревозку В (
	|			ВЫБРАТЬ
	|				втЗадания.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза
	|			ИЗ
	|				втЗаданияРейса КАК втЗадания
	|			ГДЕ НЕ (втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка)))) КАК упПараметрыЗаявкиНаПеревозку
	|	ПО ИСТИНА
	|		И упГрузовыеМеста.Ссылка.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|		И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|		,
	|		ЗаданиеНаПеревозку В (
	|			ВЫБРАТЬ
	|				втЗадания.Задание КАК Задание
	|			ИЗ
	|				втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|	ПО ИСТИНА
	|		И упГрузовыеМеста.Ссылка = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|		И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|	ПО ИСТИНА
	|		И &КонтрольТиповКузовов
	|		И упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)) КАК Ширина,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)) КАК Длина,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0)) КАК Высота
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
	|	ПО ИСТИНА
	|		И втРейсы.Задание = упГрузовыеМеста.Ссылка
	|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|		,
	|		ЗаявкаНаПеревозку В (
	|			ВЫБРАТЬ
	|				втЗадания.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза
	|			ИЗ
	|				втЗаданияРейса КАК втЗадания
	|			ГДЕ НЕ (втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка)))) КАК упПараметрыЗаявкиНаПеревозку
	|	ПО ИСТИНА
	|		И втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|		И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|		,
	|		ЗаданиеНаПеревозку В (
	|			ВЫБРАТЬ
	|				втЗадания.Задание КАК Задание
	|			ИЗ
	|				втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|	ПО ИСТИНА
	|		И втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|		И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|	ПО ИСТИНА
	|		И &КонтрольТиповКузовов
	|		И упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|		//ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	//	упРейсЗадания.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	|	//	упРейсЗадания.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	|	//	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	|	//	упРейсЗадания.ГрузовоеМесто.Ширина КАК Ширина,
	|	//	упРейсЗадания.ГрузовоеМесто.Длина КАК Длина,
	|	//	упРейсЗадания.ГрузовоеМесто.Высота КАК Высота,
	|	//	втРейсы.Масса КАК Масса,
	|	//	втРейсы.Объем КАК Объем,
	|	//	втРейсы.КоличествоМест КАК КоличествоМест,
	|	//	втРейсы.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров
	|	//ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
	|	//ИЗ
	|	//	Документ.упРейс.Задания КАК упРейсЗадания
	|	//		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|	//		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	|	//			И (упРейсЗадания.ГрузовоеМесто <> ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	|	//		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|	//		ПО (&КонтрольТиповКузовов)
	|	//			И упРейсЗадания.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|	//ОБЪЕДИНИТЬ ВСЕ
	|	//ВЫБРАТЬ
	|	//	ГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	|	//	ГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	|	//	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	|	//	ГрузовыеМеста.ГрузовоеМесто.Ширина,
	|	//	ГрузовыеМеста.ГрузовоеМесто.Длина,
	|	//	ГрузовыеМеста.ГрузовоеМесто.Высота,
	|	//	втРейсы.Масса,
	|	//	втРейсы.Объем,
	|	//	втРейсы.КоличествоМест,
	|	//	втРейсы.КоличествоЗагрузочныхМетров
	|	//ИЗ
	|	//	Документ.упРейс.Задания КАК упРейсЗадания
	|	//		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|	//		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	|	//			И (упРейсЗадания.ГрузовоеМесто = ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	|	//		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК ГрузовыеМеста
	|	//		ПО упРейсЗадания.Задание = ГрузовыеМеста.Ссылка
	|	//		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|	//		ПО (&КонтрольТиповКузовов)
	|	//			И (ГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)
	|	
	|;
	|//{Запрос: 6 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА втДанныеСовместимости.Ширина >= втДанныеСовместимости.Длина
	|			ТОГДА втДанныеСовместимости.Ширина
	|		ИНАЧЕ втДанныеСовместимости.Длина
	|	КОНЕЦ) КАК Длина,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА втДанныеСовместимости.Ширина <= втДанныеСовместимости.Длина
	|			ТОГДА втДанныеСовместимости.Ширина
	|		ИНАЧЕ втДанныеСовместимости.Длина
	|	КОНЕЦ) КАК Ширина,
	|	МАКСИМУМ(втДанныеСовместимости.Высота) КАК Высота,
	|	МАКСИМУМ(втРейсы.Масса) КАК Масса,
	|	МАКСИМУМ(втРейсы.Объем) КАК Объем,
	|	МАКСИМУМ(втРейсы.КоличествоМест) КАК КоличествоМест,
	|	МАКСИМУМ(втРейсы.КоличествоЗагрузочныхМетров) КАК КоличествоЗагрузочныхМетров
	|ПОМЕСТИТЬ втДанныеСовместимости
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|	ПО ИСТИНА
	|;
	|//{Запрос: 7 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.ТипКузова КАК ТипКузова
	|ПОМЕСТИТЬ втТипыКузововРейсов
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|;
	|//{Запрос: 8 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	упРейсМаршрут.Адрес.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втЗоныРейсов
	|ИЗ
	|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
	|		,
	|		Рейс В (
	|			ВЫБРАТЬ
	|				втРейсы.Рейс КАК Рейс
	|			ИЗ
	|				втРейсы КАК втРейсы)) КАК упРейсМаршрут
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|	ПО ИСТИНА
	|		И &КонтрольДоступностиЗон
	|		И упРейсМаршрут.Рейс = втРейсы.Рейс
	|		И НЕ (упРейсМаршрут.Отменена)
	|;
	|//{Запрос: 9 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Задания.Задание.Отправитель.ДоступныеРесурсы КАК Правило
	|ПОМЕСТИТЬ ОбязательныеПравилаДоступностиРесурсов
	|ИЗ
	|	Документ.упРейс.Задания КАК Задания
	|ГДЕ ИСТИНА
	|	И &КонтрольДоступностиТС
	|	И Задания.Ссылка В (&МассивРейсов)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Задания.Задание.Получатель.ДоступныеРесурсы КАК Правило
	|ИЗ
	|	Документ.упРейс.Задания КАК Задания
	|ГДЕ ИСТИНА
	|	И &КонтрольДоступностиТС
	|	И Задания.Ссылка В (&МассивРейсов)
	|;
	|//{Запрос: 10 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоступныеМоделиТранспорта.МодельТранспорта.ТипТС КАК ТипТС
	|ПОМЕСТИТЬ ДоступныеТипыТранспортаКакРесурсы
	|ИЗ
	|	ОбязательныеПравилаДоступностиРесурсов КАК ОбязательныеПравилаДоступностиРесурсов
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеМоделиТранспорта КАК ДоступныеМоделиТранспорта
	|	ПО ДоступныеМоделиТранспорта.Правило = ОбязательныеПравилаДоступностиРесурсов.Правило
	|ГДЕ &КонтрольДоступностиТС
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеМоделиТранспорта.МодельТранспорта,
	|	ДоступныеМоделиТранспорта.МодельТранспорта.ТипТС
	|ИМЕЮЩИЕ СУММА(1) = СУММА(ВЫБОР
	|			КОГДА НЕ ДоступныеМоделиТранспорта.МодельТранспорта ЕСТЬ NULL
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|;
	|//{Запрос: 11 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упТипыТС.Ссылка КАК ТипТС
	|ПОМЕСТИТЬ втТипыБезМодели
	|ИЗ
	|	Справочник.упТипыТС КАК упТипыТС
	|ГДЕ ИСТИНА
	|	И &КонтрольДоступностиТС
	|	И НЕ (упТипыТС.Ссылка В (
	|			ВЫБРАТЬ
	|				упМоделиТС.ТипТС КАК ТипТС
	|			ИЗ
	|				Справочник.упМоделиТС КАК упМоделиТС
	|			ГДЕ
	|				НЕ (упМоделиТС.ПометкаУдаления)))
	|;
	|//{Запрос: 12 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.КлассОпасности КАК КлассОпасности
	|ПОМЕСТИТЬ втКлассыОпасности
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ втДанныеСовместимости.КлассОпасности <> ЗНАЧЕНИЕ(Справочник.упКлассыОпасности.ПустаяСсылка)
	|;
	|//{Запрос: 13 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.ТемпературныйРежим КАК ТемпературныйРежим
	|ПОМЕСТИТЬ втТемпературныеРежимы
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ втДанныеСовместимости.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка)
	|;
	|//{Запрос: 14 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упТипыТС.Ссылка КАК ТипТС,
	|	упТипыТС.Высота КАК Высота,
	|	упТипыТС.Ширина КАК Ширина,
	|	упТипыТС.Длина КАК Длина,
	|	упТипыТС.Грузоподъемность КАК Грузоподъемность,
	|	упТипыТС.Объем КАК Объем,
	|	упТипыТС.КоличествоМест КАК КоличествоМест,
	|	упТипыТС.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	упТипыТС.ТемпературныйРежим КАК ТемпературныйРежим,
	|	упТипыТС.ТипКузова КАК ТипКузова,
	|	упТипыТС.ДоступныеЗоны КАК ДоступныеЗоны,
	|	ВЫБОР
	|		КОГДА втРейсы.ТипТС ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыбранТипТС,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.Грузоподъемность = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.Масса / упТипыТС.Грузоподъемность * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ГрузоподъемностьПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.Объем = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.Объем / упТипыТС.Объем * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.КоличествоМест = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.КоличествоМест / упТипыТС.КоличествоМест * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоМестПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.КоличествоЗагрузочныхМетров = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.КоличествоЗагрузочныхМетров / упТипыТС.КоличествоЗагрузочныхМетров * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗагрузочныхМетровПроцентЗагрузки
	|ПОМЕСТИТЬ втТипыТСПодготовка
	|ИЗ
	|	Справочник.упТипыТС КАК упТипыТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеСовместимости КАК втДанныеСовместимости
	|	ПО ИСТИНА
	|		И (ЛОЖЬ
	|			ИЛИ НЕ (&КонтрольМассы)
	|			ИЛИ упТипыТС.Грузоподъемность = 0
	|			ИЛИ упТипыТС.Грузоподъемность >= втДанныеСовместимости.Масса)
	|		И (ЛОЖЬ
	|			ИЛИ НЕ (&КонтрольОбъема)
	|			ИЛИ упТипыТС.Объем = 0
	|			ИЛИ упТипыТС.Объем >= втДанныеСовместимости.Объем)
	|		И (ЛОЖЬ
	|			ИЛИ НЕ (&КонтрольКоличестваМест)
	|			ИЛИ упТипыТС.КоличествоМест = 0
	|			ИЛИ упТипыТС.КоличествоМест >= втДанныеСовместимости.КоличествоМест)
	|		И (ЛОЖЬ
	|			ИЛИ НЕ (&КонтрольКоличестваЗагрузочныхМетров)
	|			ИЛИ упТипыТС.КоличествоЗагрузочныхМетров = 0
	|			ИЛИ упТипыТС.КоличествоЗагрузочныхМетров >= втДанныеСовместимости.КоличествоЗагрузочныхМетров)
	|		И (ЛОЖЬ
	|			ИЛИ НЕ (&КонтрольГабаритовГрузовогоМеста)
	|			ИЛИ (ИСТИНА
	|				И упТипыТС.Ширина = 0
	|				И упТипыТС.Длина = 0
	|				И упТипыТС.Высота = 0)
	|			ИЛИ ВЫБОР
	|					КОГДА упТипыТС.Ширина >= упТипыТС.Длина
	|						ТОГДА упТипыТС.Ширина
	|					ИНАЧЕ упТипыТС.Длина
	|				КОНЕЦ >= втДанныеСовместимости.Длина
	|			ИЛИ ВЫБОР
	|					КОГДА упТипыТС.Ширина <= упТипыТС.Длина
	|						ТОГДА упТипыТС.Ширина
	|					ИНАЧЕ упТипыТС.Длина
	|				КОНЕЦ >= втДанныеСовместимости.Ширина
	|			ИЛИ упТипыТС.Высота >= втДанныеСовместимости.Высота)
	|		И (ЛОЖЬ
	|			ИЛИ НЕ (&КонтрольТиповКузовов)
	|			ИЛИ упТипыТС.ТипКузова = ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)
	|			ИЛИ упТипыТС.ТипКузова В (
	|					ВЫБРАТЬ
	|						втТипыКузововРейсов.ТипКузова КАК ТипКузова
	|					ИЗ
	|						втТипыКузововРейсов КАК втТипыКузововРейсов))
	|		И упТипыТС.ВидТранспорта В (ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ЛегковойАвтомобиль),
	|				ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ГрузовойАвтомобиль))
	|		И НЕ (упТипыТС.ПометкаУдаления)
	|		И НЕ упТипыТС.ВидТранспорта = ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.Контейнер)
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		втРейсы.ТипТС КАК ТипТС
	|	ИЗ
	|		втРейсы КАК втРейсы) КАК втРейсы
	|	ПО упТипыТС.Ссылка = втРейсы.ТипТС
	|	
	|;
	|//{Запрос: 15 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыТС.ТипТС КАК ТипТС,
	|	упДоступныеГеографическиеЗоны.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втДоступныеЗоны
	|ИЗ
	|	втТипыТСПодготовка КАК втТипыТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеГеографическиеЗоны КАК упДоступныеГеографическиеЗоны
	|	ПО ИСТИНА
	|		И &КонтрольДоступностиЗон
	|		И втТипыТС.ДоступныеЗоны = упДоступныеГеографическиеЗоны.ПравилаДоступности
	|;
	|//{Запрос: 16 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыТС.ТипТС КАК ТипТС,
	|	ДопустимыеКлассыОпасныхГрузов.КлассОпасности КАК КлассОпасности
	|ПОМЕСТИТЬ втДоступныеКлассыОпасности
	|ИЗ
	|	втТипыТСПодготовка КАК втТипыТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТипыТС.ДопустимыеКлассыОпасныхГрузов КАК ДопустимыеКлассыОпасныхГрузов
	|	ПО ИСТИНА
	|		И &КонтрольКлассовОпасности
	|		И втТипыТС.ТипТС = ДопустимыеКлассыОпасныхГрузов.Ссылка
	|;
	|//{Запрос: 17 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДоступныеЗоны.ТипТС КАК ТипТС
	|ПОМЕСТИТЬ втИсключитьНедоступныеЗоны
	|ИЗ
	|	втЗоныРейсов КАК втЗоныРейсов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеЗоны КАК втДоступныеЗоны
	|	ПО ИСТИНА
	|		И &КонтрольДоступностиЗон
	|		И НЕ ((втЗоныРейсов.Зона, втДоступныеЗоны.ТипТС) В (
	|					ВЫБРАТЬ
	|					втДоступныеЗоны.Зона КАК Зона,
	|					втДоступныеЗоны.ТипТС КАК ТипТС
	|				ИЗ
	|					втДоступныеЗоны КАК втДоступныеЗоны))
	|;
	|//{Запрос: 18 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТипыТС.ТипТС КАК ТипТС
	|ПОМЕСТИТЬ втИсключитьТемпературныйРежим
	|ИЗ
	|	втТемпературныеРежимы КАК втТемпературныеРежимы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТипыТСПодготовка КАК втТипыТС
	|	ПО ИСТИНА
	|		И &КонтрольТемпературногоРежима
	|		И втТипыТС.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка)
	|		И НЕ (ИСТИНА
	|			И втТипыТС.ТемпературныйРежим.ТемператураОт <= втТемпературныеРежимы.ТемпературныйРежим.ТемператураОт
	|			И втТипыТС.ТемпературныйРежим.ТемператураДо >= втТемпературныеРежимы.ТемпературныйРежим.ТемператураДо)
	|;
	|//{Запрос: 19 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДоступныеКлассыОпасности.ТипТС КАК ТипТС
	|ПОМЕСТИТЬ втИсключитьКлассыОпасности
	|ИЗ
	|	втКлассыОпасности КАК втКлассыОпасности
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеКлассыОпасности КАК втДоступныеКлассыОпасности
	|	ПО ИСТИНА
	|		И &КонтрольКлассовОпасности
	|		И НЕ ((втКлассыОпасности.КлассОпасности, втДоступныеКлассыОпасности.ТипТС) В (
	|					ВЫБРАТЬ
	|					втДоступныеКлассыОпасности.КлассОпасности КАК КлассОпасности,
	|					втДоступныеКлассыОпасности.ТипТС КАК ТипТС
	|				ИЗ
	|					втДоступныеКлассыОпасности КАК втДоступныеКлассыОпасности))
	|;
	|//{Запрос: 20 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыТС.ТипТС КАК ТипТС,
	|	втТипыТС.Высота КАК Высота,
	|	втТипыТС.Ширина КАК Ширина,
	|	втТипыТС.Длина КАК Длина,
	|	втТипыТС.Грузоподъемность КАК Грузоподъемность,
	|	втТипыТС.Объем КАК Объем,
	|	втТипыТС.КоличествоМест КАК КоличествоМест,
	|	втТипыТС.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втТипыТС.ТемпературныйРежим КАК ТемпературныйРежим,
	|	втТипыТС.ТипКузова КАК ТипКузова,
	|	втТипыТС.ДоступныеЗоны КАК ДоступныеЗоны,
	|	втТипыТС.ВыбранТипТС КАК ВыбранТипТС,
	|	втТипыТС.ГрузоподъемностьПроцентЗагрузки КАК ГрузоподъемностьПроцентЗагрузки,
	|	втТипыТС.ОбъемПроцентЗагрузки КАК ОбъемПроцентЗагрузки,
	|	втТипыТС.КоличествоМестПроцентЗагрузки КАК КоличествоМестПроцентЗагрузки,
	|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки КАК КоличествоЗагрузочныхМетровПроцентЗагрузки
	|ПОМЕСТИТЬ втТипыТС
	|ИЗ
	|	втТипыТСПодготовка КАК втТипыТС
	|	ЛЕВОЕ СОЕДИНЕНИЕ втТипыБезМодели КАК втТипыБезМодели
	|	ПО втТипыТС.ТипТС = втТипыБезМодели.ТипТС
	|ГДЕ ИСТИНА
	|	И (ЛОЖЬ
	|		ИЛИ НЕ (&КонтрольДоступностиТС)
	|		ИЛИ НЕ (втТипыБезМодели.ТипТС ЕСТЬ NULL)
	|		ИЛИ втТипыТС.ТипТС В (
	|				ВЫБРАТЬ
	|					Т.ТипТС КАК ТипТС
	|				ИЗ
	|					ДоступныеТипыТранспортаКакРесурсы КАК Т))
	|	И НЕ (втТипыТС.ТипТС В (
	|			ВЫБРАТЬ
	|				втИсключитьНедоступныеЗоны.ТипТС КАК ТипТС
	|			ИЗ
	|				втИсключитьНедоступныеЗоны КАК втИсключитьНедоступныеЗоны))
	|	И НЕ (втТипыТС.ТипТС В (
	|			ВЫБРАТЬ
	|				втИсключитьКлассыОпасности.ТипТС КАК ТипТС
	|			ИЗ
	|				втИсключитьКлассыОпасности КАК втИсключитьКлассыОпасности))
	|	И НЕ (втТипыТС.ТипТС В (
	|			ВЫБРАТЬ
	|				втИсключитьТемпературныйРежим.ТипТС КАК ТипТС
	|			ИЗ
	|				втИсключитьТемпературныйРежим КАК втИсключитьТемпературныйРежим))
	|;
	|//{Запрос: 21 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПартнеры.Ссылка КАК Перевозчик
	|ПОМЕСТИТЬ втПеревозчикиПодготовка
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|	ПО ИСТИНА
	|		И втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаСобственнымиТС)
	|		И НЕ (упПартнеры.ПометкаУдаления)
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтроль КАК втКонтроль
	|	ПО ИСТИНА
	|		И упПартнеры.Организация = втКонтроль.Организация
	|		И втКонтроль.КоличествоОрганизаций = 1
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втВидыПеревозок.Перевозчик КАК Перевозчик
	|ИЗ
	|	втВидыПеревозок КАК втВидыПеревозок
	|ГДЕ втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаОпределеннымПеревозчиком)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	упПартнеры.Ссылка КАК Перевозчик
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|	ПО ИСТИНА
	|		И упПартнеры.Перевозчик
	|		И НЕ (упПартнеры.ПометкаУдаления)
	|		И втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе),
	|				ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально))
	|;
	|//{Запрос: 22 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПартнерыДоступныеТипыТС.Ссылка КАК Перевозчик,
	|	упПартнерыДоступныеТипыТС.ТипТС КАК ТипТС,
	|	упПартнерыДоступныеТипыТС.КоличествоМакс КАК КоличествоМакс,
	|	ВЫБОР
	|		КОГДА втРейсы.Перевозчик ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыбранПеревозчик
	|ПОМЕСТИТЬ втПеревозчики
	|ИЗ
	|	Справочник.упПартнеры.ДоступныеТипыТС КАК упПартнерыДоступныеТипыТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПеревозчикиПодготовка КАК втПеревозчикиПодготовка
	|	ПО упПартнерыДоступныеТипыТС.Ссылка = втПеревозчикиПодготовка.Перевозчик
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтроль КАК втКонтроль
	|	ПО ИСТИНА
	|		И НЕ (втКонтроль.ЕстьНарушенияТС)
	|		И НЕ (втКонтроль.ЕстьПодтвержденныеЗаявки)
	|		И НЕ (&ТолькоСобственныеПеревозчики)
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		втРейсы.Перевозчик КАК Перевозчик
	|	ИЗ
	|		втРейсы КАК втРейсы) КАК втРейсы
	|	ПО упПартнерыДоступныеТипыТС.Ссылка = втРейсы.Перевозчик
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	упПартнерыДоступныеТипыТС.Ссылка КАК Перевозчик,
	|	упПартнерыДоступныеТипыТС.ТипТС КАК ТипТС,
	|	упПартнерыДоступныеТипыТС.КоличествоМакс КАК КоличествоМакс,
	|	ВЫБОР
	|		КОГДА втРейсыПеревозчик.Перевозчик ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВыбранПеревозчик
	|ИЗ
	|	Справочник.упПартнеры.ДоступныеТипыТС КАК упПартнерыДоступныеТипыТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПеревозчикиПодготовка КАК втПеревозчикиПодготовка
	|	ПО упПартнерыДоступныеТипыТС.Ссылка = втПеревозчикиПодготовка.Перевозчик
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтроль КАК втКонтроль
	|	ПО ИСТИНА
	|		И упПартнерыДоступныеТипыТС.Ссылка.Организация = втКонтроль.Организация
	|		И втКонтроль.КоличествоОрганизаций = 1
	|		И &ТолькоСобственныеПеревозчики
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		втРейсы.Перевозчик КАК Перевозчик
	|	ИЗ
	|		втРейсы КАК втРейсы) КАК втРейсыПеревозчик
	|	ПО упПартнерыДоступныеТипыТС.Ссылка = втРейсыПеревозчик.Перевозчик
	|;
	|//{Запрос: 23 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПеревозчики.Перевозчик КАК Перевозчик,
	|	втПеревозчики.ВыбранПеревозчик КАК ВыбранПеревозчик,
	|	втПеревозчики.КоличествоМакс КАК КоличествоТС,
	|	втТипыТС.ВыбранТипТС КАК ВыбранТипТС,
	|	втТипыТС.ТипТС КАК ТипТС,
	|	втТипыТС.Высота КАК Высота,
	|	втТипыТС.Ширина КАК Ширина,
	|	втТипыТС.Длина КАК Длина,
	|	втТипыТС.Грузоподъемность КАК Грузоподъемность,
	|	втТипыТС.Объем КАК Объем,
	|	втТипыТС.КоличествоМест КАК КоличествоМест,
	|	втТипыТС.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втТипыТС.ГрузоподъемностьПроцентЗагрузки КАК ГрузоподъемностьПроцентЗагрузки,
	|	втТипыТС.ОбъемПроцентЗагрузки КАК ОбъемПроцентЗагрузки,
	|	втТипыТС.КоличествоМестПроцентЗагрузки КАК КоличествоМестПроцентЗагрузки,
	|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки КАК КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТипыТС.ТемпературныйРежим КАК ТемпературныйРежим,
	|	втТипыТС.ТипКузова КАК ТипКузова,
	|	втТипыТС.ДоступныеЗоны КАК ДоступныеЗоны,
	|	0 КАК Порядок
	|ИЗ
	|	втПеревозчики КАК втПеревозчики
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТипыТС КАК втТипыТС
	|	ПО втПеревозчики.ТипТС = втТипыТС.ТипТС
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка) КАК Перевозчик,
	|	ЛОЖЬ КАК ВыбранПеревозчик,
	|	- 1 КАК КоличествоТС,
	|	втТипыТС.ВыбранТипТС КАК ВыбранТипТС,
	|	втТипыТС.ТипТС КАК ТипТС,
	|	втТипыТС.Высота КАК Высота,
	|	втТипыТС.Ширина КАК Ширина,
	|	втТипыТС.Длина КАК Длина,
	|	втТипыТС.Грузоподъемность КАК Грузоподъемность,
	|	втТипыТС.Объем КАК Объем,
	|	втТипыТС.КоличествоМест КАК КоличествоМест,
	|	втТипыТС.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втТипыТС.ГрузоподъемностьПроцентЗагрузки КАК ГрузоподъемностьПроцентЗагрузки,
	|	втТипыТС.ОбъемПроцентЗагрузки КАК ОбъемПроцентЗагрузки,
	|	втТипыТС.КоличествоМестПроцентЗагрузки КАК КоличествоМестПроцентЗагрузки,
	|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки КАК КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТипыТС.ТемпературныйРежим КАК ТемпературныйРежим,
	|	втТипыТС.ТипКузова КАК ТипКузова,
	|	втТипыТС.ДоступныеЗоны КАК ДоступныеЗоны,
	|	1 КАК Порядок
	|ИЗ
	|	втТипыТС КАК втТипыТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|	ПО втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе),
	|			ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер),
	|			ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально))
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКонтроль КАК втКонтроль
	|	ПО ИСТИНА
	|		И НЕ (&ТолькоСобственныеПеревозчики)
	|		И НЕ (втКонтроль.ЕстьПеревозчики)
	|		И НЕ (втКонтроль.ЕстьНарушенияТС)
	|		И НЕ (втКонтроль.ЕстьПодтвержденныеЗаявки)
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	втПеревозчики.Перевозчик,
	|	втТипыТС.ГрузоподъемностьПроцентЗагрузки УБЫВ,
	|	втТипыТС.ОбъемПроцентЗагрузки УБЫВ,
	|	втТипыТС.КоличествоМестПроцентЗагрузки УБЫВ,
	|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(ВыбранПеревозчик),
	|	МАКСИМУМ(Порядок)
	|ПО
	|	Перевозчик
	|";

КонецФункции // ПолучитьТекстЗапросаДоступныеТипыТС()

// Возвращает текст запроса для определения доступных транспортных средств.
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаДоступныеТранспортныеСредства() Экспорт
	
	Возврат
	"
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упРейс.Ссылка КАК Рейс,
	|	упРейс.ВидПеревозки КАК ВидПеревозки,
	|	упРейс.Организация КАК Организация,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.Перевозчик, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)) КАК Перевозчик,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТипТС, ЗНАЧЕНИЕ(Справочник.упТипыТС.ПустаяСсылка)) КАК ТипТС,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство, ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)) КАК ТранспортноеСредство,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Масса, 0) КАК Масса,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоЗагрузочныхМетров, 0) КАК КоличествоЗагрузочныхМетров,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ПлановоеНачалоВыполнения,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ПлановоеОкончаниеВыполнения
	|ПОМЕСТИТЬ втРейсыПодбор
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	|		ПО упРейс.Ссылка = упПлановыеПараметрыРейса.Рейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(, Рейс В (&МассивРейсов)) КАК упПеревозчикПоРейсуСрезПоследних
	|		ПО упРейс.Ссылка = упПеревозчикПоРейсуСрезПоследних.Рейс
	|ГДЕ
	|	упРейс.Ссылка В(&МассивРейсов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упВидыПеревозок.ВыборПеревозчика КАК ВариантВыбораПеревозчика,
	|	упВидыПеревозок.Перевозчик КАК Перевозчик
	|ПОМЕСТИТЬ втВидыПеревозок
	|ИЗ
	|	Справочник.упВидыПеревозок КАК упВидыПеревозок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсыПодбор КАК втРейсы
	|		ПО упВидыПеревозок.Ссылка = втРейсы.ВидПеревозки
	|			И (упВидыПеревозок.ВыборПеревозчика <> ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсы.Рейс КАК Рейс,
	|	втРейсы.ВидПеревозки,
	|	ВЫБОР
	|		КОГДА &ТолькоСобственныеПеревозчики
	|				ИЛИ втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаСобственнымиТС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеревозкаСобственнымиТС,
	|	втРейсы.Перевозчик КАК Перевозчик,
	|	втРейсы.ТипТС КАК ТипТС,
	|	втРейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втРейсы.Масса КАК Масса,
	|	втРейсы.Объем КАК Объем,
	|	втРейсы.КоличествоМест КАК КоличествоМест,
	|	втРейсы.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втРейсы.ПлановоеНачалоВыполнения КАК ПлановоеНачалоВыполнения,
	|	втРейсы.ПлановоеОкончаниеВыполнения КАК ПлановоеОкончаниеВыполнения
	|ПОМЕСТИТЬ втРейсы
	|ИЗ
	|	втРейсыПодбор КАК втРейсы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВидыПеревозок.Перевозчик КАК Перевозчик
	|ПОМЕСТИТЬ втПеревозчики
	|ИЗ
	|	втВидыПеревозок КАК втВидыПеревозок
	|ГДЕ
	|	втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаОпределеннымПеревозчиком)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упПартнеры.Ссылка
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (упПартнеры.Перевозчик)
	|			И (НЕ упПартнеры.ПометкаУдаления)
	|			И (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упРейсЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
	|	упРейсЗадания.Задание,
	|	упРейсЗадания.ГрузовоеМесто,
	|	втРейсы.ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах КАК ПараметрыВводаИнформацииОГрузовыхМестах
	|ПОМЕСТИТЬ втЗаданияРейса
	|ИЗ
	|	Документ.упРейс.Задания КАК упРейсЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втРейсы.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	|	втРейсы.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)) КАК Ширина, 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)) КАК Длина, 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0)) КАК Высота 
	|ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|		ПО (&КонтрольТиповКузовов)
	|			И втРейсы.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|ГДЕ
	|	втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах В (ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку), 
	|ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0))
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
	|		ПО втРейсы.Задание = упГрузовыеМеста.Ссылка
	|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО упГрузовыеМеста.Ссылка.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|			И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО упГрузовыеМеста.Ссылка = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|			И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|		ПО (&КонтрольТиповКузовов)
	|			И (упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0))
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
	|		ПО втРейсы.Задание = упГрузовыеМеста.Ссылка
	|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|		ПО (&КонтрольТиповКузовов)
	|			И (упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)
	|//////////////////////////////////////////////////////////////////////////////////
	|//ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|//	упРейсЗадания.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	|//	упРейсЗадания.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	|//	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	|//	упРейсЗадания.ГрузовоеМесто.Ширина КАК Ширина,
	|//	упРейсЗадания.ГрузовоеМесто.Длина КАК Длина,
	|//	упРейсЗадания.ГрузовоеМесто.Высота КАК Высота
	|//ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
	|//ИЗ
	|//	Документ.упРейс.Задания КАК упРейсЗадания
	|//		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|//		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	|//			И (упРейсЗадания.ГрузовоеМесто <> ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	|//		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|//		ПО (&КонтрольТиповКузовов)
	|//			И упРейсЗадания.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|//
	|//ОБЪЕДИНИТЬ ВСЕ
	|//
	|//ВЫБРАТЬ РАЗЛИЧНЫЕ
	|//	ГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	|//	ГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	|//	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	|//	ГрузовыеМеста.ГрузовоеМесто.Ширина,
	|//	ГрузовыеМеста.ГрузовоеМесто.Длина,
	|//	ГрузовыеМеста.ГрузовоеМесто.Высота
	|//ИЗ
	|//	Документ.упРейс.Задания КАК упРейсЗадания
	|//		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|//		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	|//			И (упРейсЗадания.ГрузовоеМесто = ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	|//		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК ГрузовыеМеста
	|//		ПО упРейсЗадания.Задание = ГрузовыеМеста.Ссылка
	|//		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|//		ПО (&КонтрольТиповКузовов)
	|//			И упРейсЗадания.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втДанныеСовместимости.Ширина >= втДанныеСовместимости.Длина
	|					И втДанныеСовместимости.Ширина >= втДанныеСовместимости.Высота
	|				ТОГДА втДанныеСовместимости.Ширина
	|			КОГДА втДанныеСовместимости.Длина >= втДанныеСовместимости.Ширина
	|					И втДанныеСовместимости.Длина >= втДанныеСовместимости.Высота
	|				ТОГДА втДанныеСовместимости.Длина
	|			КОГДА втДанныеСовместимости.Высота >= втДанныеСовместимости.Длина
	|					И втДанныеСовместимости.Высота >= втДанныеСовместимости.Ширина
	|				ТОГДА втДанныеСовместимости.Высота
	|		КОНЕЦ) КАК МаксимальноеЗначениеГабарита
	|ПОМЕСТИТЬ втДанныеСовместимости
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	упРейсМаршрут.Адрес.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втЗоныРейсов
	|ИЗ
	|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
	|			,
	|			Рейс В
	|				(ВЫБРАТЬ
	|					втРейсы.Рейс КАК Рейс
	|				ИЗ
	|					втРейсы КАК втРейсы)) КАК упРейсМаршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО (&КонтрольДоступностиЗон)
	|			И упРейсМаршрут.Рейс = втРейсы.Рейс
	|			И (НЕ упРейсМаршрут.Отменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Задания.Задание.Отправитель.ДоступныеРесурсы КАК Правило
	|ПОМЕСТИТЬ ОбязательныеПравилаДоступностиРесурсов
	|ИЗ
	|	Документ.упРейс.Задания КАК Задания
	|ГДЕ
	|	Задания.Ссылка В(&МассивРейсов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Задания.Задание.Получатель.ДоступныеРесурсы
	|ИЗ
	|	Документ.упРейс.Задания КАК Задания
	|ГДЕ
	|	Задания.Ссылка В(&МассивРейсов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТС.ТранспортноеСредство КАК Транспорт
	|ПОМЕСТИТЬ ДоступныеТранспортыКакРесурсы
	|ИЗ
	|	ОбязательныеПравилаДоступностиРесурсов КАК ОбязательныеПравилаДоступностиРесурсов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеТС КАК ДоступныеТС
	|		ПО (ДоступныеТС.Правило = ОбязательныеПравилаДоступностиРесурсов.Правило)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеМоделиТранспорта КАК ДоступныеМоделиТранспорта
	|		ПО (ДоступныеТС.Правило = ОбязательныеПравилаДоступностиРесурсов.Правило)
	|			И (ДоступныеТС.ТранспортноеСредство.Модель = ДоступныеМоделиТранспорта.МодельТранспорта)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТС.ТранспортноеСредство
	|
	|ИМЕЮЩИЕ
	|	СУММА(1) = СУММА(ВЫБОР
	|			КОГДА НЕ ДоступныеМоделиТранспорта.МодельТранспорта ЕСТЬ NULL
	|					И НЕ ДоступныеТС.ТранспортноеСредство ЕСТЬ NULL
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.ТипКузова КАК ТипКузова
	|ПОМЕСТИТЬ втТипыКузововРейсов
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.КлассОпасности КАК КлассОпасности
	|ПОМЕСТИТЬ втКлассыОпасности
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ
	|	втДанныеСовместимости.КлассОпасности <> ЗНАЧЕНИЕ(Справочник.упКлассыОпасности.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.ТемпературныйРежим КАК ТемпературныйРежим
	|ПОМЕСТИТЬ втТемпературныеРежимы
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ
	|	втДанныеСовместимости.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упТранспортныеСредства.Ссылка КАК ТранспортноеСредство,
	|	упТранспортныеСредства.ТипТС КАК ТипТС,
	|	упТранспортныеСредства.Партнер КАК Перевозчик,
	|	упТранспортныеСредства.Высота КАК Высота,
	|	упТранспортныеСредства.Ширина КАК Ширина,
	|	упТранспортныеСредства.Длина КАК Длина,
	|	упТранспортныеСредства.Грузоподъемность КАК Грузоподъемность,
	|	упТранспортныеСредства.Объем КАК Объем,
	|	упТранспортныеСредства.КоличествоМест КАК КоличествоМест,
	|	упТранспортныеСредства.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	упТранспортныеСредства.ТемпературныйРежим КАК ТемпературныйРежим,
	|	упТранспортныеСредства.ТипКузова КАК ТипКузова,
	|	упТранспортныеСредства.ДоступныеЗоны КАК ДоступныеЗоны,
	|	упТранспортныеСредства.ПерерывМеждуРейсами КАК ПерерывМеждуРейсами,
	|	упТранспортныеСредства.ПакетНеобходимыхДокументов КАК ПакетНеобходимыхДокументов,
	|	ВЫБОР
	|		КОГДА упТранспортныеСредства.Ширина >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Ширина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Ширина
	|		КОГДА упТранспортныеСредства.Длина >= упТранспортныеСредства.Ширина
	|				И упТранспортныеСредства.Длина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Длина
	|		КОГДА упТранспортныеСредства.Высота >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Высота >= упТранспортныеСредства.Ширина
	|			ТОГДА упТранспортныеСредства.Высота
	|	КОНЕЦ КАК МаксимальноеЗначениеГабарита,
	|	втРейсы.Масса КАК МассаРейса,
	|	втРейсы.Объем КАК ОбъемРейса,
	|	втРейсы.КоличествоМест КАК КоличествоМестРейса,
	|	втРейсы.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетровРейса,
	|	втРейсы.ПлановоеНачалоВыполнения КАК ПлановоеНачалоВыполнения,
	|	втРейсы.ПлановоеОкончаниеВыполнения КАК ПлановоеОкончаниеВыполнения
	|ПОМЕСТИТЬ втТранспортныеСредстваПоРейсам
	|ИЗ
	|	Справочник.упТранспортныеСредства КАК упТранспортныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО (втРейсы.ТранспортноеСредство В (упТранспортныеСредства.Ссылка, ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)))
	|			И (НЕ &КонтрольТиповКузовов
	|				ИЛИ упТранспортныеСредства.ТипКузова = ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)
	|				ИЛИ упТранспортныеСредства.ТипКузова В
	|					(ВЫБРАТЬ
	|						втТипыКузововРейсов.ТипКузова КАК ТипКузова
	|					ИЗ
	|						втТипыКузововРейсов КАК втТипыКузововРейсов))
	|			И (втРейсы.ТипТС В (упТранспортныеСредства.ТипТС, ЗНАЧЕНИЕ(Справочник.упТипыТС.ПустаяСсылка)))
	|			И (втРейсы.Перевозчик В (упТранспортныеСредства.Партнер, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)))
	|			И (втРейсы.ПеревозкаСобственнымиТС
	|					И упТранспортныеСредства.СобственноеТранспортноеСредство
	|				ИЛИ НЕ втРейсы.ПеревозкаСобственнымиТС)
	|			И (упТранспортныеСредства.ВидТранспорта В (ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ЛегковойАвтомобиль), ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ГрузовойАвтомобиль)))
	|			И (НЕ упТранспортныеСредства.ПометкаУдаления)
	|			И НЕ упТранспортныеСредства.ВидТранспорта = ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.Контейнер)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПеревозчики КАК втПеревозчики
	|		ПО упТранспортныеСредства.Партнер = втПеревозчики.Перевозчик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упСостоянияТранспортныхСредств.СрезПоследних КАК упСостоянияТранспортныхСредствСрезПоследних
	|		ПО (упСостоянияТранспортныхСредствСрезПоследних.ТранспортноеСредство = упТранспортныеСредства.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упУчетныеПараметрыТранспортныхСредств.СрезПоследних(, ) КАК УпУчетныеПараметрыТранспортныхСредств_СрезПоследни
	|		ПО (УпУчетныеПараметрыТранспортныхСредств_СрезПоследни.ТранспортноеСредство = упТранспортныеСредства.Ссылка)
	|ГДЕ
	|	НЕ ЕСТЬNULL(упСостоянияТранспортныхСредствСрезПоследних.СостояниеТС, ЗНАЧЕНИЕ(Справочник.упСостоянияТС.Свободно)) = ЗНАЧЕНИЕ(Справочник.упСостоянияТС.Недоступно)
	|	И (втПеревозчики.Перевозчик ЕСТЬ NULL
	|				И втРейсы.ПеревозкаСобственнымиТС
	|			ИЛИ НЕ втПеревозчики.Перевозчик ЕСТЬ NULL)
	|	И (ЛОЖЬ
	|			ИЛИ НЕ упТранспортныеСредства.СобственноеТранспортноеСредство
	|			ИЛИ ЕСТЬNULL(УпУчетныеПараметрыТранспортныхСредств_СрезПоследни.ПринятоКУчету, ЛОЖЬ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТранспортныеСредстваПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втТранспортныеСредстваДляОтбораПрицепов
	|ИЗ
	|	втТранспортныеСредстваПоРейсам КАК втТранспортныеСредстваПоРейсам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упПрицепыТранспортныхСредствСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упПрицепыТранспортныхСредствСрезПоследних.Прицеп КАК Прицеп,
	|	упТранспортныеСредства.Высота КАК Высота,
	|	упТранспортныеСредства.Длина КАК Длина,
	|	упТранспортныеСредства.Ширина КАК Ширина,
	|	упТранспортныеСредства.Грузоподъемность КАК Грузоподъемность,
	|	упТранспортныеСредства.Объем КАК Объем,
	|	упТранспортныеСредства.КоличествоМест КАК КоличествоМест,
	|	упТранспортныеСредства.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	ВЫБОР
	|		КОГДА упТранспортныеСредства.Ширина >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Ширина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Ширина
	|		КОГДА упТранспортныеСредства.Длина >= упТранспортныеСредства.Ширина
	|				И упТранспортныеСредства.Длина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Длина
	|		КОГДА упТранспортныеСредства.Высота >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Высота >= упТранспортныеСредства.Ширина
	|			ТОГДА упТранспортныеСредства.Высота
	|	КОНЕЦ КАК МаксимальноеЗначениеГабарита
	|ПОМЕСТИТЬ втПрицепы
	|ИЗ
	|	РегистрСведений.упПрицепыТранспортныхСредств.СрезПоследних(
	|			&ТекущаяДата,
	|			ТранспортноеСредство В
	|				(ВЫБРАТЬ
	|					втТранспортныеСредстваДляОтбораПрицепов.ТранспортноеСредство КАК ТранспортноеСредство
	|				ИЗ
	|					втТранспортныеСредстваДляОтбораПрицепов КАК втТранспортныеСредстваДляОтбораПрицепов)) КАК упПрицепыТранспортныхСредствСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТранспортныеСредства КАК упТранспортныеСредства
	|		ПО упПрицепыТранспортныхСредствСрезПоследних.Прицеп = упТранспортныеСредства.Ссылка
	|ГДЕ
	|	упПрицепыТранспортныхСредствСрезПоследних.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Установлено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПрицепы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	СУММА(втПрицепы.Грузоподъемность) КАК Грузоподъемность,
	|	СУММА(втПрицепы.Объем) КАК Объем,
	|	СУММА(втПрицепы.КоличествоМест) КАК КоличествоМест,
	|	СУММА(втПрицепы.КоличествоЗагрузочныхМетров) КАК КоличествоЗагрузочныхМетров,
	|	МАКСИМУМ(втПрицепы.МаксимальноеЗначениеГабарита) КАК МаксимальноеЗначениеГабарита,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втПрицепы.Прицеп) КАК КоличествоПрицепов
	|ПОМЕСТИТЬ втПрицепыПоТСХарактеристики
	|ИЗ
	|	втПрицепы КАК втПрицепы
	|
	|СГРУППИРОВАТЬ ПО
	|	втПрицепы.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТСПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТСПоРейсам.ТипТС КАК ТипТС,
	|	втТСПоРейсам.Перевозчик КАК Перевозчик,
	|	втТСПоРейсам.Высота КАК Высота,
	|	втТСПоРейсам.Ширина КАК Ширина,
	|	втТСПоРейсам.Длина КАК Длина,
	|	втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0) КАК Грузоподъемность,
	|	втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0) КАК Объем,
	|	втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0) КАК КоличествоМест,
	|	втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0) КАК КоличествоЗагрузочныхМетров,
	|	втТСПоРейсам.ТемпературныйРежим КАК ТемпературныйРежим,
	|	втТСПоРейсам.ТипКузова КАК ТипКузова,
	|	втТСПоРейсам.ДоступныеЗоны КАК ДоступныеЗоны,
	|	втТСПоРейсам.ПерерывМеждуРейсами КАК ПерерывМеждуРейсами,
	|	втТСПоРейсам.ПакетНеобходимыхДокументов КАК ПакетНеобходимыхДокументов,
	|	ВЫБОР
	|		КОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита > ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|			ТОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита
	|		ИНАЧЕ ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|	КОНЕЦ КАК МаксимальноеЗначениеГабарита,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.Грузоподъемность = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.МассаРейса / (втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ГрузоподъемностьПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.Объем = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.ОбъемРейса / (втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.КоличествоМест = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.КоличествоМестРейса / (втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоМестПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.КоличествоЗагрузочныхМетров = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.КоличествоЗагрузочныхМетровРейса / (втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоПрицепов, 0) КАК КоличествоПрицепов
	|ПОМЕСТИТЬ втТСПодготовка
	|ИЗ
	|	втТранспортныеСредстваПоРейсам КАК втТСПоРейсам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПрицепыПоТСХарактеристики КАК втХарактеристикиПрицеповПоТС
	|		ПО втТСПоРейсам.ТранспортноеСредство = втХарактеристикиПрицеповПоТС.ТранспортноеСредство
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеСовместимости КАК втДанныеСовместимости
	|		ПО (НЕ &КонтрольГабаритовГрузовогоМеста
	|				ИЛИ ВЫБОР
	|					КОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита > ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|						ТОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита
	|					ИНАЧЕ ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|				КОНЕЦ = 0
	|				ИЛИ ВЫБОР
	|					КОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита > ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|						ТОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита
	|					ИНАЧЕ ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|				КОНЕЦ >= втДанныеСовместимости.МаксимальноеЗначениеГабарита)
	|ГДЕ
	|	(НЕ &КонтрольМассы
	|			ИЛИ втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0) = 0
	|			ИЛИ втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0) >= втТСПоРейсам.МассаРейса)
	|	И (НЕ &КонтрольОбъема
	|			ИЛИ втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0) = 0
	|			ИЛИ втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0) >= втТСПоРейсам.ОбъемРейса)
	|	И (НЕ &КонтрольКоличестваМест
	|			ИЛИ втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0) = 0
	|			ИЛИ втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0) >= втТСПоРейсам.КоличествоМестРейса)
	|	И (НЕ &КонтрольКоличестваЗагрузочныхМетров
	|			ИЛИ втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0) = 0
	|			ИЛИ втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0) >= втТСПоРейсам.КоличествоЗагрузочныхМетровРейса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упРасписаниеРаботыТС.Транспорт КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втНедоступныеВоВремяРейса
	|ИЗ
	|	РегистрСведений.упЗанятостьТранспорта.СрезПоследних КАК упРасписаниеРаботыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТСПодготовка КАК втТС
	|		ПО упРасписаниеРаботыТС.Транспорт = втТС.ТранспортноеСредство
	|			И (упРасписаниеРаботыТС.ПланАктуален)
	|			И (&КонтрольРасписанияРаботыТС)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО (упРасписаниеРаботыТС.ДатаНачала МЕЖДУ втРейсы.ПлановоеНачалоВыполнения И втРейсы.ПлановоеОкончаниеВыполнения
	|				ИЛИ ДОБАВИТЬКДАТЕ(упРасписаниеРаботыТС.ДатаОкончания, СЕКУНДА, втТС.ПерерывМеждуРейсами * 3600) МЕЖДУ втРейсы.ПлановоеНачалоВыполнения И втРейсы.ПлановоеОкончаниеВыполнения
	|				ИЛИ втРейсы.ПлановоеНачалоВыполнения МЕЖДУ упРасписаниеРаботыТС.ДатаНачала И ДОБАВИТЬКДАТЕ(упРасписаниеРаботыТС.ДатаОкончания, СЕКУНДА, втТС.ПерерывМеждуРейсами * 3600)
	|				ИЛИ втРейсы.ПлановоеОкончаниеВыполнения МЕЖДУ упРасписаниеРаботыТС.ДатаНачала И ДОБАВИТЬКДАТЕ(упРасписаниеРаботыТС.ДатаОкончания, СЕКУНДА, втТС.ПерерывМеждуРейсами * 3600))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упДоступныеГеографическиеЗоны.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втДоступныеЗоны
	|ИЗ
	|	втТСПодготовка КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеГеографическиеЗоны КАК упДоступныеГеографическиеЗоны
	|		ПО (&КонтрольДоступностиЗон)
	|			И втТС.ДоступныеЗоны = упДоступныеГеографическиеЗоны.ПравилаДоступности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ДопустимыеКлассыОпасныхГрузов.КлассОпасности КАК КлассОпасности
	|ПОМЕСТИТЬ втДоступныеКлассыОпасности
	|ИЗ
	|	втТСПодготовка КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТранспортныеСредства.ДопустимыеКлассыОпасныхГрузов КАК ДопустимыеКлассыОпасныхГрузов
	|		ПО (&КонтрольКлассовОпасности)
	|			И втТС.ТранспортноеСредство = ДопустимыеКлассыОпасныхГрузов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДоступныеЗоны.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втИсключитьНедоступныеЗоны
	|ИЗ
	|	втЗоныРейсов КАК втЗоныРейсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеЗоны КАК втДоступныеЗоны
	|		ПО (&КонтрольДоступностиЗон)
	|			И (НЕ (втЗоныРейсов.Зона, втДоступныеЗоны.ТранспортноеСредство) В
	|					(ВЫБРАТЬ
	|						втДоступныеЗоны.Зона КАК Зона,
	|						втДоступныеЗоны.ТранспортноеСредство КАК ТранспортноеСредство
	|					ИЗ
	|						втДоступныеЗоны КАК втДоступныеЗоны))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТС.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втИсключитьТемпературныйРежим
	|ИЗ
	|	втТемпературныеРежимы КАК втТемпературныеРежимы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТСПодготовка КАК втТС
	|		ПО (&КонтрольТемпературногоРежима)
	|			И (втТС.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка))
	|			И (НЕ(втТС.ТемпературныйРежим.ТемператураОт <= втТемпературныеРежимы.ТемпературныйРежим.ТемператураОт
	|					И втТС.ТемпературныйРежим.ТемператураДо >= втТемпературныеРежимы.ТемпературныйРежим.ТемператураДо))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДоступныеКлассыОпасности.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втИсключитьКлассыОпасности
	|ИЗ
	|	втКлассыОпасности КАК втКлассыОпасности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеКлассыОпасности КАК втДоступныеКлассыОпасности
	|		ПО (&КонтрольКлассовОпасности)
	|			И (НЕ (втКлассыОпасности.КлассОпасности, втДоступныеКлассыОпасности.ТранспортноеСредство) В
	|					(ВЫБРАТЬ
	|						втДоступныеКлассыОпасности.КлассОпасности КАК КлассОпасности,
	|						втДоступныеКлассыОпасности.ТранспортноеСредство КАК ТранспортноеСредство
	|					ИЗ
	|						втДоступныеКлассыОпасности КАК втДоступныеКлассыОпасности))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТС.ТипТС КАК ТипТС,
	|	втТС.Перевозчик КАК Перевозчик,
	|	втТС.Высота КАК Высота,
	|	втТС.Ширина КАК Ширина,
	|	втТС.Длина КАК Длина,
	|	втТС.Грузоподъемность КАК Грузоподъемность,
	|	втТС.Объем КАК Объем,
	|	втТС.КоличествоМест КАК КоличествоМест,
	|	втТС.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втТС.ТемпературныйРежим КАК ТемпературныйРежим,
	|	втТС.ТипКузова КАК ТипКузова,
	|	втТС.ДоступныеЗоны КАК ДоступныеЗоны,
	|	втТС.ГрузоподъемностьПроцентЗагрузки КАК ГрузоподъемностьПроцентЗагрузки,
	|	втТС.ОбъемПроцентЗагрузки КАК ОбъемПроцентЗагрузки,
	|	втТС.КоличествоМестПроцентЗагрузки КАК КоличествоМестПроцентЗагрузки,
	|	втТС.КоличествоЗагрузочныхМетровПроцентЗагрузки КАК КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТС.ПакетНеобходимыхДокументов КАК ПакетНеобходимыхДокументов,
	|	втТС.КоличествоПрицепов КАК КоличествоПрицепов,
	|	УпСостоянияТранспортныхСредств_СрезПоследнихТ.СостояниеТС КАК СостояниеТС
	|ПОМЕСТИТЬ втТС
	|ИЗ
	|	втТСПодготовка КАК втТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упСостоянияТранспортныхСредств.СрезПоследних(, ) КАК УпСостоянияТранспортныхСредств_СрезПоследнихТ
	|		ПО (УпСостоянияТранспортныхСредств_СрезПоследнихТ.ТранспортноеСредство = втТС.ТранспортноеСредство)
	|ГДЕ
	|	ИСТИНА
	|	И (ЛОЖЬ
	|			ИЛИ НЕ &КонтрольДоступностиТС
	|			ИЛИ втТС.ТранспортноеСредство В
	|				(ВЫБРАТЬ
	|					Т.Транспорт
	|				ИЗ
	|					ДоступныеТранспортыКакРесурсы КАК Т))
	|	И НЕ втТС.ТранспортноеСредство В
	|				(ВЫБРАТЬ
	|					втИсключитьНедоступныеЗоны.ТранспортноеСредство КАК ТранспортноеСредство
	|				ИЗ
	|					втИсключитьНедоступныеЗоны КАК втИсключитьНедоступныеЗоны)
	|	И НЕ втТС.ТранспортноеСредство В
	|				(ВЫБРАТЬ
	|					втИсключитьКлассыОпасности.ТранспортноеСредство КАК ТранспортноеСредство
	|				ИЗ
	|					втИсключитьКлассыОпасности КАК втИсключитьКлассыОпасности)
	|	И НЕ втТС.ТранспортноеСредство В
	|				(ВЫБРАТЬ
	|					втИсключитьТемпературныйРежим.ТранспортноеСредство КАК ТранспортноеСредство
	|				ИЗ
	|					втИсключитьТемпературныйРежим КАК втИсключитьТемпературныйРежим)
	|	И НЕ втТС.ТранспортноеСредство В
	|				(ВЫБРАТЬ
	|					втНедоступныеВоВремяРейса.ТранспортноеСредство КАК ТранспортноеСредство
	|				ИЗ
	|					втНедоступныеВоВремяРейса КАК втНедоступныеВоВремяРейса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПакетыДокументовТССписокДокументов.ТипДокумента КАК ТипДокумента,
	|	втТС.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втТипыНеобходимыхДокументов
	|ИЗ
	|	втТС КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упПакетыДокументовТС.СписокДокументов КАК упПакетыДокументовТССписокДокументов
	|		ПО (&КонтрольДокументов)
	|			И втТС.ПакетНеобходимыхДокументов = упПакетыДокументовТССписокДокументов.Ссылка
	|ГДЕ
	|	(упПакетыДокументовТССписокДокументов.ТипДокумента.ДокументВыдается = ЗНАЧЕНИЕ(Перечисление.упОбъектДокументовТСВодителей.ТранспортноеСредство)
	|			ИЛИ упПакетыДокументовТССписокДокументов.ТипДокумента.ДокументВыдается = ЗНАЧЕНИЕ(Перечисление.упОбъектДокументовТСВодителей.ТСВодитель))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента,
	|	тбДокументы.Регистратор КАК Регистратор,
	|	тбДокументы.ДействуетПо КАК ДействуетПо,
	|	тбДокументы.ТипДокумента.ИнтервалПредупреждения КАК ИнтервалПредупреждения,
	|	тбДокументы.ТипДокумента.СрокДействия КАК СрокДействия,
	|	тбДокументы.ТипДокумента.ПредупреждатьОбОкончанииСрокаДействия КАК ПредупреждатьОбОкончанииСрокаДействия,
	|	тбДокументы.ТипДокумента.ДокументВыдается КАК ДокументВыдается,
	|	тбДокументы.Регистратор.ДействуетС КАК ДействуетС
	|ПОМЕСТИТЬ втДействующиеДокументы
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДействующиеДокументыТСВодителей.СрезПоследних КАК тбДокументы
	|		ПО (&КонтрольДокументов)
	|			И втТипыНеобходимыхДокументов.ТипДокумента = тбДокументы.ТипДокумента
	|			И втТипыНеобходимыхДокументов.ТранспортноеСредство = тбДокументы.ТранспортноеСредство
	|ГДЕ
	|	КОНЕЦПЕРИОДА(тбДокументы.ДействуетПо, ДЕНЬ) >= &ТекущаяДата
	|	И НАЧАЛОПЕРИОДА(тбДокументы.Регистратор.ДействуетС, ДЕНЬ) <= &ТекущаяДАта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ втДокументыКоторыхНетВНаличии
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|		ПО втТипыНеобходимыхДокументов.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|			И втТипыНеобходимыхДокументов.ТипДокумента = втДействующиеДокументы.ТипДокумента
	|ГДЕ
	|	втДействующиеДокументы.ТипДокумента ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДокументыКоторыхНетВНаличии.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втТранспортныеСредстваБезПакетаДокументов
	|ИЗ
	|	втДокументыКоторыхНетВНаличии КАК втДокументыКоторыхНетВНаличии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втТранспортныеСредстваСНеобходимымПакетомДокументов
	|ИЗ
	|	втТС КАК втТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТранспортныеСредстваБезПакетаДокументов КАК втТранспортныеСредстваБезПакетаДокументов
	|		ПО (втТранспортныеСредстваБезПакетаДокументов.ТранспортноеСредство = втТС.ТранспортноеСредство)
	|ГДЕ
	|	&КонтрольДокументов
	|	И втТранспортныеСредстваБезПакетаДокументов.ТранспортноеСредство ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	Точки.Точка КАК Точка,
	|	ДоступныеЗоны.ПравилаДоступности КАК ПравилоДоступности
	|ПОМЕСТИТЬ ПравилаДоступностиТочек
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РаботыРейсов.Задание.АдресПолучения КАК Точка
	|	ИЗ
	|		РегистрСведений.упРаботыПоРейсу.СрезПоследних(
	|				,
	|				Рейс В
	|					(ВЫБРАТЬ
	|						втРейсы.Рейс КАК Рейс
	|					ИЗ
	|						втРейсы КАК втРейсы)) КАК РаботыРейсов
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		РаботыРейсов.Задание.АдресОтправления
	|	ИЗ
	|		РегистрСведений.упРаботыПоРейсу.СрезПоследних(
	|				,
	|				Рейс В
	|					(ВЫБРАТЬ
	|						втРейсы.Рейс КАК Рейс
	|					ИЗ
	|						втРейсы КАК втРейсы)) КАК РаботыРейсов) КАК Точки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеГеографическиеЗоны КАК ДоступныеЗоны
	|		ПО Точки.Точка.ГеографическаяЗона = ДоступныеЗоны.ГеографическаяЗона
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТС.ТипТС КАК ТипТС,
	|	втТС.Перевозчик КАК Перевозчик,
	|	втТС.Высота КАК Высота,
	|	втТС.Ширина КАК Ширина,
	|	втТС.Длина КАК Длина,
	|	втТС.Грузоподъемность КАК Грузоподъемность,
	|	втТС.Объем КАК Объем,
	|	втТС.КоличествоМест КАК КоличествоМест,
	|	втТС.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втТС.ТемпературныйРежим КАК ТемпературныйРежим,
	|	втТС.ТипКузова КАК ТипКузова,
	|	втТС.ДоступныеЗоны КАК ДоступныеЗоны,
	|	втТС.ГрузоподъемностьПроцентЗагрузки КАК ГрузоподъемностьПроцентЗагрузки,
	|	втТС.ОбъемПроцентЗагрузки КАК ОбъемПроцентЗагрузки,
	|	втТС.КоличествоМестПроцентЗагрузки КАК КоличествоМестПроцентЗагрузки,
	|	втТС.КоличествоЗагрузочныхМетровПроцентЗагрузки КАК КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТС.ПакетНеобходимыхДокументов КАК ПакетНеобходимыхДокументов,
	|	втТС.КоличествоПрицепов КАК КоличествоПрицепов,
	|	втТС.СостояниеТС КАК СостояниеТС
	|ПОМЕСТИТЬ втТСИтоги
	|ИЗ
	|	втТС КАК втТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеТС КАК упДоступныеТС
	|		ПО втТС.ТранспортноеСредство = упДоступныеТС.ТранспортноеСредство
	|			И втТС.Перевозчик.ДоступныеРесурсы = упДоступныеТС.Правило
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			упДоступныеМоделиТранспорта.МодельТранспорта.ТипТС КАК ТипТС,
	|			упДоступныеМоделиТранспорта.Правило КАК Правило
	|		ИЗ
	|			РегистрСведений.упДоступныеМоделиТранспорта КАК упДоступныеМоделиТранспорта) КАК упДоступныеМоделиТранспорта
	|		ПО втТС.ТипТС = упДоступныеМоделиТранспорта.ТипТС
	|		   И втТС.Перевозчик.ДоступныеРесурсы = упДоступныеМоделиТранспорта.Правило
	|ГДЕ
	|	(ЛОЖЬ
	|			ИЛИ НЕ &КонтрольДоступностиТС
	|			ИЛИ ИСТИНА
	|				И &КонтрольДоступностиТС
	|				И (ЛОЖЬ
	|					ИЛИ втТС.ТранспортноеСредство = ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)
	|					ИЛИ НЕ упДоступныеТС.Правило ЕСТЬ NULL)
	|				И НЕ упДоступныеМоделиТранспорта.Правило ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДействующиеДокументы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втДействующиеДокументы.ТипДокумента КАК ТипДокумента,
	|	втДействующиеДокументы.Регистратор КАК Регистратор,
	|	втДействующиеДокументы.ДействуетПо КАК ДействуетПо,
	|	втДействующиеДокументы.ДействуетС КАК ДействуетС,
	|	втДействующиеДокументы.ИнтервалПредупреждения КАК ИнтервалПредупреждения,
	|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия КАК ПредупреждатьОбОкончанииСрокаДействия,
	|	втДействующиеДокументы.ДокументВыдается КАК ДокументВыдается
	|ИЗ
	|	втТС КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|		ПО втТС.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|ГДЕ
	|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия
	|	И РАЗНОСТЬДАТ(&ТекущаяДата, втДействующиеДокументы.ДействуетПо, ДЕНЬ) <= втДействующиеДокументы.ИнтервалПредупреждения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втТСИтоги.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТСИтоги.ТипТС КАК ТипТС,
	|	втТСИтоги.Перевозчик КАК Перевозчик,
	|	втТСИтоги.Высота КАК Высота,
	|	втТСИтоги.Ширина КАК Ширина,
	|	втТСИтоги.Длина КАК Длина,
	|	втТСИтоги.Грузоподъемность КАК Грузоподъемность,
	|	втТСИтоги.Объем КАК Объем,
	|	втТСИтоги.КоличествоМест КАК КоличествоМест,
	|	втТСИтоги.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втТСИтоги.ТемпературныйРежим КАК ТемпературныйРежим,
	|	втТСИтоги.ТипКузова КАК ТипКузова,
	|	втТСИтоги.ДоступныеЗоны КАК ДоступныеЗоны,
	|	втТСИтоги.ГрузоподъемностьПроцентЗагрузки КАК ГрузоподъемностьПроцентЗагрузки,
	|	втТСИтоги.ОбъемПроцентЗагрузки КАК ОбъемПроцентЗагрузки,
	|	втТСИтоги.КоличествоМестПроцентЗагрузки КАК КоличествоМестПроцентЗагрузки,
	|	втТСИтоги.КоличествоЗагрузочныхМетровПроцентЗагрузки КАК КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТСИтоги.ПакетНеобходимыхДокументов КАК ПакетНеобходимыхДокументов,
	|	втТСИтоги.КоличествоПрицепов КАК КоличествоПрицепов,
	|	втТСИтоги.СостояниеТС КАК СостояниеТС,
	|	втТСИтоги.СостояниеТС.ТипСостоянияТС КАК ТипСостоянияТС,
	|	ЕСТЬNULL(упПодразделенияТранспортныхСредствСрезПоследних.Подразделение, ЗНАЧЕНИЕ(Справочник.упСтруктураПредприятия.ПустаяСсылка)) КАК Подразделение
	|ИЗ
	|	втТСИтоги КАК втТСИтоги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПодразделенияТранспортныхСредств.СрезПоследних КАК упПодразделенияТранспортныхСредствСрезПоследних
	|		ПО втТСИтоги.ТранспортноеСредство = упПодразделенияТранспортныхСредствСрезПоследних.ТранспортноеСредство
	|ГДЕ
	|	НЕ &КонтрольДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТСИтоги.ТранспортноеСредство,
	|	втТСИтоги.ТипТС,
	|	втТСИтоги.Перевозчик,
	|	втТСИтоги.Высота,
	|	втТСИтоги.Ширина,
	|	втТСИтоги.Длина,
	|	втТСИтоги.Грузоподъемность,
	|	втТСИтоги.Объем,
	|	втТСИтоги.КоличествоМест,
	|	втТСИтоги.КоличествоЗагрузочныхМетров,
	|	втТСИтоги.ТемпературныйРежим,
	|	втТСИтоги.ТипКузова,
	|	втТСИтоги.ДоступныеЗоны,
	|	втТСИтоги.ГрузоподъемностьПроцентЗагрузки,
	|	втТСИтоги.ОбъемПроцентЗагрузки,
	|	втТСИтоги.КоличествоМестПроцентЗагрузки,
	|	втТСИтоги.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТСИтоги.ПакетНеобходимыхДокументов,
	|	втТСИтоги.КоличествоПрицепов,
	|	втТСИтоги.СостояниеТС,
	|	втТСИтоги.СостояниеТС.ТипСостоянияТС,
	|	NULL
	|ИЗ
	|	втТСИтоги КАК втТСИтоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеСредстваСНеобходимымПакетомДокументов КАК втТранспортныеСредстваСНеобходимымПакетомДокументов
	|		ПО (&КонтрольДокументов)
	|			И втТСИтоги.ТранспортноеСредство = втТранспортныеСредстваСНеобходимымПакетомДокументов.ТранспортноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	втТСИтоги.Перевозчик,
	|	втТСИтоги.ГрузоподъемностьПроцентЗагрузки УБЫВ,
	|	втТСИтоги.ОбъемПроцентЗагрузки УБЫВ,
	|	втТСИтоги.КоличествоМестПроцентЗагрузки УБЫВ,
	|	втТСИтоги.КоличествоЗагрузочныхМетровПроцентЗагрузки УБЫВ
	|ИТОГИ ПО
	|	Перевозчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПрицепы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втПрицепы.Прицеп КАК Прицеп,
	|	втПрицепы.Высота КАК Высота,
	|	втПрицепы.Длина КАК Длина,
	|	втПрицепы.Ширина КАК Ширина,
	|	втПрицепы.Грузоподъемность КАК Грузоподъемность,
	|	втПрицепы.Объем КАК Объем,
	|	втПрицепы.КоличествоМест КАК КоличествоМест,
	|	втПрицепы.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	втПрицепы.МаксимальноеЗначениеГабарита КАК МаксимальноеЗначениеГабарита
	|ИЗ
	|	втПрицепы КАК втПрицепы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упРасписаниеРаботыТС.Период,
	|	упРасписаниеРаботыТС.Регистратор,
	|	упРасписаниеРаботыТС.НомерСтроки,
	|	упРасписаниеРаботыТС.Активность,
	|	упРасписаниеРаботыТС.Транспорт,
	|	упРасписаниеРаботыТС.Документ,
	|	упРасписаниеРаботыТС.ДатаОкончания,
	|	упРасписаниеРаботыТС.ДатаНачала,
	|	упРасписаниеРаботыТС.ЗонаОкончания,
	|	упРасписаниеРаботыТС.ЗонаНачала,
	|	упРасписаниеРаботыТС.СостояниеТранспорта,
	|	упРасписаниеРаботыТС.ПланАктуален,
	|	упРасписаниеРаботыТС.ФактНачала,
	|	упРасписаниеРаботыТС.ФактОкончания,
	|	втТС.ТранспортноеСредство,
	|	втТС.ТипТС,
	|	втТС.Перевозчик,
	|	втТС.Высота,
	|	втТС.Ширина,
	|	втТС.Длина,
	|	втТС.Грузоподъемность,
	|	втТС.Объем,
	|	втТС.КоличествоМест,
	|	втТС.КоличествоЗагрузочныхМетров,
	|	втТС.ТемпературныйРежим,
	|	втТС.ТипКузова,
	|	втТС.ДоступныеЗоны,
	|	втТС.ПерерывМеждуРейсами,
	|	втТС.ПакетНеобходимыхДокументов,
	|	втТС.МаксимальноеЗначениеГабарита,
	|	втТС.ГрузоподъемностьПроцентЗагрузки,
	|	втТС.ОбъемПроцентЗагрузки,
	|	втТС.КоличествоМестПроцентЗагрузки,
	|	втТС.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТС.КоличествоПрицепов
	|ИЗ
	|	РегистрСведений.упЗанятостьТранспорта.СрезПоследних КАК упРасписаниеРаботыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТСПодготовка КАК втТС
	|		ПО упРасписаниеРаботыТС.Транспорт = втТС.ТранспортноеСредство
	|			И (упРасписаниеРаботыТС.ПланАктуален)
	|			И (&КонтрольРасписанияРаботыТС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упИерархияЗон.Зона,
	|	упИерархияЗон.Родитель,
	|	упИерархияЗон.Уровень
	|ИЗ
	|	РегистрСведений.упИерархияГеографическихЗон КАК упИерархияЗон
	|ГДЕ
	|	упИерархияЗон.Зона В(&ГраничныеЗоны)
	|	И упИерархияЗон.Родитель.ИспользоватьДляУчетаМестоположений
	|";
	
КонецФункции // ПолучитьТекстЗапросаДоступныеТранспортныеСредства()

// Возвращает текст запроса по водителям.
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаВодители() Экспорт
	
	Возврат
	"
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упРейс.Ссылка КАК Рейс,
	|	упПеревозчикПоРейсуСрезПоследних.Перевозчик КАК Перевозчик,
	|	упПеревозчикПоРейсуСрезПоследних.ТипТС КАК ТипТС,
	|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство.ОсновнойВодитель КАК ОсновнойВодитель,
	|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство.ВторойОсновнойВодитель КАК ВторойОсновнойВодитель,
	|	ПлановыеПараметрыРейса.ПлановоеНачалоВыполнения КАК ПлановоеНачалоВыполнения,
	|	ПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения КАК ПлановоеОкончаниеВыполнения
	|ПОМЕСТИТЬ втРейсыОтбор
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(
	|		,
	|		Рейс В (&МассивРейсов)) КАК упПеревозчикПоРейсуСрезПоследних
	|	ПО ИСТИНА
	|		И упРейс.Ссылка = упПеревозчикПоРейсуСрезПоследних.Рейс
	|		И упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство <> ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК ПлановыеПараметрыРейса
	|	ПО упРейс.Ссылка = ПлановыеПараметрыРейса.Рейс
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсыОтбор.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упПакетыДокументовТССписокДокументов.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ втТипыНеобходимыхДокументовПоТС
	|ИЗ
	|	втРейсыОтбор КАК втРейсыОтбор
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упПакетыДокументовТС.СписокДокументов КАК упПакетыДокументовТССписокДокументов
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втРейсыОтбор.ТранспортноеСредство.ПакетНеобходимыхДокументов = упПакетыДокументовТССписокДокументов.Ссылка
	|;
	|//{Запрос: 2 ////////////////////////////////////////
	|// р566е2
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упСотрудники.Ссылка КАК Сотрудник,
	|	упСотрудники.ТипСотрудника КАК ТипСотрудника,
	|	упСотрудники.Партнер КАК Перевозчик,
	|	упСотрудники.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	упСотрудники.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ втСотрудники
	|ИЗ
	|	Справочник.упСотрудники КАК упСотрудники
	|ГДЕ ИСТИНА
	|	И (ЛОЖЬ
	|		ИЛИ НЕ (&КонтрольДоступностиВодителей)
	|		ИЛИ упСотрудники.Партнер.ДоступныеРесурсы = ЗНАЧЕНИЕ(Справочник.упПравилаДоступностиРесурсов.ПустаяСсылка))
	|	И упСотрудники.ТипСотрудника В (ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.Водитель),
	|			ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.ВодительЭкспедитор))
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	упСотрудники.Ссылка КАК Сотрудник,
	|	упСотрудники.ТипСотрудника КАК ТипСотрудника,
	|	упСотрудники.Партнер КАК Перевозчик,
	|	упСотрудники.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	упСотрудники.ГрафикРаботы КАК ГрафикРаботы
	|ИЗ
	|	Справочник.упСотрудники КАК упСотрудники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеВодители КАК упДоступныеВодители
	|	ПО ИСТИНА
	|		И &КонтрольДоступностиВодителей
	|		И упСотрудники.Партнер.ДоступныеРесурсы <> ЗНАЧЕНИЕ(Справочник.упПравилаДоступностиРесурсов.ПустаяСсылка)
	|		И упСотрудники.Партнер.ДоступныеРесурсы = упДоступныеВодители.Правило
	|		И упСотрудники.Ссылка = упДоступныеВодители.Водитель
	|		И упСотрудники.ТипСотрудника В (ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.Водитель),
	|				ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.ВодительЭкспедитор))
	|;
	|//{Запрос: 3 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиТ.ГрафикРаботы КАК ГрафикРаботы,
	|	втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	втСотрудникиТ.Перевозчик КАК Перевозчик,
	|	втСотрудникиТ.Сотрудник КАК Сотрудник,
	|	втСотрудникиТ.ТипСотрудника КАК ТипСотрудника,
	|	втРейсыОтборТ.ПлановоеНачалоВыполнения КАК ДатаНачала,
	|	втРейсыОтборТ.ПлановоеОкончаниеВыполнения КАК ДатаОкончания,
	|	НАЧАЛОПЕРИОДА(втРейсыОтборТ.ПлановоеНачалоВыполнения, ДЕНЬ) КАК НачалоДняДатаНачала,
	|	КОНЕЦПЕРИОДА(втРейсыОтборТ.ПлановоеОкончаниеВыполнения, ДЕНЬ) КАК КонецДняДатаОкончания,
	|	втРейсыОтборТ.Перевозчик КАК ПеревозчикРейса,
	|	втРейсыОтборТ.Рейс КАК Рейс,
	|	втРейсыОтборТ.ТипТС КАК ТипТС,
	|	втРейсыОтборТ.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втРейсыОтборТ.ОсновнойВодитель КАК ОсновнойВодитель,
	|	втРейсыОтборТ.ВторойОсновнойВодитель КАК ВторойОсновнойВодитель
	|ПОМЕСТИТЬ втСотрудникиРейсы
	|ИЗ
	|	втСотрудники КАК втСотрудникиТ,
	|	втРейсыОтбор КАК втРейсыОтборТ
	|;
	|//{Запрос: 4 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиТ.Сотрудник КАК Сотрудник,
	|	втСотрудникиТ.ГрафикРаботы КАК ГрафикРаботы,
	|	втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	МИНИМУМ(втСотрудникиТ.НачалоДняДатаНачала) КАК НачалоДняДатаНачала,
	|	МАКСИМУМ(втСотрудникиТ.КонецДняДатаОкончания) КАК КонецДняДатаОкончания
	|ПОМЕСТИТЬ втГрафикиРаботыПоСотрудникам
	|ИЗ
	|	втСотрудникиРейсы КАК втСотрудникиТ
	|ГДЕ &КонтрольРасписанияРаботыВодителей
	|СГРУППИРОВАТЬ ПО
	|	втСотрудникиТ.Сотрудник,
	|	втСотрудникиТ.ГрафикРаботы,
	|	втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы
	|;
	|//{Запрос: 5 ////////////////////////////////////////
	|// вап3456вс3р Определение расписания работ при помощи механизма БСП.Начало
	|ВЫБРАТЬ
	|	втСотрудникиТ.ГрафикРаботы КАК ГрафикРаботы,
	|	МИНИМУМ(втСотрудникиТ.НачалоДняДатаНачала) КАК НачалоДняДатаНачала,
	|	МАКСИМУМ(втСотрудникиТ.КонецДняДатаОкончания) КАК КонецДняДатаОкончания
	|ПОМЕСТИТЬ втГрафикиРаботы
	|ИЗ
	|	втГрафикиРаботыПоСотрудникам КАК втСотрудникиТ
	|ГДЕ ИСТИНА
	|	И &КонтрольРасписанияРаботыВодителей
	|	И НЕ (втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы)
	|СГРУППИРОВАТЬ ПО
	|	втСотрудникиТ.ГрафикРаботы
	|;
	|//{Запрос: 6 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблонЗаполнения.Ссылка КАК ГрафикРаботы,
	|	МАКСИМУМ(ШаблонЗаполнения.НомерСтроки) КАК ДлинаЦикла
	|ПОМЕСТИТЬ ВТДлинаЦиклаГрафиков
	|ИЗ
	|	Справочник.Календари.ШаблонЗаполнения КАК ШаблонЗаполнения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ШаблонЗаполнения.Ссылка = втГрафикиРаботы.ГрафикРаботы
	|СГРУППИРОВАТЬ ПО
	|	ШаблонЗаполнения.Ссылка
	|;
	|//{Запрос: 7 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПредпраздничныйДень
	|ПОМЕСТИТЬ ВТПредпраздничныеДни
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ИСТИНА
	|		И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = втГрафикиРаботы.ГрафикРаботы
	|		И ДанныеПроизводственногоКалендаря.Дата >= втГрафикиРаботы.НачалоДняДатаНачала
	|		И ДанныеПроизводственногоКалендаря.Дата <= втГрафикиРаботы.КонецДняДатаОкончания
	|		И ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|;
	|//{Запрос: 8 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаГрафика,
	|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса
	|ПОМЕСТИТЬ ВТДатыПереноса
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ИСТИНА
	|		И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = втГрафикиРаботы.ГрафикРаботы
	|		И ДанныеПроизводственногоКалендаря.Дата >= втГрафикиРаботы.НачалоДняДатаНачала
	|		И ДанныеПроизводственногоКалендаря.Дата <= втГрафикиРаботы.КонецДняДатаОкончания
	|		И ДанныеПроизводственногоКалендаря.ДатаПереноса <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|//{Запрос: 9 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалендарныеГрафики.Календарь КАК ГрафикРаботы,
	|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
	|	РАЗНОСТЬДАТ(Календари.ДатаОтсчета, КалендарныеГрафики.ДатаГрафика, ДЕНЬ) + 1 КАК ДнейОтДатыОтсчета,
	|	ПредпраздничныеДни.ПредпраздничныйДень КАК ПредпраздничныйДень,
	|	ДатыПереноса.ДатаПереноса КАК ДатаПереноса
	|ПОМЕСТИТЬ ВТДниВключенныеВГрафик
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ИСТИНА
	|		И КалендарныеГрафики.Календарь = втГрафикиРаботы.ГрафикРаботы
	|		И КалендарныеГрафики.ДатаГрафика >= втГрафикиРаботы.НачалоДняДатаНачала
	|		И КалендарныеГрафики.ДатаГрафика <= втГрафикиРаботы.КонецДняДатаОкончания
	|		И КалендарныеГрафики.ДеньВключенВГрафик
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	|	ПО Календари.Ссылка = втГрафикиРаботы.ГрафикРаботы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПредпраздничныеДни КАК ПредпраздничныеДни
	|	ПО ИСТИНА
	|		И ПредпраздничныеДни.ГрафикРаботы = КалендарныеГрафики.Календарь
	|		И ПредпраздничныеДни.ДатаГрафика = КалендарныеГрафики.ДатаГрафика
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыПереноса КАК ДатыПереноса
	|	ПО ИСТИНА
	|		И ДатыПереноса.ГрафикРаботы = КалендарныеГрафики.Календарь
	|		И ДатыПереноса.ДатаГрафика = КалендарныеГрафики.ДатаГрафика
	|;
	|//{Запрос: 10 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|	ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ДниВключенныеВГрафик.РезультатДеленияПоМодулю = 0
	|			ТОГДА ДниВключенныеВГрафик.ДлинаЦикла
	|		ИНАЧЕ ДниВключенныеВГрафик.РезультатДеленияПоМодулю
	|	КОНЕЦ КАК НомерДня,
	|	ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень
	|ПОМЕСТИТЬ ВТДатыНомераДней
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|		ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|		ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень,
	|		ДниВключенныеВГрафик.ДлинаЦикла КАК ДлинаЦикла,
	|		ДниВключенныеВГрафик.ДнейОтДатыОтсчета - ДниВключенныеВГрафик.ЦелаяЧастьРезультатаДеления * ДниВключенныеВГрафик.ДлинаЦикла КАК РезультатДеленияПоМодулю
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|			ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|			ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень,
	|			ДниВключенныеВГрафик.ДнейОтДатыОтсчета КАК ДнейОтДатыОтсчета,
	|			ДлинаЦиклов.ДлинаЦикла КАК ДлинаЦикла,
	|			(ВЫРАЗИТЬ(ДниВключенныеВГрафик.ДнейОтДатыОтсчета / ДлинаЦиклов.ДлинаЦикла КАК ЧИСЛО(15, 0))) - ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДниВключенныеВГрафик.ДнейОтДатыОтсчета / ДлинаЦиклов.ДлинаЦикла КАК ЧИСЛО(15, 0))) > ДниВключенныеВГрафик.ДнейОтДатыОтсчета / ДлинаЦиклов.ДлинаЦикла
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ КАК ЦелаяЧастьРезультатаДеления
	|		ИЗ
	|			ВТДниВключенныеВГрафик КАК ДниВключенныеВГрафик
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	|			ПО ИСТИНА
	|				И ДниВключенныеВГрафик.ГрафикРаботы = Календари.Ссылка
	|				И Календари.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияГрафикаРаботы.ПоЦикламПроизвольнойДлины)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДлинаЦиклаГрафиков КАК ДлинаЦиклов
	|			ПО ДниВключенныеВГрафик.ГрафикРаботы = ДлинаЦиклов.ГрафикРаботы) КАК ДниВключенныеВГрафик) КАК ДниВключенныеВГрафик
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|	ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ДниВключенныеВГрафик.ДатаПереноса ЕСТЬ NULL
	|			ТОГДА ДЕНЬНЕДЕЛИ(ДниВключенныеВГрафик.ДатаГрафика)
	|		ИНАЧЕ ДЕНЬНЕДЕЛИ(ДниВключенныеВГрафик.ДатаПереноса)
	|	КОНЕЦ КАК НомерДня,
	|	ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень
	|ИЗ
	|	ВТДниВключенныеВГрафик КАК ДниВключенныеВГрафик
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	|	ПО ДниВключенныеВГрафик.ГрафикРаботы = Календари.Ссылка
	|ГДЕ Календари.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияГрафикаРаботы.ПоНеделям)
	|;
	|//{Запрос: 11 ////////////////////////////////////////
	|// Определение расписания работ при помощи механизма БСП.Окончание
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|	ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|	ДниВключенныеВГрафик.НомерДня КАК НомерДня,
	|	ДОБАВИТЬКДАТЕ(ДниВключенныеВГрафик.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ЕСТЬNULL(РасписанияРаботыПредпраздничногоДня.ВремяНачала, РасписанияРаботы.ВремяНачала), СЕКУНДА)) КАК ДатаНачала,
	|	ДОБАВИТЬКДАТЕ(ДниВключенныеВГрафик.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ЕСТЬNULL(РасписанияРаботыПредпраздничногоДня.ВремяОкончания, РасписанияРаботы.ВремяОкончания), СЕКУНДА)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРасписанияРаботы
	|ИЗ
	|	ВТДатыНомераДней КАК ДниВключенныеВГрафик
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Календари.РасписаниеРаботы КАК РасписанияРаботы
	|	ПО ИСТИНА
	|		И РасписанияРаботы.Ссылка = ДниВключенныеВГрафик.ГрафикРаботы
	|		И РасписанияРаботы.НомерДня = ДниВключенныеВГрафик.НомерДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Календари.РасписаниеРаботы КАК РасписанияРаботыПредпраздничногоДня
	|	ПО ИСТИНА
	|		И РасписанияРаботыПредпраздничногоДня.Ссылка = ДниВключенныеВГрафик.ГрафикРаботы
	|		И РасписанияРаботыПредпраздничногоДня.НомерДня = 0
	|		И ДниВключенныеВГрафик.ПредпраздничныйДень
	|;
	|//{Запрос: 12 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботы.Сотрудник КАК Сотрудник,
	|	ГрафикиРаботы.Период КАК ДатаГрафика,
	|	ГрафикиРаботы.ДатаНачала КАК ДатаНачала,
	|	ГрафикиРаботы.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРасписанияРаботыИндивидуальныеГрафики
	|ИЗ
	|	РегистрСведений.упГрафикиРаботыСотрудников КАК ГрафикиРаботы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботыПоСотрудникам КАК втСотрудники
	|	ПО ИСТИНА
	|		И &КонтрольРасписанияРаботыВодителей
	|		И ГрафикиРаботы.Сотрудник = втСотрудники.Сотрудник
	|		И втСотрудники.ИспользуетсяИндивидуальныйГрафикРаботы
	|		И ГрафикиРаботы.Период <= втСотрудники.КонецДняДатаОкончания
	|		И ГрафикиРаботы.Период >= втСотрудники.НачалоДняДатаНачала
	|;
	|//{Запрос: 13 ////////////////////////////////////////
	|// вап3456вс32 Склеивание периодов по дням в непрерывные периоды.Начало
	|ВЫБРАТЬ
	|	втСотрудникиТ.Сотрудник КАК Сотрудник,
	|	ВТРасписанияРаботыТ.ДатаГрафика КАК Период,
	|	ВТРасписанияРаботыТ.ДатаНачала КАК ДатаНачала,
	|	ВТРасписанияРаботыТ.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ втПериодыРаботы
	|ИЗ
	|	втГрафикиРаботыПоСотрудникам КАК втСотрудникиТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК ВТРасписанияРаботыТ
	|	ПО ИСТИНА
	|		И ВТРасписанияРаботыТ.ГрафикРаботы = втСотрудникиТ.ГрафикРаботы
	|		И НЕ (втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.Сотрудник КАК Сотрудник,
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.ДатаГрафика КАК Период,
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.ДатаНачала КАК ДатаНачала,
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТРасписанияРаботыИндивидуальныеГрафики КАК ВТРасписанияРаботыИндивидуальныеГрафикиТ
	|;
	|//{Запрос: 14 ////////////////////////////////////////
	|// Для каждого периода определяется есть ли для него
	|// следующий(начало которого совпадает с окончанием
	|// текущего) и предыдущий(окончания которого
	|// совпадает с началом текущего)
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА втПериоды2.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПредыдущийПериодКонецРавен,
	|	// Имеется предыдущий период
	|	// Имеется следующий период
	|	ВЫБОР
	|		КОГДА втПериоды3.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СледующийПериодНачалоРавен
	|ПОМЕСТИТЬ втПериодыПодготовка
	|ИЗ
	|	втПериодыРаботы КАК втПериоды
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыРаботы КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды.Период = втПериоды2.Период
	|		И втПериоды.ДатаНачала = втПериоды2.ДатаОкончания
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыРаботы КАК втПериоды3
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды3.Сотрудник
	|		И втПериоды.Период = втПериоды3.Период
	|		И втПериоды.ДатаОкончания = втПериоды3.ДатаНачала
	|;
	|//{Запрос: 15 ////////////////////////////////////////
	|// Периоды по дням с объедененными интервалами по времени.
	|// Здесь нет периодов по которым объединять нечего.
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	МИНИМУМ(втПериоды2.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ втОбъединенныеВремена
	|ИЗ
	|	втПериодыПодготовка КАК втПериоды
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериодыПодготовка КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды.Период = втПериоды2.Период
	|		И втПериоды2.ДатаНачала > втПериоды.ДатаНачала
	|		И втПериоды.СледующийПериодНачалоРавен
	|		И втПериоды2.ПредыдущийПериодКонецРавен
	|		И НЕ (втПериоды2.СледующийПериодНачалоРавен)
	|		И НЕ (ИСТИНА
	|			И втПериоды.ПредыдущийПериодКонецРавен = ИСТИНА
	|			И втПериоды.СледующийПериодНачалоРавен = ИСТИНА)
	|СГРУППИРОВАТЬ ПО
	|	втПериоды.Сотрудник,
	|	втПериоды.Период,
	|	втПериоды.ДатаНачала
	|;
	|//{Запрос: 16 ////////////////////////////////////////
	|// Объединение периодов-дней с объединенными временными
	|// интервалами и периодов-дней по которым объединенять нечего
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ втПериодыВремена
	|ИЗ
	|	втПериодыПодготовка КАК втПериоды
	|ГДЕ ИСТИНА
	|	И втПериоды.ПредыдущийПериодКонецРавен = ЛОЖЬ
	|	И втПериоды.СледующийПериодНачалоРавен = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втОбъединенныеВремена.Сотрудник КАК Сотрудник,
	|	втОбъединенныеВремена.Период КАК Период,
	|	втОбъединенныеВремена.ДатаНачала КАК ДатаНачала,
	|	втОбъединенныеВремена.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	втОбъединенныеВремена КАК втОбъединенныеВремена
	|;
	|//{Запрос: 17 ////////////////////////////////////////
	|// Для каждого периода определяется:
	|// Оканчивается ли он в 23:59:59
	|// Длится ли он целые сутки
	|// Имеется ли следующий период, который начинается в 00:00:00 следующего дня
	|// Имеется ли предыдущий период, который оканичивается в 23:59:29 предыдущего дня
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(втПериоды.Период, ДЕНЬ) = втПериоды.ДатаОкончания
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоКонцаСуток,
	|	// Дата окончания текущего периода - 23:59:59
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(втПериоды.ДатаНачала, втПериоды.ДатаОкончания, СЕКУНДА) = 86399
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолныеСутки,
	|	// Текущий период длится сутки с 00:00:00 по 23:59:59
	|	ВЫБОР
	|		КОГДА втПериоды2.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПредыдущийПериодДоКонцаСуток,
	|	// У текущего опериода есть предыущий, оканчивающийся в 23:59 предыдущих суток
	|	// У текущего опериода есть следующий, начинающийся в 00:00 следующих суток
	|	ВЫБОР
	|		КОГДА втПериоды3.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СледующийПериодСНачалаСуток
	|ПОМЕСТИТЬ втПериоды
	|ИЗ
	|	втПериодыВремена КАК втПериоды
	|	ЛЕВОЕ СОЕДИНЕНИЕ // Периоды оканчивающиеся в 23:59 предыдущих суток
	|	втПериодыВремена КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды.ДатаНачала = втПериоды.Период
	|		И втПериоды.ДатаНачала = ДОБАВИТЬКДАТЕ(втПериоды2.ДатаОкончания, СЕКУНДА, 1)
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыВремена КАК втПериоды3
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды3.Сотрудник
	|		И ДОБАВИТЬКДАТЕ(втПериоды.ДатаОкончания, СЕКУНДА, 1) = втПериоды3.ДатаНачала
	|		// Периоды начинающиеся в 00:00 следующих суток
	|	
	|;
	|//{Запрос: 18 ////////////////////////////////////////
	|// Периоды длительностью более суток
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	МИНИМУМ(втПериоды2.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ втОбъединенныеИнтервалы
	|ИЗ
	|	втПериоды КАК втПериоды
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериоды КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды2.Период > втПериоды.Период
	|		И втПериоды.ДоКонцаСуток = ИСТИНА
	|		И втПериоды.СледующийПериодСНачалаСуток = ИСТИНА
	|		И НЕ (ИСТИНА
	|			И втПериоды.ПолныеСутки = ИСТИНА
	|			И втПериоды.ПредыдущийПериодДоКонцаСуток = ИСТИНА)
	|		И НЕ (ИСТИНА
	|			И втПериоды2.ПолныеСутки = ИСТИНА
	|			И втПериоды2.СледующийПериодСНачалаСуток = ИСТИНА)
	|СГРУППИРОВАТЬ ПО
	|	втПериоды.Сотрудник,
	|	втПериоды.ДатаНачала
	|;
	|//{Запрос: 19 ////////////////////////////////////////
	|//////////////////////////
	|// Склеивание периодов по дням в непрерывные периоды.Окончание
	|// Объединяются периоды длительностью дент и периоды
	|// длительностью более суток
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ втПериодыСотрудникаПоРасписанию
	|ИЗ
	|	втПериоды КАК втПериоды
	|ГДЕ ИСТИНА
	|	И НЕ (ИСТИНА
	|		И втПериоды.Период = втПериоды.ДатаНачала
	|		И втПериоды.ПредыдущийПериодДоКонцаСуток = ИСТИНА)
	|	И НЕ (ИСТИНА
	|		И втПериоды.ДоКонцаСуток
	|		И втПериоды.СледующийПериодСНачалаСуток = ИСТИНА)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втОбъединенныеИнтервалы.Сотрудник КАК Сотрудник,
	|	втОбъединенныеИнтервалы.ДатаНачала КАК ДатаНачала,
	|	втОбъединенныеИнтервалы.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	втОбъединенныеИнтервалы КАК втОбъединенныеИнтервалы
	|;
	|//{Запрос: 20 ////////////////////////////////////////
	|// р566е3
	|ВЫБРАТЬ
	|	Рейсы.Рейс КАК Рейс,
	|	ВТРасписанияРаботы.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ПодходящиеГрафикиРаботыПоРейсам
	|ИЗ
	|	втРейсыОтбор КАК Рейсы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|	ПО ИСТИНА
	|		И НАЧАЛОПЕРИОДА(Рейсы.ПлановоеНачалоВыполнения, ДЕНЬ) <= ВТРасписанияРаботы.ДатаГрафика
	|		И НАЧАЛОПЕРИОДА(Рейсы.ПлановоеОкончаниеВыполнения, ДЕНЬ) >= ВТРасписанияРаботы.ДатаГрафика
	|		И &КонтрольРасписанияРаботыВодителей
	|СГРУППИРОВАТЬ ПО
	|	Рейсы.Рейс,
	|	ВТРасписанияРаботы.ГрафикРаботы
	|ИМЕЮЩИЕ КОЛИЧЕСТВО(*) - 1 = РАЗНОСТЬДАТ(МАКСИМУМ(Рейсы.ПлановоеНачалоВыполнения), МАКСИМУМ(Рейсы.ПлановоеОкончаниеВыполнения), ДЕНЬ)
	|;
	|//{Запрос: 22 ////////////////////////////////////////
	|// р566е4
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСотрудникиРейсы.Сотрудник КАК Сотрудник,
	|	втСотрудникиРейсы.ТипСотрудника КАК ТипСотрудника,
	|	втСотрудникиРейсы.Перевозчик КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА втСотрудникиРейсы.Сотрудник = втСотрудникиРейсы.ОсновнойВодитель
	|			ТОГДА - 1
	|		КОГДА втСотрудникиРейсы.Сотрудник = втСотрудникиРейсы.ВторойОсновнойВодитель
	|			ТОГДА 0
	|		КОГДА втСотрудникиРейсы.Перевозчик = втСотрудникиРейсы.Перевозчик
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок,
	|	втСотрудникиРейсы.ТипТС КАК ТипТС,
	|	втСотрудникиРейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втСотрудникиРейсы.Рейс КАК Рейс
	|ПОМЕСТИТЬ втСотрудникиПоРейсам
	|ИЗ
	|	втСотрудникиРейсы КАК втСотрудникиРейсы
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыСотрудникаПоРасписанию КАК втПериодыСотрудникаПоРасписанию
	|	ПО ИСТИНА
	|		И &КонтрольРасписанияРаботыВодителей
	|		И втПериодыСотрудникаПоРасписанию.Сотрудник = втСотрудникиРейсы.Сотрудник
	|		И втСотрудникиРейсы.ДатаНачала <= втПериодыСотрудникаПоРасписанию.ДатаОкончания
	|		И втСотрудникиРейсы.ДатаОкончания >= втПериодыСотрудникаПоРасписанию.ДатаНачала
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упРасписаниеРаботыЭкипажей КАК упРасписаниеРаботыВодителейТ
	|	ПО ИСТИНА
	|		И втСотрудникиРейсы.Сотрудник = упРасписаниеРаботыВодителейТ.Водитель
	|		И (ЛОЖЬ
	|			ИЛИ (ИСТИНА
	|				И втСотрудникиРейсы.ДатаНачала <= упРасписаниеРаботыВодителейТ.ДатаНачала
	|				И втСотрудникиРейсы.ДатаОкончания >= упРасписаниеРаботыВодителейТ.ДатаНачала)
	|			ИЛИ (ИСТИНА
	|				И втСотрудникиРейсы.ДатаНачала <= упРасписаниеРаботыВодителейТ.ДатаОкончания
	|				И втСотрудникиРейсы.ДатаОкончания >= упРасписаниеРаботыВодителейТ.ДатаОкончания)
	|			ИЛИ (ИСТИНА
	|				И втСотрудникиРейсы.ДатаНачала >= упРасписаниеРаботыВодителейТ.ДатаНачала
	|				И втСотрудникиРейсы.ДатаОкончания <= упРасписаниеРаботыВодителейТ.ДатаОкончания))
	|ГДЕ ИСТИНА
	|	И упРасписаниеРаботыВодителейТ.Водитель ЕСТЬ NULL
	|	И (ЛОЖЬ
	|		ИЛИ НЕ (&КонтрольРасписанияРаботыВодителей)
	|		ИЛИ НЕ (втПериодыСотрудникаПоРасписанию.Сотрудник ЕСТЬ NULL))
	|;
	|//{Запрос: 23 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиПоТС.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ втТипыНеобходимыхДокументов
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТипыНеобходимыхДокументовПоТС КАК втТипыНеобходимыхДокументов
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втСотрудникиПоТС.ТранспортноеСредство = втТипыНеобходимыхДокументов.ТранспортноеСредство
	|;
	|//{Запрос: 24 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втТипыНеобходимыхДокументов.Сотрудник КАК Сотрудник,
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента,
	|	тбДокументы.Регистратор КАК Регистратор,
	|	тбДокументы.ДействуетПо КАК ДействуетПо,
	|	тбДокументы.ТипДокумента.ИнтервалПредупреждения КАК ИнтервалПредупреждения,
	|	тбДокументы.ТипДокумента.СрокДействия КАК СрокДействия,
	|	тбДокументы.ТипДокумента.ПредупреждатьОбОкончанииСрокаДействия КАК ПредупреждатьОбОкончанииСрокаДействия,
	|	тбДокументы.ТипДокумента.ДокументВыдается КАК ДокументВыдается,
	|	тбДокументы.Регистратор.ДействуетС КАК ДействуетС
	|ПОМЕСТИТЬ втДействующиеДокументы
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДействующиеДокументыТСВодителей.СрезПоследних КАК тбДокументы
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втТипыНеобходимыхДокументов.ТипДокумента = тбДокументы.ТипДокумента
	|		И (ЛОЖЬ
	|			ИЛИ втТипыНеобходимыхДокументов.ТранспортноеСредство = тбДокументы.ТранспортноеСредство
	|			ИЛИ втТипыНеобходимыхДокументов.Сотрудник = тбДокументы.Водитель)
	|ГДЕ ИСТИНА
	|	И КОНЕЦПЕРИОДА(тбДокументы.ДействуетПо, ДЕНЬ) >= &ТекущаяДата
	|	И НАЧАЛОПЕРИОДА(тбДокументы.Регистратор.ДействуетС, ДЕНЬ) <= &ТекущаяДАта
	|;
	|//{Запрос: 25 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыНеобходимыхДокументов.Сотрудник КАК Сотрудник,
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ втДокументыКоторыхНетВНаличии
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|	ЛЕВОЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|	ПО ИСТИНА
	|		И втТипыНеобходимыхДокументов.Сотрудник = втДействующиеДокументы.Сотрудник
	|		И втТипыНеобходимыхДокументов.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|		И втТипыНеобходимыхДокументов.ТипДокумента = втДействующиеДокументы.ТипДокумента
	|ГДЕ втДействующиеДокументы.ТипДокумента ЕСТЬ NULL
	|;
	|//{Запрос: 26 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСотрудникиПоРейсам.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втСотрудникиПоТС
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоРейсам
	|;
	|//{Запрос: 27 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДокументыКоторыхНетВНаличии.Сотрудник КАК Сотрудник,
	|	втДокументыКоторыхНетВНаличии.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втСотрудникиТранспортныеСредстваБезПакетаДокументов
	|ИЗ
	|	втДокументыКоторыхНетВНаличии КАК втДокументыКоторыхНетВНаличии
	|;
	|//{Запрос: 28 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиПоТС.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоТС.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втСотрудникиСНеобходимымПакетомДокументов
	|ИЗ
	|	втСотрудникиПоТС КАК втСотрудникиПоТС
	|	ЛЕВОЕ СОЕДИНЕНИЕ втСотрудникиТранспортныеСредстваБезПакетаДокументов КАК втСотрудникиТранспортныеСредстваБезПакетаДокументов
	|	ПО ИСТИНА
	|		И втСотрудникиПоТС.Сотрудник = втСотрудникиТранспортныеСредстваБезПакетаДокументов.Сотрудник
	|		И втСотрудникиПоТС.ТранспортноеСредство = втСотрудникиТранспортныеСредстваБезПакетаДокументов.ТранспортноеСредство
	|ГДЕ ИСТИНА
	|	И &КонтрольДокументов
	|	И втСотрудникиТранспортныеСредстваБезПакетаДокументов.Сотрудник ЕСТЬ NULL
	|;
	|//{Запрос: 29 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДействующиеДокументы.Сотрудник КАК Сотрудник,
	|	втДействующиеДокументы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втДействующиеДокументы.ТипДокумента КАК ТипДокумента,
	|	втДействующиеДокументы.Регистратор КАК Регистратор,
	|	втДействующиеДокументы.ДействуетПо КАК ДействуетПо,
	|	втДействующиеДокументы.ДействуетС КАК ДействуетС,
	|	втДействующиеДокументы.ИнтервалПредупреждения КАК ИнтервалПредупреждения,
	|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия КАК ПредупреждатьОбОкончанииСрокаДействия,
	|	втДействующиеДокументы.ДокументВыдается КАК ДокументВыдается
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|	ПО ИСТИНА
	|		И втСотрудникиПоТС.Сотрудник = втДействующиеДокументы.Сотрудник
	|		И втСотрудникиПоТС.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|ГДЕ ИСТИНА
	|	И втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия
	|	И РАЗНОСТЬДАТ(&ТекущаяДата, втДействующиеДокументы.ДействуетПо, ДЕНЬ) <= втДействующиеДокументы.ИнтервалПредупреждения
	|;
	|//{Запрос: 30 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиПоРейсам.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоРейсам.ТипСотрудника КАК ТипСотрудника,
	|	втСотрудникиПоРейсам.Перевозчик КАК Перевозчик,
	|	втСотрудникиПоРейсам.Порядок КАК Порядок,
	|	втСотрудникиПоРейсам.Рейс КАК Рейс,
	|	втСотрудникиПоРейсам.ТипТС КАК ТипТС,
	|	втСотрудникиПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоРейсам
	|ГДЕ НЕ (&КонтрольДокументов)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втСотрудникиПоРейсам.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоРейсам.ТипСотрудника КАК ТипСотрудника,
	|	втСотрудникиПоРейсам.Перевозчик КАК Перевозчик,
	|	втСотрудникиПоРейсам.Порядок КАК Порядок,
	|	втСотрудникиПоРейсам.Рейс КАК Рейс,
	|	втСотрудникиПоРейсам.ТипТС КАК ТипТС,
	|	втСотрудникиПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоРейсам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудникиСНеобходимымПакетомДокументов КАК втСотрудникиСНеобходимымПакетомДокументов
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втСотрудникиПоРейсам.Сотрудник = втСотрудникиСНеобходимымПакетомДокументов.Сотрудник
	|		И втСотрудникиПоРейсам.ТранспортноеСредство = втСотрудникиСНеобходимымПакетомДокументов.ТранспортноеСредство
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Сотрудник
	|ИТОГИ
	|ПО
	|	Перевозчик
	|";

КонецФункции // ПолучитьТекстЗапросаВодители()

// Возвращает строку с серией и номером водительского удостоверения.
//
// Параметры:
//  ДокументТранспортногоСредстваВодителя - СправочникСсылка- Ссылкам на элементы,
//            СправочникСсылка.упДокументТранспортногоСредстваВодителяПрисоединенныеФайлы.
//  Дата - Дата - Период.
//  Водитель - СправочникСсылка.упСотрудники - Ссылка на элемент.
//
// Возвращаемое значение:
//   Строка - Строковое представление документа.
//
Функция ПолучитьСериюНомерВодительскогоУдостоверения(ДокументТранспортногоСредстваВодителя = Неопределено, Дата, Водитель) Экспорт
	
	текСерия = "";
	текНомер = "";
	
	Если ЗначениеЗаполнено(ДокументТранспортногоСредстваВодителя) Тогда
		
		сткРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументТранспортногоСредстваВодителя, "Серия, Номер");
		текСерия		= сткРеквизиты.Серия;
		текНомер		= сткРеквизиты.Номер;
	
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(упДействующиеДокументыТСВодителейСрезПоследних.Регистратор КАК Документ.упДокументТранспортногоСредстваВодителя).Серия КАК Серия,
		               |	ВЫРАЗИТЬ(упДействующиеДокументыТСВодителейСрезПоследних.Регистратор КАК Документ.упДокументТранспортногоСредстваВодителя).Номер КАК Номер
		               |ИЗ
		               |	РегистрСведений.упДействующиеДокументыТСВодителей.СрезПоследних(
		               |			&ТекущаяДата,
		               |			ТипДокумента = ЗНАЧЕНИЕ(Справочник.упТипыДокументовТСВодителей.ВодительскоеУдостоверение)
		               |				И Водитель = &Водитель) КАК упДействующиеДокументыТСВодителейСрезПоследних
		               |ГДЕ
		               |	КОНЕЦПЕРИОДА(упДействующиеДокументыТСВодителейСрезПоследних.ДействуетПо, ДЕНЬ) >= &ТекущаяДата";
		Запрос.УстановитьПараметр("ТекущаяДата", 	Дата);
		Запрос.УстановитьПараметр("Водитель", 		Водитель);
		текВыборка	= Запрос.Выполнить().Выбрать();
		Если текВыборка.Следующий() Тогда
			текСерия = текВыборка.Серия;
			текНомер = текВыборка.Номер;
		КонецЕсли;
			
	КонецЕсли;
		
	текРезультат = Нстр("ru = '%1 %2'");
	текРезультат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(текРезультат, текСерия, текНомер);
		
	Возврат текРезультат;
		
КонецФункции

// Соотвествие состояния транспортных средств цветам.
//
// Возвращаемое значение:
//   Соответствие - Результат выполнения.
//
Функция СоответствиеТиповСостоянийТСЦветам() Экспорт 
	
	Результат = Новый Соответствие;
	Результат.Вставить(Перечисления.упТипыСостоянийТС.Недоступно, WebЦвета.Красный);
	Результат.Вставить(Перечисления.упТипыСостоянийТС.Ремонт, WebЦвета.Серый);
	Результат.Вставить(Перечисления.упТипыСостоянийТС.ВРейсе, WebЦвета.Голубой);
	Результат.Вставить(Перечисления.упТипыСостоянийТС.Свободно, Новый Цвет(200,255,200));
	Результат.Вставить("Reserve", WebЦвета.СинийСПороховымОттенком);
	Результат.Вставить(Перечисления.упТипыСостоянийТС.ПустаяСсылка(), WebЦвета.Циан);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

// Возвращает текст запроса Автоматического назначения ТипаТС.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаАвтоматическоеНазначениеТипыТС()
	
	Возврат 
	"ВЫБРАТЬ
	|	упРейс.Ссылка КАК Рейс,
	|	упРейс.Организация,
	|	упРейс.ВидПеревозки,
	|	упРейс.Организация.Партнер КАК СобственныйПеревозчик,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.Перевозчик, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)) КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА упПеревозчикПоРейсуСрезПоследних.Перевозчик ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ упПеревозчикПоРейсуСрезПоследних.Перевозчик.РейтингПеревозчика
	|	КОНЕЦ КАК РейтингПеревозчика,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТипТС, ЗНАЧЕНИЕ(Справочник.упТипыТС.ПустаяСсылка)) КАК ТипТС,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство, ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)) КАК ТранспортноеСредство,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Масса, 0) КАК Масса,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоЗагрузочныхМетров, 0) КАК КоличествоЗагрузочныхМетров
	|ПОМЕСТИТЬ втРейсы
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	|		ПО упРейс.Ссылка = упПлановыеПараметрыРейса.Рейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(, Рейс В (&МассивРейсов)) КАК упПеревозчикПоРейсуСрезПоследних
	|		ПО упРейс.Ссылка = упПеревозчикПоРейсуСрезПоследних.Рейс
	|ГДЕ
	|	упРейс.Ссылка В(&МассивРейсов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсы.Рейс,
	|	втРейсы.Организация,
	|	упВидыПеревозок.ВыборПеревозчика КАК ВариантВыбораПеревозчика,
	|	упВидыПеревозок.Перевозчик,
	|	ВЫБОР
	|		КОГДА упВидыПеревозок.Перевозчик.Перевозчик
	|			ТОГДА упВидыПеревозок.Перевозчик.РейтингПеревозчика
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РейтингПеревозчика
	|ПОМЕСТИТЬ втВидыПеревозок
	|ИЗ
	|	Справочник.упВидыПеревозок КАК упВидыПеревозок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО упВидыПеревозок.Ссылка = втРейсы.ВидПеревозки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВидыПеревозок.Рейс,
	|	упПартнеры.Ссылка КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА упПартнеры.Перевозчик
	|			ТОГДА упПартнеры.РейтингПеревозчика
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РейтингПеревозчика
	|ПОМЕСТИТЬ втПеревозчики
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаСобственнымиТС))
	|			И упПартнеры.Организация = втВидыПеревозок.Организация
	|			И (упПартнеры.Перевозчик)
	|			И (НЕ упПартнеры.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втВидыПеревозок.Рейс,
	|	втВидыПеревозок.Перевозчик,
	|	втВидыПеревозок.РейтингПеревозчика
	|ИЗ
	|	втВидыПеревозок КАК втВидыПеревозок
	|ГДЕ
	|	втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаОпределеннымПеревозчиком)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втВидыПеревозок.Рейс,
	|	упПартнеры.Ссылка,
	|	ВЫБОР
	|		КОГДА упПартнеры.Перевозчик
	|			ТОГДА упПартнеры.РейтингПеревозчика
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (упПартнеры.Перевозчик)
	|			И (НЕ упПартнеры.ПометкаУдаления)
	|			И (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	втРейсы.Рейс,
|	упРейсЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
|	упРейсЗадания.Задание,
|	упРейсЗадания.ГрузовоеМесто,
|	втРейсы.ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах КАК ПараметрыВводаИнформацииОГрузовыхМестах
|ПОМЕСТИТЬ втЗаданияРейса
|ИЗ
|	Документ.упРейс.Задания КАК упРейсЗадания
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
|		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗРЕШЕННЫЕ
|	втРейсы.Рейс,
|	втРейсы.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
|	втРейсы.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)) КАК Ширина, 
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)) КАК Длина, 
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0)) КАК Высота 
|ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
|ИЗ
|	втЗаданияРейса КАК втРейсы
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
|				,
|				ЗаявкаНаПеревозку В
|					(ВЫБРАТЬ
|						втЗадания.ЗаявкаНаПеревозкуГруза
|					ИЗ
|						втЗаданияРейса КАК втЗадания
|					ГДЕ
|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
|		ПО втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
|			И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
|				,
|				ЗаданиеНаПеревозку В
|					(ВЫБРАТЬ
|						втЗадания.Задание
|					ИЗ
|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
|		ПО втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
|			И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто

|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
|		ПО (&КонтрольТиповКузовов)
|			И втРейсы.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
|ГДЕ
|	втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах В (ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку), 
|ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса))
|
|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	втРейсы.Рейс,
|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)), 
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)), 
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0))
|ИЗ
|	втЗаданияРейса КАК втРейсы
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
|		ПО втРейсы.Задание = упГрузовыеМеста.Ссылка
|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
|				,
|				ЗаявкаНаПеревозку В
|					(ВЫБРАТЬ
|						втЗадания.ЗаявкаНаПеревозкуГруза
|					ИЗ
|						втЗаданияРейса КАК втЗадания
|					ГДЕ
|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
|		ПО упГрузовыеМеста.Ссылка.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
|			И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
|				,
|				ЗаданиеНаПеревозку В
|					(ВЫБРАТЬ
|						втЗадания.Задание
|					ИЗ
|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
|		ПО упГрузовыеМеста.Ссылка = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
|			И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
|		ПО (&КонтрольТиповКузовов)
|			И (упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)

|ОБЪЕДИНИТЬ ВСЕ
|
|ВЫБРАТЬ
|	втРейсы.Рейс,
|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)), 
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)), 
|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0))
|ИЗ
|	втЗаданияРейса КАК втРейсы
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
|		ПО втРейсы.Задание = упГрузовыеМеста.Ссылка
|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится)
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
|				,
|				ЗаявкаНаПеревозку В
|					(ВЫБРАТЬ
|						втЗадания.ЗаявкаНаПеревозкуГруза
|					ИЗ
|						втЗаданияРейса КАК втЗадания
|					ГДЕ
|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
|		ПО втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
|			И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
|				,
|				ЗаданиеНаПеревозку В
|					(ВЫБРАТЬ
|						втЗадания.Задание
|					ИЗ
|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
|		ПО втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
|			И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
|		ПО (&КонтрольТиповКузовов)
|			И (упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)

	
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	втРейсы.Рейс,
	//|	упРейсЗадания.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	//|	упРейсЗадания.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	//|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	//|	упРейсЗадания.ГрузовоеМесто.Ширина КАК Ширина,
	//|	упРейсЗадания.ГрузовоеМесто.Длина КАК Длина,
	//|	упРейсЗадания.ГрузовоеМесто.Высота КАК Высота
	//|ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
	//|ИЗ
	//|	Документ.упРейс.Задания КАК упРейсЗадания
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	//|		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	//|			И (упРейсЗадания.ГрузовоеМесто <> ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	//|		ПО (&КонтрольТиповКузовов)
	//|			И упРейсЗадания.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	втРейсы.Рейс,
	//|	ГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	//|	ГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	//|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	//|	ГрузовыеМеста.ГрузовоеМесто.Ширина,
	//|	ГрузовыеМеста.ГрузовоеМесто.Длина,
	//|	ГрузовыеМеста.ГрузовоеМесто.Высота
	//|ИЗ
	//|	Документ.упРейс.Задания КАК упРейсЗадания
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	//|		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	//|			И (упРейсЗадания.ГрузовоеМесто = ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК ГрузовыеМеста
	//|		ПО упРейсЗадания.Задание = ГрузовыеМеста.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	//|		ПО (&КонтрольТиповКузовов)
	//|			И (ГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеСовместимости.Рейс,
	|	втРейсы.СобственныйПеревозчик,
	|	втРейсы.Перевозчик,
	|	втРейсы.РейтингПеревозчика,
	|	втРейсы.Масса,
	|	втРейсы.Объем,
	|	втРейсы.КоличествоМест,
	|	втРейсы.КоличествоЗагрузочныхМетров,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втДанныеСовместимости.Ширина >= втДанныеСовместимости.Длина
	|					И втДанныеСовместимости.Ширина >= втДанныеСовместимости.Высота
	|				ТОГДА втДанныеСовместимости.Ширина
	|			КОГДА втДанныеСовместимости.Длина >= втДанныеСовместимости.Ширина
	|					И втДанныеСовместимости.Длина >= втДанныеСовместимости.Высота
	|				ТОГДА втДанныеСовместимости.Длина
	|			КОГДА втДанныеСовместимости.Высота >= втДанныеСовместимости.Длина
	|					И втДанныеСовместимости.Высота >= втДанныеСовместимости.Ширина
	|				ТОГДА втДанныеСовместимости.Высота
	|		КОНЕЦ) КАК МаксимальноеЗначениеГабарита
	|ПОМЕСТИТЬ втДанныеСовместимости
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО втДанныеСовместимости.Рейс = втРейсы.Рейс
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанныеСовместимости.Рейс,
	|	втРейсы.СобственныйПеревозчик,
	|	втРейсы.Перевозчик,
	|	втРейсы.Масса,
	|	втРейсы.Объем,
	|	втРейсы.КоличествоМест,
	|	втРейсы.КоличествоЗагрузочныхМетров,
	|	втРейсы.РейтингПеревозчика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.ТипКузова
	|ПОМЕСТИТЬ втТипыКузововРейсов
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втРейсы.Рейс,
	|	упРейсМаршрут.Адрес.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втЗоныРейсов
	|ИЗ
	|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
	|			,
	|			Рейс В
	|				(ВЫБРАТЬ
	|					втРейсы.Рейс
	|				ИЗ
	|					втРейсы)) КАК упРейсМаршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО (&КонтрольДоступностиЗон)
	|			И упРейсМаршрут.Рейс = втРейсы.Рейс
	|			И (НЕ упРейсМаршрут.Отменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.КлассОпасности
	|ПОМЕСТИТЬ втКлассыОпасности
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ
	|	втДанныеСовместимости.КлассОпасности <> ЗНАЧЕНИЕ(Справочник.упКлассыОпасности.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.ТемпературныйРежим
	|ПОМЕСТИТЬ втТемпературныеРежимы
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ
	|	втДанныеСовместимости.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.СобственныйПеревозчик,
	|	втДанныеСовместимости.Перевозчик,
	|	втДанныеСовместимости.РейтингПеревозчика,
	|	упТипыТС.Ссылка КАК ТипТС,
	|	упТипыТС.Высота,
	|	упТипыТС.Ширина,
	|	упТипыТС.Длина,
	|	упТипыТС.Грузоподъемность,
	|	упТипыТС.Объем,
	|	упТипыТС.КоличествоМест,
	|	упТипыТС.КоличествоЗагрузочныхМетров,
	|	упТипыТС.ТемпературныйРежим,
	|	упТипыТС.ТипКузова,
	|	упТипыТС.ДоступныеЗоны,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.Грузоподъемность = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.Масса / упТипыТС.Грузоподъемность * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ГрузоподъемностьПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.Объем = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.Объем / упТипыТС.Объем * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.КоличествоМест = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.КоличествоМест / упТипыТС.КоличествоМест * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоМестПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ упТипыТС.КоличествоЗагрузочныхМетров = 0
	|			ТОГДА ВЫРАЗИТЬ(втДанныеСовместимости.КоличествоЗагрузочныхМетров / упТипыТС.КоличествоЗагрузочныхМетров * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗагрузочныхМетровПроцентЗагрузки
	|ПОМЕСТИТЬ втТипыТСПодготовка
	|ИЗ
	|	Справочник.упТипыТС КАК упТипыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеСовместимости КАК втДанныеСовместимости
	|		ПО (НЕ &КонтрольМассы
	|				ИЛИ упТипыТС.Грузоподъемность = 0
	|				ИЛИ упТипыТС.Грузоподъемность >= втДанныеСовместимости.Масса)
	|			И (НЕ &КонтрольОбъема
	|				ИЛИ упТипыТС.Объем = 0
	|				ИЛИ упТипыТС.Объем >= втДанныеСовместимости.Объем)
	|			И (НЕ &КонтрольКоличестваМест
	|				ИЛИ упТипыТС.КоличествоМест = 0
	|				ИЛИ упТипыТС.КоличествоМест >= втДанныеСовместимости.КоличествоМест)
	|			И (НЕ &КонтрольКоличестваЗагрузочныхМетров
	|				ИЛИ упТипыТС.КоличествоЗагрузочныхМетров = 0
	|				ИЛИ упТипыТС.КоличествоЗагрузочныхМетров >= втДанныеСовместимости.КоличествоЗагрузочныхМетров)
	|			И (НЕ &КонтрольГабаритовГрузовогоМеста
	|				ИЛИ ВЫБОР
	|					КОГДА упТипыТС.Ширина >= упТипыТС.Длина
	|							И упТипыТС.Ширина >= упТипыТС.Высота
	|						ТОГДА упТипыТС.Ширина
	|					КОГДА упТипыТС.Длина >= упТипыТС.Ширина
	|							И упТипыТС.Длина >= упТипыТС.Высота
	|						ТОГДА упТипыТС.Длина
	|					КОГДА упТипыТС.Высота >= упТипыТС.Длина
	|							И упТипыТС.Высота >= упТипыТС.Ширина
	|						ТОГДА упТипыТС.Высота
	|				КОНЕЦ = 0
	|				ИЛИ ВЫБОР
	|					КОГДА упТипыТС.Ширина >= упТипыТС.Длина
	|							И упТипыТС.Ширина >= упТипыТС.Высота
	|						ТОГДА упТипыТС.Ширина
	|					КОГДА упТипыТС.Длина >= упТипыТС.Ширина
	|							И упТипыТС.Длина >= упТипыТС.Высота
	|						ТОГДА упТипыТС.Длина
	|					КОГДА упТипыТС.Высота >= упТипыТС.Длина
	|							И упТипыТС.Высота >= упТипыТС.Ширина
	|						ТОГДА упТипыТС.Высота
	|				КОНЕЦ >= втДанныеСовместимости.МаксимальноеЗначениеГабарита)
	|			И (НЕ &КонтрольТиповКузовов
	|				ИЛИ упТипыТС.ТипКузова = ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)
	|				ИЛИ (упТипыТС.ТипКузова, втДанныеСовместимости.Рейс) В
	|					(ВЫБРАТЬ
	|						втТипыКузововРейсов.ТипКузова,
	|						втТипыКузововРейсов.Рейс
	|					ИЗ
	|						втТипыКузововРейсов))
	|			И (упТипыТС.ВидТранспорта В (ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ЛегковойАвтомобиль), ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ГрузовойАвтомобиль)))
	|			И (НЕ упТипыТС.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТипыТС.ТипТС,
	|	упДоступныеГеографическиеЗоны.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втДоступныеЗоны
	|ИЗ
	|	втТипыТСПодготовка КАК втТипыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеГеографическиеЗоны КАК упДоступныеГеографическиеЗоны
	|		ПО (&КонтрольДоступностиЗон)
	|			И втТипыТС.ДоступныеЗоны = упДоступныеГеографическиеЗоны.ПравилаДоступности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТипыТС.ТипТС,
	|	ДопустимыеКлассыОпасныхГрузов.КлассОпасности
	|ПОМЕСТИТЬ втДоступныеКлассыОпасности
	|ИЗ
	|	втТипыТСПодготовка КАК втТипыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТипыТС.ДопустимыеКлассыОпасныхГрузов КАК ДопустимыеКлассыОпасныхГрузов
	|		ПО (&КонтрольКлассовОпасности)
	|			И втТипыТС.ТипТС = ДопустимыеКлассыОпасныхГрузов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втЗоныРейсов.Рейс,
	|	втДоступныеЗоны.ТипТС
	|ПОМЕСТИТЬ втИсключитьНедоступныеЗоны
	|ИЗ
	|	втЗоныРейсов КАК втЗоныРейсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеЗоны КАК втДоступныеЗоны
	|		ПО (&КонтрольДоступностиЗон)
	|			И (НЕ (втЗоныРейсов.Зона, втДоступныеЗоны.ТипТС) В
	|					(ВЫБРАТЬ
	|						втДоступныеЗоны.Зона,
	|						втДоступныеЗоны.ТипТС
	|					ИЗ
	|						втДоступныеЗоны))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТипыТС.Рейс,
	|	втТипыТС.ТипТС
	|ПОМЕСТИТЬ втИсключитьТемпературныйРежим
	|ИЗ
	|	втТемпературныеРежимы КАК втТемпературныеРежимы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТипыТСПодготовка КАК втТипыТС
	|		ПО (&КонтрольТемпературногоРежима)
	|			И втТемпературныеРежимы.Рейс = втТипыТС.Рейс
	|			И (втТипыТС.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка))
	|			И (НЕ(втТипыТС.ТемпературныйРежим.ТемператураОт <= втТемпературныеРежимы.ТемпературныйРежим.ТемператураОт
	|					И втТипыТС.ТемпературныйРежим.ТемператураДо >= втТемпературныеРежимы.ТемпературныйРежим.ТемператураДо))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втКлассыОпасности.Рейс,
	|	втДоступныеКлассыОпасности.ТипТС
	|ПОМЕСТИТЬ втИсключитьКлассыОпасности
	|ИЗ
	|	втКлассыОпасности КАК втКлассыОпасности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеКлассыОпасности КАК втДоступныеКлассыОпасности
	|		ПО (&КонтрольКлассовОпасности)
	|			И (НЕ (втКлассыОпасности.КлассОпасности, втДоступныеКлассыОпасности.ТипТС) В
	|					(ВЫБРАТЬ
	|						втДоступныеКлассыОпасности.КлассОпасности,
	|						втДоступныеКлассыОпасности.ТипТС
	|					ИЗ
	|						втДоступныеКлассыОпасности))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыТС.Рейс,
	|	втТипыТС.СобственныйПеревозчик,
	|	втТипыТС.Перевозчик,
	|	втТипыТС.РейтингПеревозчика,
	|	втТипыТС.ТипТС,
	|	втТипыТС.Высота,
	|	втТипыТС.Ширина,
	|	втТипыТС.Длина,
	|	втТипыТС.Грузоподъемность,
	|	втТипыТС.Объем,
	|	втТипыТС.КоличествоМест,
	|	втТипыТС.КоличествоЗагрузочныхМетров,
	|	втТипыТС.ТемпературныйРежим,
	|	втТипыТС.ТипКузова КАК ТипКузова,
	|	втТипыТС.ДоступныеЗоны,
	|	втТипыТС.ГрузоподъемностьПроцентЗагрузки,
	|	втТипыТС.ОбъемПроцентЗагрузки,
	|	втТипыТС.КоличествоМестПроцентЗагрузки,
	|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки
	|ПОМЕСТИТЬ втТипыТС
	|ИЗ
	|	втТипыТСПодготовка КАК втТипыТС
	|ГДЕ
	|	НЕ (втТипыТС.ТипТС, втТипыТС.Рейс) В
	|				(ВЫБРАТЬ
	|					втИсключитьНедоступныеЗоны.ТипТС,
	|					втИсключитьНедоступныеЗоны.Рейс
	|				ИЗ
	|					втИсключитьНедоступныеЗоны)
	|	И НЕ (втТипыТС.ТипТС, втТипыТС.Рейс) В
	|				(ВЫБРАТЬ
	|					втИсключитьКлассыОпасности.ТипТС,
	|					втИсключитьКлассыОпасности.Рейс
	|				ИЗ
	|					втИсключитьКлассыОпасности)
	|	И НЕ (втТипыТС.ТипТС, втТипыТС.Рейс) В
	|				(ВЫБРАТЬ
	|					втИсключитьТемпературныйРежим.ТипТС,
	|					втИсключитьТемпературныйРежим.Рейс
	|				ИЗ
	|					втИсключитьТемпературныйРежим)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыТС.Рейс,
	|	упПартнерыДоступныеТипыТС.Ссылка КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА упПартнерыДоступныеТипыТС.Ссылка.Перевозчик
	|			ТОГДА упПартнерыДоступныеТипыТС.Ссылка.РейтингПеревозчика
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РейтингПеревозчика,
	|	ВЫБОР
	|		КОГДА упПартнерыДоступныеТипыТС.Ссылка = втТипыТС.СобственныйПеревозчик
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СобственныйПеревозчик,
	|	упПартнерыДоступныеТипыТС.КоличествоМакс КАК КоличествоТС,
	|	втТипыТС.ТипТС,
	|	втТипыТС.Высота,
	|	втТипыТС.Ширина,
	|	втТипыТС.Длина,
	|	втТипыТС.Грузоподъемность,
	|	втТипыТС.Объем,
	|	втТипыТС.КоличествоМест,
	|	втТипыТС.КоличествоЗагрузочныхМетров,
	|	втТипыТС.ГрузоподъемностьПроцентЗагрузки,
	|	втТипыТС.ОбъемПроцентЗагрузки,
	|	втТипыТС.КоличествоМестПроцентЗагрузки,
	|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки
	|ПОМЕСТИТЬ втРеальныеПеревозчики
	|ИЗ
	|	Справочник.упПартнеры.ДоступныеТипыТС КАК упПартнерыДоступныеТипыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТипыТС КАК втТипыТС
	|		ПО (упПартнерыДоступныеТипыТС.Ссылка.Перевозчик)
	|			И (втТипыТС.Перевозчик В (упПартнерыДоступныеТипыТС.Ссылка, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)))
	|			И упПартнерыДоступныеТипыТС.ТипТС = втТипыТС.ТипТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПеревозчики КАК втПеревозчики
	|		ПО (втТипыТС.Рейс = втПеревозчики.Рейс)
	|			И упПартнерыДоступныеТипыТС.Ссылка = втПеревозчики.Перевозчик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРеальныеПеревозчики.Рейс,
	|	втРеальныеПеревозчики.Перевозчик,
	|	втРеальныеПеревозчики.РейтингПеревозчика,
	|	втРеальныеПеревозчики.СобственныйПеревозчик,
	|	ИСТИНА КАК РеальныйПеревозчик,
	|	ЛОЖЬ КАК ВиртуальныйПеревозчик,
	|	втРеальныеПеревозчики.КоличествоТС,
	|	втРеальныеПеревозчики.ТипТС,
	|	втРеальныеПеревозчики.Высота,
	|	втРеальныеПеревозчики.Ширина,
	|	втРеальныеПеревозчики.Длина,
	|	втРеальныеПеревозчики.Грузоподъемность,
	|	втРеальныеПеревозчики.Объем,
	|	втРеальныеПеревозчики.КоличествоМест,
	|	втРеальныеПеревозчики.КоличествоЗагрузочныхМетров,
	|	втРеальныеПеревозчики.ГрузоподъемностьПроцентЗагрузки,
	|	втРеальныеПеревозчики.ОбъемПроцентЗагрузки,
	|	втРеальныеПеревозчики.КоличествоМестПроцентЗагрузки,
	|	втРеальныеПеревозчики.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	0 КАК РасходыПоРейсу,
	|	0 КАК Порядок
	|ИЗ
	|	втРеальныеПеревозчики КАК втРеальныеПеревозчики
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТипыТС.Рейс,
	|	ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка),
	|	0,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	-1,
	|	втТипыТС.ТипТС,
	|	втТипыТС.Высота,
	|	втТипыТС.Ширина,
	|	втТипыТС.Длина,
	|	втТипыТС.Грузоподъемность,
	|	втТипыТС.Объем,
	|	втТипыТС.КоличествоМест,
	|	втТипыТС.КоличествоЗагрузочныхМетров,
	|	втТипыТС.ГрузоподъемностьПроцентЗагрузки,
	|	втТипыТС.ОбъемПроцентЗагрузки,
	|	втТипыТС.КоличествоМестПроцентЗагрузки,
	|	втТипыТС.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	0,
	|	1
	|ИЗ
	|	втТипыТС КАК втТипыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО втТипыТС.Рейс = втВидыПеревозок.Рейс
	|			И (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
	|			И (втТипыТС.Перевозчик = ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	втРеальныеПеревозчики.Рейс,
	|	Порядок,
	|	втРеальныеПеревозчики.СобственныйПеревозчик УБЫВ,
	|	РеальныйПеревозчик УБЫВ,
	|	втРеальныеПеревозчики.ГрузоподъемностьПроцентЗагрузки УБЫВ,
	|	втРеальныеПеревозчики.ОбъемПроцентЗагрузки УБЫВ,
	|	втРеальныеПеревозчики.КоличествоМестПроцентЗагрузки УБЫВ,
	|	втРеальныеПеревозчики.КоличествоЗагрузочныхМетровПроцентЗагрузки УБЫВ";
	
КонецФункции

// Возвращает текст запроса Автоматического назначения ТС.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаАвтоматическоеНазначениеТС()
	
	Возврат 
	"ВЫБРАТЬ
	|	упРейс.Ссылка КАК Рейс,
	|	упРейс.ВидПеревозки,
	|	упРейс.Организация,
	|	упРейс.Организация.Партнер КАК СобственныйПеревозчик,
	|	ВЫБОР
	|		КОГДА упРейс.ВидПеревозки.ВыборПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаСобственнымиТС)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПеревозкаСобственнымиТС,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.Перевозчик, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)) КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА упПеревозчикПоРейсуСрезПоследних.Перевозчик ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА упПеревозчикПоРейсуСрезПоследних.Перевозчик.Перевозчик
	|					ТОГДА упПеревозчикПоРейсуСрезПоследних.Перевозчик.РейтингПеревозчика
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РейтингПеревозчика,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТипТС, ЗНАЧЕНИЕ(Справочник.упТипыТС.ПустаяСсылка)) КАК ТипТС,
	|	ЕСТЬNULL(упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство, ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)) КАК ТранспортноеСредство,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Масса, 0) КАК Масса,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.Объем, 0) КАК Объем,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоМест, 0) КАК КоличествоМест,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.КоличествоЗагрузочныхМетров, 0) КАК КоличествоЗагрузочныхМетров,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ПлановоеНачалоВыполнения,
	|	ЕСТЬNULL(упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК ПлановоеОкончаниеВыполнения
	|ПОМЕСТИТЬ втРейсыПодбор
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
	|		ПО упРейс.Ссылка = упПлановыеПараметрыРейса.Рейс
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(, Рейс В (&МассивРейсов)) КАК упПеревозчикПоРейсуСрезПоследних
	|		ПО упРейс.Ссылка = упПеревозчикПоРейсуСрезПоследних.Рейс
	|ГДЕ
	|	упРейс.Ссылка В(&МассивРейсов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсы.Рейс,
	|	втРейсы.Организация,
	|	упВидыПеревозок.ВыборПеревозчика КАК ВариантВыбораПеревозчика,
	|	упВидыПеревозок.Перевозчик,
	|	ВЫБОР
	|		КОГДА упВидыПеревозок.Перевозчик.Перевозчик
	|			ТОГДА втРейсы.Перевозчик.РейтингПеревозчика
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РейтингПеревозчика
	|ПОМЕСТИТЬ втВидыПеревозок
	|ИЗ
	|	Справочник.упВидыПеревозок КАК упВидыПеревозок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсыПодбор КАК втРейсы
	|		ПО упВидыПеревозок.Ссылка = втРейсы.ВидПеревозки
	|			И (упВидыПеревозок.ВыборПеревозчика <> ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОформляетсяТендер))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсы.Рейс,
	|	втРейсы.ВидПеревозки,
	|	втРейсы.Организация,
	|	втРейсы.СобственныйПеревозчик,
	|	втРейсы.Перевозчик,
	|	втРейсы.РейтингПеревозчика,
	|	втРейсы.ТипТС,
	|	втРейсы.ТранспортноеСредство,
	|	втРейсы.Масса,
	|	втРейсы.Объем,
	|	втРейсы.КоличествоМест,
	|	втРейсы.КоличествоЗагрузочныхМетров,
	|	втРейсы.ПлановоеНачалоВыполнения,
	|	втРейсы.ПлановоеОкончаниеВыполнения,
	|	втРейсы.ПеревозкаСобственнымиТС
	|ПОМЕСТИТЬ втРейсы
	|ИЗ
	|	втРейсыПодбор КАК втРейсы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВидыПеревозок.Рейс,
	|	втВидыПеревозок.Перевозчик,
	|	втВидыПеревозок.РейтингПеревозчика КАК РейтингПеревозчика
	|ПОМЕСТИТЬ втПеревозчики
	|ИЗ
	|	втВидыПеревозок КАК втВидыПеревозок
	|ГДЕ
	|	втВидыПеревозок.ВариантВыбораПеревозчика = ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ПеревозкаОпределеннымПеревозчиком)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втВидыПеревозок.Рейс,
	|	упПартнеры.Ссылка,
	|	ВЫБОР
	|		КОГДА упПартнеры.Перевозчик
	|			ТОГДА упПартнеры.РейтингПеревозчика
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Справочник.упПартнеры КАК упПартнеры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втВидыПеревозок КАК втВидыПеревозок
	|		ПО (упПартнеры.Перевозчик)
	|			И (НЕ упПартнеры.ПометкаУдаления)
	|			И (втВидыПеревозок.ВариантВыбораПеревозчика В (ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.НепосредственныйВыборВРейсе), ЗНАЧЕНИЕ(Перечисление.упВариантыВыбораПеревозчика.ОпределяетсяДляКаждогоРейсаИндивидуально)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсы.Рейс,
	|	упРейсЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
	|	упРейсЗадания.Задание,
	|	упРейсЗадания.ГрузовоеМесто,
	|	втРейсы.ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах КАК ПараметрыВводаИнформацииОГрузовыхМестах
	|ПОМЕСТИТЬ втЗаданияРейса
	|ИЗ
	|	Документ.упРейс.Задания КАК упРейсЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втРейсы.Рейс,
	|	втРейсы.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	|	втРейсы.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)) КАК Ширина, 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)) КАК Длина, 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0)) КАК Высота 
	|ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|		ПО (&КонтрольТиповКузовов)
	|			И втРейсы.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|ГДЕ
	|	втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах В (ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку), 
	|ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втРейсы.Рейс,
	|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0))
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
	|		ПО втРейсы.Задание = упГрузовыеМеста.Ссылка
	|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО упГрузовыеМеста.Ссылка.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|			И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО упГрузовыеМеста.Ссылка = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|			И упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|		ПО (&КонтрольТиповКузовов)
	|			И (упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)
	
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втРейсы.Рейс,
	|	упГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	|	упГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Ширина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Ширина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Длина, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Длина, 0)), 
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Высота, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Высота, 0))
	|ИЗ
	|	втЗаданияРейса КАК втРейсы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
	|		ПО втРейсы.Задание = упГрузовыеМеста.Ссылка
	|		И втРейсы.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО втРейсы.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗаданияРейса КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО втРейсы.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|			И втРейсы.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	|		ПО (&КонтрольТиповКузовов)
	|			И (упГрузовыеМеста.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка)
	
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	втРейсы.Рейс,
	//|	упРейсЗадания.ГрузовоеМесто.КлассОпасности КАК КлассОпасности,
	//|	упРейсЗадания.ГрузовоеМесто.ТемпературныйРежим КАК ТемпературныйРежим,
	//|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)) КАК ТипКузова,
	//|	упРейсЗадания.ГрузовоеМесто.Ширина КАК Ширина,
	//|	упРейсЗадания.ГрузовоеМесто.Длина КАК Длина,
	//|	упРейсЗадания.ГрузовоеМесто.Высота КАК Высота
	//|ПОМЕСТИТЬ втДанныеСовместимостиПодготовка
	//|ИЗ
	//|	Документ.упРейс.Задания КАК упРейсЗадания
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	//|		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	//|			И (упРейсЗадания.ГрузовоеМесто <> ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	//|		ПО (&КонтрольТиповКузовов)
	//|			И упРейсЗадания.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	втРейсы.Рейс,
	//|	ГрузовыеМеста.ГрузовоеМесто.КлассОпасности,
	//|	ГрузовыеМеста.ГрузовоеМесто.ТемпературныйРежим,
	//|	ЕСТЬNULL(ТипыКузововДляПогрузкиРазгрузки.ТипКузова, ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)),
	//|	ГрузовыеМеста.ГрузовоеМесто.Ширина,
	//|	ГрузовыеМеста.ГрузовоеМесто.Длина,
	//|	ГрузовыеМеста.ГрузовоеМесто.Высота
	//|ИЗ
	//|	Документ.упРейс.Задания КАК упРейсЗадания
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	//|		ПО упРейсЗадания.Ссылка = втРейсы.Рейс
	//|			И (упРейсЗадания.ГрузовоеМесто = ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК ГрузовыеМеста
	//|		ПО упРейсЗадания.Задание = ГрузовыеМеста.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упТипыГрузов.ТипыКузововДляПогрузкиРазгрузки КАК ТипыКузововДляПогрузкиРазгрузки
	//|		ПО (&КонтрольТиповКузовов)
	//|			И упРейсЗадания.ГрузовоеМесто.ТипГруза = ТипыКузововДляПогрузкиРазгрузки.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеСовместимости.Рейс,
	|	втРейсы.СобственныйПеревозчик,
	|	втРейсы.Перевозчик,
	|	втРейсы.РейтингПеревозчика,
	|	втРейсы.ТипТС,
	|	втРейсы.ТранспортноеСредство,
	|	втРейсы.Масса,
	|	втРейсы.Объем,
	|	втРейсы.КоличествоМест,
	|	втРейсы.КоличествоЗагрузочныхМетров,
	|	втРейсы.ПлановоеНачалоВыполнения,
	|	втРейсы.ПлановоеОкончаниеВыполнения,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА втДанныеСовместимости.Ширина >= втДанныеСовместимости.Длина
	|					И втДанныеСовместимости.Ширина >= втДанныеСовместимости.Высота
	|				ТОГДА втДанныеСовместимости.Ширина
	|			КОГДА втДанныеСовместимости.Длина >= втДанныеСовместимости.Ширина
	|					И втДанныеСовместимости.Длина >= втДанныеСовместимости.Высота
	|				ТОГДА втДанныеСовместимости.Длина
	|			КОГДА втДанныеСовместимости.Высота >= втДанныеСовместимости.Длина
	|					И втДанныеСовместимости.Высота >= втДанныеСовместимости.Ширина
	|				ТОГДА втДанныеСовместимости.Высота
	|		КОНЕЦ) КАК МаксимальноеЗначениеГабарита,
	|	втРейсы.ПеревозкаСобственнымиТС
	|ПОМЕСТИТЬ втДанныеСовместимости
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО втДанныеСовместимости.Рейс = втРейсы.Рейс
	|
	|СГРУППИРОВАТЬ ПО
	|	втДанныеСовместимости.Рейс,
	|	втРейсы.СобственныйПеревозчик,
	|	втРейсы.Перевозчик,
	|	втРейсы.ТипТС,
	|	втРейсы.ТранспортноеСредство,
	|	втРейсы.Масса,
	|	втРейсы.Объем,
	|	втРейсы.КоличествоМест,
	|	втРейсы.КоличествоЗагрузочныхМетров,
	|	втРейсы.ПлановоеНачалоВыполнения,
	|	втРейсы.ПлановоеОкончаниеВыполнения,
	|	втРейсы.ПеревозкаСобственнымиТС,
	|	втРейсы.РейтингПеревозчика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втРейсы.Рейс,
	|	упРейсМаршрут.Адрес.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втЗоныРейсов
	|ИЗ
	|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
	|			,
	|			Рейс В
	|				(ВЫБРАТЬ
	|					втРейсы.Рейс
	|				ИЗ
	|					втРейсы)) КАК упРейсМаршрут
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРейсы КАК втРейсы
	|		ПО (&КонтрольДоступностиЗон)
	|			И упРейсМаршрут.Рейс = втРейсы.Рейс
	|			И (НЕ упРейсМаршрут.Отменена)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.ТипКузова
	|ПОМЕСТИТЬ втТипыКузововРейсов
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.КлассОпасности
	|ПОМЕСТИТЬ втКлассыОпасности
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ
	|	втДанныеСовместимости.КлассОпасности <> ЗНАЧЕНИЕ(Справочник.упКлассыОпасности.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.ТемпературныйРежим
	|ПОМЕСТИТЬ втТемпературныеРежимы
	|ИЗ
	|	втДанныеСовместимостиПодготовка КАК втДанныеСовместимости
	|ГДЕ
	|	втДанныеСовместимости.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеСовместимости.Рейс,
	|	втДанныеСовместимости.СобственныйПеревозчик,
	|	втДанныеСовместимости.ПлановоеНачалоВыполнения,
	|	втДанныеСовместимости.ПлановоеОкончаниеВыполнения,
	|	упТранспортныеСредства.Ссылка КАК ТранспортноеСредство,
	|	упТранспортныеСредства.ПерерывМеждуРейсами,
	|	упТранспортныеСредства.ТипТС,
	|	упТранспортныеСредства.Партнер КАК Перевозчик,
	|	упТранспортныеСредства.Партнер.РейтингПеревозчика КАК РейтингПеревозчика,
	|	упТранспортныеСредства.Высота,
	|	упТранспортныеСредства.Ширина,
	|	упТранспортныеСредства.Длина,
	|	упТранспортныеСредства.Грузоподъемность,
	|	упТранспортныеСредства.Объем,
	|	упТранспортныеСредства.КоличествоМест,
	|	упТранспортныеСредства.КоличествоЗагрузочныхМетров,
	|	упТранспортныеСредства.ТемпературныйРежим,
	|	упТранспортныеСредства.ТипКузова КАК ТипКузова,
	|	упТранспортныеСредства.ПакетНеобходимыхДокументов,
	|	упТранспортныеСредства.ДоступныеЗоны,
	|	ВЫБОР
	|		КОГДА упТранспортныеСредства.Ширина >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Ширина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Ширина
	|		КОГДА упТранспортныеСредства.Длина >= упТранспортныеСредства.Ширина
	|				И упТранспортныеСредства.Длина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Длина
	|		КОГДА упТранспортныеСредства.Высота >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Высота >= упТранспортныеСредства.Ширина
	|			ТОГДА упТранспортныеСредства.Высота
	|	КОНЕЦ КАК МаксимальноеЗначениеГабарита,
	|	втДанныеСовместимости.Масса КАК МассаРейса,
	|	втДанныеСовместимости.Объем КАК ОбъемРейса,
	|	втДанныеСовместимости.КоличествоМест КАК КоличествоМестРейса,
	|	втДанныеСовместимости.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетровРейса,
	|	втДанныеСовместимости.МаксимальноеЗначениеГабарита КАК МаксимальноеЗначениеГабаритаРейса
	|ПОМЕСТИТЬ втТранспортныеСредстваПоРейсам
	|ИЗ
	|	Справочник.упТранспортныеСредства КАК упТранспортныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеСовместимости КАК втДанныеСовместимости
	|		ПО (НЕ &КонтрольТиповКузовов
	|				ИЛИ упТранспортныеСредства.ТипКузова = ЗНАЧЕНИЕ(Справочник.упТипыКузововТС.ПустаяСсылка)
	|				ИЛИ (упТранспортныеСредства.ТипКузова, втДанныеСовместимости.Рейс) В
	|					(ВЫБРАТЬ
	|						втТипыКузововРейсов.ТипКузова,
	|						втТипыКузововРейсов.Рейс
	|					ИЗ
	|						втТипыКузововРейсов))
	|			И (втДанныеСовместимости.ТранспортноеСредство В (упТранспортныеСредства.Ссылка, ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)))
	|			И (втДанныеСовместимости.ТипТС В (упТранспортныеСредства.ТипТС, ЗНАЧЕНИЕ(Справочник.упТипыТС.ПустаяСсылка)))
	|			И (втДанныеСовместимости.Перевозчик В (упТранспортныеСредства.Партнер, ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)))
	|			И (упТранспортныеСредства.ВидТранспорта В (ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ЛегковойАвтомобиль), ЗНАЧЕНИЕ(Перечисление.упВидыТранспорта.ГрузовойАвтомобиль)))
	|			И (НЕ упТранспортныеСредства.ПометкаУдаления)
	|			И (втДанныеСовместимости.ПеревозкаСобственнымиТС
	|					И упТранспортныеСредства.СобственноеТранспортноеСредство
	|				ИЛИ НЕ втДанныеСовместимости.ПеревозкаСобственнымиТС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПеревозчики КАК втПеревозчики
	|		ПО упТранспортныеСредства.Партнер = втПеревозчики.Перевозчик
	|			И (втДанныеСовместимости.Рейс = втПеревозчики.Рейс)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упСостоянияТранспортныхСредств.СрезПоследних КАК упСостоянияТранспортныхСредствСрезПоследних
	|		ПО (упСостоянияТранспортныхСредствСрезПоследних.ТранспортноеСредство = упТранспортныеСредства.Ссылка)
	|ГДЕ
	|	НЕ ЕСТЬNULL(упСостоянияТранспортныхСредствСрезПоследних.СостояниеТС, ЗНАЧЕНИЕ(Справочник.упСостоянияТС.Свободно)) = ЗНАЧЕНИЕ(Справочник.упСостоянияТС.Недоступно)
	|	И (втПеревозчики.Перевозчик ЕСТЬ NULL
	|				И втДанныеСовместимости.ПеревозкаСобственнымиТС
	|			ИЛИ НЕ втПеревозчики.Перевозчик ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТранспортныеСредстваПоРейсам.ТранспортноеСредство
	|ПОМЕСТИТЬ втТранспортныеСредстваДляОтбораПрицепов
	|ИЗ
	|	втТранспортныеСредстваПоРейсам КАК втТранспортныеСредстваПоРейсам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПрицепыТранспортныхСредствСрезПоследних.ТранспортноеСредство,
	|	упПрицепыТранспортныхСредствСрезПоследних.Прицеп,
	|	упТранспортныеСредства.Высота,
	|	упТранспортныеСредства.Длина,
	|	упТранспортныеСредства.Ширина,
	|	упТранспортныеСредства.Грузоподъемность,
	|	упТранспортныеСредства.Объем,
	|	упТранспортныеСредства.КоличествоМест,
	|	упТранспортныеСредства.КоличествоЗагрузочныхМетров,
	|	ВЫБОР
	|		КОГДА упТранспортныеСредства.Ширина >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Ширина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Ширина
	|		КОГДА упТранспортныеСредства.Длина >= упТранспортныеСредства.Ширина
	|				И упТранспортныеСредства.Длина >= упТранспортныеСредства.Высота
	|			ТОГДА упТранспортныеСредства.Длина
	|		КОГДА упТранспортныеСредства.Высота >= упТранспортныеСредства.Длина
	|				И упТранспортныеСредства.Высота >= упТранспортныеСредства.Ширина
	|			ТОГДА упТранспортныеСредства.Высота
	|	КОНЕЦ КАК МаксимальноеЗначениеГабарита
	|ПОМЕСТИТЬ втПрицепы
	|ИЗ
	|	РегистрСведений.упПрицепыТранспортныхСредств.СрезПоследних(
	|			&ТекущаяДата,
	|			ТранспортноеСредство В
	|				(ВЫБРАТЬ
	|					втТранспортныеСредстваДляОтбораПрицепов.ТранспортноеСредство
	|				ИЗ
	|					втТранспортныеСредстваДляОтбораПрицепов КАК втТранспортныеСредстваДляОтбораПрицепов)) КАК упПрицепыТранспортныхСредствСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТранспортныеСредства КАК упТранспортныеСредства
	|		ПО упПрицепыТранспортныхСредствСрезПоследних.Прицеп = упТранспортныеСредства.Ссылка
	|ГДЕ
	|	упПрицепыТранспортныхСредствСрезПоследних.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.Установлено)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПрицепы.ТранспортноеСредство,
	|	СУММА(втПрицепы.Грузоподъемность) КАК Грузоподъемность,
	|	СУММА(втПрицепы.Объем) КАК Объем,
	|	СУММА(втПрицепы.КоличествоМест) КАК КоличествоМест,
	|	СУММА(втПрицепы.КоличествоЗагрузочныхМетров) КАК КоличествоЗагрузочныхМетров,
	|	МАКСИМУМ(втПрицепы.МаксимальноеЗначениеГабарита) КАК МаксимальноеЗначениеГабарита,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втПрицепы.Прицеп) КАК КоличествоПрицепов
	|ПОМЕСТИТЬ втПрицепыПоТСХарактеристики
	|ИЗ
	|	втПрицепы КАК втПрицепы
	|
	|СГРУППИРОВАТЬ ПО
	|	втПрицепы.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТСПоРейсам.ТранспортноеСредство,
	|	втТСПоРейсам.ТипТС,
	|	втТСПоРейсам.Перевозчик,
	|	втТСПоРейсам.РейтингПеревозчика,
	|	втТСПоРейсам.Высота,
	|	втТСПоРейсам.Ширина,
	|	втТСПоРейсам.Длина,
	|	втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0) КАК Грузоподъемность,
	|	втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0) КАК Объем,
	|	втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0) КАК КоличествоМест,
	|	втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0) КАК КоличествоЗагрузочныхМетров,
	|	втТСПоРейсам.ТемпературныйРежим,
	|	втТСПоРейсам.ТипКузова,
	|	втТСПоРейсам.ДоступныеЗоны,
	|	втТСПоРейсам.ПерерывМеждуРейсами,
	|	втТСПоРейсам.ПакетНеобходимыхДокументов,
	|	ВЫБОР
	|		КОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита > ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|			ТОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита
	|		ИНАЧЕ ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|	КОНЕЦ КАК МаксимальноеЗначениеГабарита,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.Грузоподъемность = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.МассаРейса / (втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ГрузоподъемностьПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.Объем = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.ОбъемРейса / (втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.КоличествоМест = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.КоличествоМестРейса / (втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоМестПроцентЗагрузки,
	|	ВЫБОР
	|		КОГДА НЕ втТСПоРейсам.КоличествоЗагрузочныхМетров = 0
	|			ТОГДА ВЫРАЗИТЬ(втТСПоРейсам.КоличествоЗагрузочныхМетровРейса / (втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0)) * 100 КАК ЧИСЛО(10, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоПрицепов, 0) КАК КоличествоПрицепов,
	|	втТСПоРейсам.Рейс,
	|	втТСПоРейсам.СобственныйПеревозчик,
	|	втТСПоРейсам.ПлановоеНачалоВыполнения,
	|	втТСПоРейсам.ПлановоеОкончаниеВыполнения
	|ПОМЕСТИТЬ втТСПодготовка
	|ИЗ
	|	втТранспортныеСредстваПоРейсам КАК втТСПоРейсам
	|		ЛЕВОЕ СОЕДИНЕНИЕ втПрицепыПоТСХарактеристики КАК втХарактеристикиПрицеповПоТС
	|		ПО втТСПоРейсам.ТранспортноеСредство = втХарактеристикиПрицеповПоТС.ТранспортноеСредство
	|ГДЕ
	|	(НЕ &КонтрольМассы
	|			ИЛИ втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0) = 0
	|			ИЛИ втТСПоРейсам.Грузоподъемность + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Грузоподъемность, 0) >= втТСПоРейсам.МассаРейса)
	|	И (НЕ &КонтрольОбъема
	|			ИЛИ втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0) = 0
	|			ИЛИ втТСПоРейсам.Объем + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.Объем, 0) >= втТСПоРейсам.ОбъемРейса)
	|	И (НЕ &КонтрольКоличестваМест
	|			ИЛИ втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0) = 0
	|			ИЛИ втТСПоРейсам.КоличествоМест + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоМест, 0) >= втТСПоРейсам.КоличествоМестРейса)
	|	И (НЕ &КонтрольКоличестваЗагрузочныхМетров
	|			ИЛИ втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0) = 0
	|			ИЛИ втТСПоРейсам.КоличествоЗагрузочныхМетров + ЕСТЬNULL(втХарактеристикиПрицеповПоТС.КоличествоЗагрузочныхМетров, 0) >= втТСПоРейсам.КоличествоЗагрузочныхМетровРейса)
	|	И (НЕ &КонтрольГабаритовГрузовогоМеста
	|			ИЛИ ВЫБОР
	|				КОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита > ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|					ТОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита
	|				ИНАЧЕ ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|			КОНЕЦ = 0
	|			ИЛИ ВЫБОР
	|				КОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита > ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|					ТОГДА втТСПоРейсам.МаксимальноеЗначениеГабарита
	|				ИНАЧЕ ЕСТЬNULL(втХарактеристикиПрицеповПоТС.МаксимальноеЗначениеГабарита, 0)
	|			КОНЕЦ >= втТСПоРейсам.МаксимальноеЗначениеГабаритаРейса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТС.Рейс,
	|	упРасписаниеРаботыТС.Транспорт КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втНедоступныеВоВремяРейса
	|ИЗ
	|	РегистрСведений.упЗанятостьТранспорта.СрезПоследних КАК упРасписаниеРаботыТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТСПодготовка КАК втТС
	|		ПО упРасписаниеРаботыТС.Транспорт = втТС.ТранспортноеСредство
	|			И (&КонтрольРасписанияРаботыТС)
	|			И (упРасписаниеРаботыТС.ДатаНачала МЕЖДУ втТС.ПлановоеНачалоВыполнения И втТС.ПлановоеОкончаниеВыполнения
	|				ИЛИ ДОБАВИТЬКДАТЕ(упРасписаниеРаботыТС.ДатаОкончания, СЕКУНДА, втТС.ПерерывМеждуРейсами * 3600) МЕЖДУ втТС.ПлановоеНачалоВыполнения И втТС.ПлановоеОкончаниеВыполнения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТС.ТранспортноеСредство,
	|	упДоступныеГеографическиеЗоны.ГеографическаяЗона КАК Зона
	|ПОМЕСТИТЬ втДоступныеЗоны
	|ИЗ
	|	втТСПодготовка КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеГеографическиеЗоны КАК упДоступныеГеографическиеЗоны
	|		ПО (&КонтрольДоступностиЗон)
	|			И втТС.ДоступныеЗоны = упДоступныеГеографическиеЗоны.ПравилаДоступности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТС.ТранспортноеСредство,
	|	ДопустимыеКлассыОпасныхГрузов.КлассОпасности
	|ПОМЕСТИТЬ втДоступныеКлассыОпасности
	|ИЗ
	|	втТСПодготовка КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упТранспортныеСредства.ДопустимыеКлассыОпасныхГрузов КАК ДопустимыеКлассыОпасныхГрузов
	|		ПО (&КонтрольКлассовОпасности)
	|			И втТС.ТранспортноеСредство = ДопустимыеКлассыОпасныхГрузов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втЗоныРейсов.Рейс,
	|	втДоступныеЗоны.ТранспортноеСредство
	|ПОМЕСТИТЬ втИсключитьНедоступныеЗоны
	|ИЗ
	|	втЗоныРейсов КАК втЗоныРейсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеЗоны КАК втДоступныеЗоны
	|		ПО (&КонтрольДоступностиЗон)
	|			И (НЕ (втЗоныРейсов.Зона, втДоступныеЗоны.ТранспортноеСредство) В
	|					(ВЫБРАТЬ
	|						втДоступныеЗоны.Зона,
	|						втДоступныеЗоны.ТранспортноеСредство
	|					ИЗ
	|						втДоступныеЗоны))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТС.Рейс,
	|	втТС.ТранспортноеСредство
	|ПОМЕСТИТЬ втИсключитьТемпературныйРежим
	|ИЗ
	|	втТемпературныеРежимы КАК втТемпературныеРежимы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТСПодготовка КАК втТС
	|		ПО (&КонтрольТемпературногоРежима)
	|			И втТемпературныеРежимы.Рейс = втТС.Рейс
	|			И (втТС.ТемпературныйРежим <> ЗНАЧЕНИЕ(Справочник.упТемпературныеРежимы.ПустаяСсылка))
	|			И (НЕ(втТС.ТемпературныйРежим.ТемператураОт <= втТемпературныеРежимы.ТемпературныйРежим.ТемператураОт
	|					И втТС.ТемпературныйРежим.ТемператураДо >= втТемпературныеРежимы.ТемпературныйРежим.ТемператураДо))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втКлассыОпасности.Рейс,
	|	втДоступныеКлассыОпасности.ТранспортноеСредство
	|ПОМЕСТИТЬ втИсключитьКлассыОпасности
	|ИЗ
	|	втКлассыОпасности КАК втКлассыОпасности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДоступныеКлассыОпасности КАК втДоступныеКлассыОпасности
	|		ПО (&КонтрольКлассовОпасности)
	|			И (НЕ (втКлассыОпасности.КлассОпасности, втДоступныеКлассыОпасности.ТранспортноеСредство) В
	|					(ВЫБРАТЬ
	|						втДоступныеКлассыОпасности.КлассОпасности,
	|						втДоступныеКлассыОпасности.ТранспортноеСредство
	|					ИЗ
	|						втДоступныеКлассыОпасности))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.Рейс,
	|	ВЫБОР
	|		КОГДА втТС.Перевозчик = втТС.СобственныйПеревозчик
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СобственныйПеревозчик,
	|	втТС.ПлановоеНачалоВыполнения,
	|	втТС.ПлановоеОкончаниеВыполнения,
	|	втТС.ТранспортноеСредство,
	|	втТС.ТипТС,
	|	втТС.Перевозчик КАК Перевозчик,
	|	втТС.РейтингПеревозчика КАК РейтингПеревозчика,
	|	втТС.Высота,
	|	втТС.Ширина,
	|	втТС.Длина,
	|	втТС.Грузоподъемность,
	|	втТС.Объем,
	|	втТС.КоличествоМест,
	|	втТС.КоличествоЗагрузочныхМетров,
	|	втТС.ГрузоподъемностьПроцентЗагрузки,
	|	втТС.ОбъемПроцентЗагрузки,
	|	втТС.КоличествоМестПроцентЗагрузки,
	|	втТС.ПакетНеобходимыхДокументов,
	|	втТС.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТС.КоличествоПрицепов
	|ПОМЕСТИТЬ втТС
	|ИЗ
	|	втТСПодготовка КАК втТС
	|ГДЕ
	|	НЕ (втТС.ТранспортноеСредство, втТС.Рейс) В
	|				(ВЫБРАТЬ
	|					втИсключитьНедоступныеЗоны.ТранспортноеСредство,
	|					втИсключитьНедоступныеЗоны.Рейс
	|				ИЗ
	|					втИсключитьНедоступныеЗоны)
	|	И НЕ (втТС.ТранспортноеСредство, втТС.Рейс) В
	|				(ВЫБРАТЬ
	|					втИсключитьКлассыОпасности.ТранспортноеСредство,
	|					втИсключитьКлассыОпасности.Рейс
	|				ИЗ
	|					втИсключитьКлассыОпасности)
	|	И НЕ (втТС.ТранспортноеСредство, втТС.Рейс) В
	|				(ВЫБРАТЬ
	|					втИсключитьТемпературныйРежим.ТранспортноеСредство,
	|					втИсключитьТемпературныйРежим.Рейс
	|				ИЗ
	|					втИсключитьТемпературныйРежим)
	|	И НЕ (втТС.ТранспортноеСредство, втТС.Рейс) В
	|				(ВЫБРАТЬ
	|					втНедоступныеВоВремяРейса.ТранспортноеСредство,
	|					втНедоступныеВоВремяРейса.Рейс
	|				ИЗ
	|					втНедоступныеВоВремяРейса)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.Рейс,
	|	втТС.СобственныйПеревозчик,
	|	втТС.ТранспортноеСредство,
	|	втТС.ПлановоеНачалоВыполнения,
	|	втТС.ПлановоеОкончаниеВыполнения,
	|	втТС.ТипТС,
	|	втТС.Перевозчик,
	|	втТС.РейтингПеревозчика,
	|	втТС.Высота,
	|	втТС.Ширина,
	|	втТС.Длина,
	|	втТС.Грузоподъемность,
	|	втТС.Объем,
	|	втТС.КоличествоМест,
	|	втТС.КоличествоЗагрузочныхМетров,
	|	втТС.ГрузоподъемностьПроцентЗагрузки,
	|	втТС.ОбъемПроцентЗагрузки,
	|	втТС.КоличествоМестПроцентЗагрузки,
	|	втТС.ПакетНеобходимыхДокументов,
	|	втТС.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	втТС.КоличествоПрицепов
	|ПОМЕСТИТЬ втРезультат
	|ИЗ
	|	втТС КАК втТС
	|ГДЕ
	|	(НЕ &КонтрольДоступностиТС
	|			ИЛИ втТС.Перевозчик.ДоступныеРесурсы = ЗНАЧЕНИЕ(Справочник.упПравилаДоступностиРесурсов.ПустаяСсылка))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втТС.Рейс,
	|	втТС.СобственныйПеревозчик,
	|	втТС.ТранспортноеСредство,
	|	втТС.ПлановоеНачалоВыполнения,
	|	втТС.ПлановоеОкончаниеВыполнения,
	|	втТС.ТипТС,
	|	втТС.Перевозчик,
	|	втТС.РейтингПеревозчика,
	|	втТС.Высота,
	|	втТС.Ширина,
	|	втТС.Длина,
	|	втТС.Грузоподъемность,
	|	втТС.Объем,
	|	втТС.КоличествоМест,
	|	втТС.КоличествоЗагрузочныхМетров,
	|	втТС.ГрузоподъемностьПроцентЗагрузки,
	|	втТС.ОбъемПроцентЗагрузки,
	|	втТС.КоличествоМестПроцентЗагрузки,
	|	втТС.ПакетНеобходимыхДокументов,
	|	втТС.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	NULL
	|ИЗ
	|	втТС КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеТС КАК упДоступныеТС
	|		ПО (&КонтрольДоступностиТС)
	|			И (втТС.Перевозчик.ДоступныеРесурсы <> ЗНАЧЕНИЕ(Справочник.упПравилаДоступностиРесурсов.ПустаяСсылка))
	|			И втТС.Перевозчик.ДоступныеРесурсы = упДоступныеТС.Правило
	|			И втТС.ТранспортноеСредство = упДоступныеТС.ТранспортноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПакетыДокументовТССписокДокументов.ТипДокумента,
	|	втТС.ТранспортноеСредство
	|ПОМЕСТИТЬ втТипыНеобходимыхДокументов
	|ИЗ
	|	втТС КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упПакетыДокументовТС.СписокДокументов КАК упПакетыДокументовТССписокДокументов
	|		ПО (&КонтрольДокументов)
	|			И втТС.ПакетНеобходимыхДокументов = упПакетыДокументовТССписокДокументов.Ссылка
	|ГДЕ
	|	(упПакетыДокументовТССписокДокументов.ТипДокумента.ДокументВыдается = ЗНАЧЕНИЕ(Перечисление.упОбъектДокументовТСВодителей.ТранспортноеСредство)
	|			ИЛИ упПакетыДокументовТССписокДокументов.ТипДокумента.ДокументВыдается = ЗНАЧЕНИЕ(Перечисление.упОбъектДокументовТСВодителей.ТСВодитель))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента,
	|	тбДокументы.Регистратор,
	|	тбДокументы.ДействуетПо,
	|	тбДокументы.ТипДокумента.ИнтервалПредупреждения КАК ИнтервалПредупреждения,
	|	тбДокументы.ТипДокумента.СрокДействия КАК СрокДействия,
	|	тбДокументы.ТипДокумента.ПредупреждатьОбОкончанииСрокаДействия КАК ПредупреждатьОбОкончанииСрокаДействия,
	|	тбДокументы.ТипДокумента.ДокументВыдается КАК ДокументВыдается,
	|	тбДокументы.Регистратор.ДействуетС КАК ДействуетС
	|ПОМЕСТИТЬ втДействующиеДокументы
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДействующиеДокументыТСВодителей.СрезПоследних КАК тбДокументы
	|		ПО втТипыНеобходимыхДокументов.ТипДокумента = тбДокументы.ТипДокумента
	|			И втТипыНеобходимыхДокументов.ТранспортноеСредство = тбДокументы.ТранспортноеСредство
	|ГДЕ
	|	КОНЕЦПЕРИОДА(тбДокументы.ДействуетПо, ДЕНЬ) >= &ТекущаяДата
	|	И НАЧАЛОПЕРИОДА(тбДокументы.Регистратор.ДействуетС, ДЕНЬ) <= &ТекущаяДАта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента
	|ПОМЕСТИТЬ втДокументыКоторыхНетВНаличии
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|		ПО втТипыНеобходимыхДокументов.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|			И втТипыНеобходимыхДокументов.ТипДокумента = втДействующиеДокументы.ТипДокумента
	|ГДЕ
	|	втДействующиеДокументы.ТипДокумента ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДокументыКоторыхНетВНаличии.ТранспортноеСредство
	|ПОМЕСТИТЬ втТранспортныеСредстваБезПакетаДокументов
	|ИЗ
	|	втДокументыКоторыхНетВНаличии КАК втДокументыКоторыхНетВНаличии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТС.ТранспортноеСредство
	|ПОМЕСТИТЬ втТранспортныеСредстваСНеобходимымПакетомДокументов
	|ИЗ
	|	втТС КАК втТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТранспортныеСредстваБезПакетаДокументов КАК втТранспортныеСредстваБезПакетаДокументов
	|		ПО (втТранспортныеСредстваБезПакетаДокументов.ТранспортноеСредство = втТС.ТранспортноеСредство)
	|ГДЕ
	|	&КонтрольДокументов
	|	И втТранспортныеСредстваБезПакетаДокументов.ТранспортноеСредство ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДействующиеДокументы.ТранспортноеСредство,
	|	втДействующиеДокументы.ТипДокумента,
	|	втДействующиеДокументы.Регистратор,
	|	втДействующиеДокументы.ДействуетПо,
	|	втДействующиеДокументы.ДействуетС,
	|	втДействующиеДокументы.ИнтервалПредупреждения,
	|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия,
	|	втДействующиеДокументы.ДокументВыдается
	|ИЗ
	|	втТС КАК втТС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|		ПО втТС.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|ГДЕ
	|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия
	|	И РАЗНОСТЬДАТ(&ТекущаяДата, втДействующиеДокументы.ДействуетПо, ДЕНЬ) <= втДействующиеДокументы.ИнтервалПредупреждения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультат.Рейс,
	|	втРезультат.СобственныйПеревозчик,
	|	втРезультат.ТранспортноеСредство,
	|	втРезультат.ПлановоеНачалоВыполнения,
	|	втРезультат.ПлановоеОкончаниеВыполнения,
	|	втРезультат.ТипТС,
	|	втРезультат.Перевозчик,
	|	втРезультат.РейтингПеревозчика КАК РейтингПеревозчика,
	|	втРезультат.Высота,
	|	втРезультат.Ширина,
	|	втРезультат.Длина,
	|	втРезультат.Грузоподъемность,
	|	втРезультат.Объем,
	|	втРезультат.КоличествоМест,
	|	втРезультат.КоличествоЗагрузочныхМетров,
	|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
	|	втРезультат.ОбъемПроцентЗагрузки,
	|	втРезультат.КоличествоМестПроцентЗагрузки,
	|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	0 КАК РасходыПоРейсу,
	|	втРезультат.КоличествоПрицепов
	|ИЗ
	|	втРезультат КАК втРезультат
	|ГДЕ
	|	НЕ &КонтрольДокументов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втРезультат.Рейс,
	|	втРезультат.СобственныйПеревозчик,
	|	втРезультат.ТранспортноеСредство,
	|	втРезультат.ПлановоеНачалоВыполнения,
	|	втРезультат.ПлановоеОкончаниеВыполнения,
	|	втРезультат.ТипТС,
	|	втРезультат.Перевозчик,
	|	втРезультат.РейтингПеревозчика,
	|	втРезультат.Высота,
	|	втРезультат.Ширина,
	|	втРезультат.Длина,
	|	втРезультат.Грузоподъемность,
	|	втРезультат.Объем,
	|	втРезультат.КоличествоМест,
	|	втРезультат.КоличествоЗагрузочныхМетров,
	|	втРезультат.ГрузоподъемностьПроцентЗагрузки,
	|	втРезультат.ОбъемПроцентЗагрузки,
	|	втРезультат.КоличествоМестПроцентЗагрузки,
	|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки,
	|	0,
	|	втРезультат.КоличествоПрицепов
	|ИЗ
	|	втРезультат КАК втРезультат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТранспортныеСредстваСНеобходимымПакетомДокументов КАК втТранспортныеСредстваСНеобходимымПакетомДокументов
	|		ПО (&КонтрольДокументов)
	|			И втРезультат.ТранспортноеСредство = втТранспортныеСредстваСНеобходимымПакетомДокументов.ТранспортноеСредство
	|
	|УПОРЯДОЧИТЬ ПО
	|	втРезультат.Рейс,
	|	втРезультат.СобственныйПеревозчик УБЫВ,
	|	втРезультат.ГрузоподъемностьПроцентЗагрузки УБЫВ,
	|	втРезультат.ОбъемПроцентЗагрузки УБЫВ,
	|	втРезультат.КоличествоМестПроцентЗагрузки УБЫВ,
	|	втРезультат.КоличествоЗагрузочныхМетровПроцентЗагрузки УБЫВ";
	
КонецФункции

// Возвращает текст запроса Автоматического назначения Водителей.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаАвтоматическоеНазначениеВодителей()
	
	Возврат
	"
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упРейс.Ссылка КАК Рейс,
	|	упПеревозчикПоРейсуСрезПоследних.Перевозчик КАК Перевозчик,
	|	упПеревозчикПоРейсуСрезПоследних.ТипТС КАК ТипТС,
	|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство.ОсновнойВодитель КАК ОсновнойВодитель,
	|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство.ВторойОсновнойВодитель КАК ВторойОсновнойВодитель,
	|	ПлановыеПараметрыРейса.ПлановоеНачалоВыполнения КАК ПлановоеНачалоВыполнения,
	|	ПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения КАК ПлановоеОкончаниеВыполнения
	|ПОМЕСТИТЬ втРейсыОтбор
	|ИЗ
	|	Документ.упРейс КАК упРейс
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(
	|		,
	|		Рейс В (&МассивРейсов)) КАК упПеревозчикПоРейсуСрезПоследних
	|	ПО ИСТИНА
	|		И упРейс.Ссылка = упПеревозчикПоРейсуСрезПоследних.Рейс
	|		И упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство <> ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПлановыеПараметрыРейса КАК ПлановыеПараметрыРейса
	|	ПО упРейс.Ссылка = ПлановыеПараметрыРейса.Рейс
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРейсыОтбор.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упПакетыДокументовТССписокДокументов.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ втТипыНеобходимыхДокументовПоТС
	|ИЗ
	|	втРейсыОтбор КАК втРейсыОтбор
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упПакетыДокументовТС.СписокДокументов КАК упПакетыДокументовТССписокДокументов
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втРейсыОтбор.ТранспортноеСредство.ПакетНеобходимыхДокументов = упПакетыДокументовТССписокДокументов.Ссылка
	|;
	|//{Запрос: 2 ////////////////////////////////////////
	|// р566е2
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	упСотрудники.Ссылка КАК Сотрудник,
	|	упСотрудники.ТипСотрудника КАК ТипСотрудника,
	|	упСотрудники.Партнер КАК Перевозчик,
	|	упСотрудники.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	упСотрудники.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ втСотрудники
	|ИЗ
	|	Справочник.упСотрудники КАК упСотрудники
	|ГДЕ ИСТИНА
	|	И (ЛОЖЬ
	|		ИЛИ НЕ (&КонтрольДоступностиВодителей)
	|		ИЛИ упСотрудники.Партнер.ДоступныеРесурсы = ЗНАЧЕНИЕ(Справочник.упПравилаДоступностиРесурсов.ПустаяСсылка))
	|	И упСотрудники.ТипСотрудника В (ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.Водитель),
	|			ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.ВодительЭкспедитор))
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	упСотрудники.Ссылка КАК Сотрудник,
	|	упСотрудники.ТипСотрудника КАК ТипСотрудника,
	|	упСотрудники.Партнер КАК Перевозчик,
	|	упСотрудники.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	упСотрудники.ГрафикРаботы КАК ГрафикРаботы
	|ИЗ
	|	Справочник.упСотрудники КАК упСотрудники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДоступныеВодители КАК упДоступныеВодители
	|	ПО ИСТИНА
	|		И &КонтрольДоступностиВодителей
	|		И упСотрудники.Партнер.ДоступныеРесурсы <> ЗНАЧЕНИЕ(Справочник.упПравилаДоступностиРесурсов.ПустаяСсылка)
	|		И упСотрудники.Партнер.ДоступныеРесурсы = упДоступныеВодители.Правило
	|		И упСотрудники.Ссылка = упДоступныеВодители.Водитель
	|		И упСотрудники.ТипСотрудника В (ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.Водитель),
	|				ЗНАЧЕНИЕ(Перечисление.упТипыСотрудников.ВодительЭкспедитор))
	|;
	|//{Запрос: 3 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиТ.ГрафикРаботы КАК ГрафикРаботы,
	|	втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	втСотрудникиТ.Перевозчик КАК Перевозчик,
	|	втСотрудникиТ.Сотрудник КАК Сотрудник,
	|	втСотрудникиТ.ТипСотрудника КАК ТипСотрудника,
	|	втРейсыОтборТ.ПлановоеНачалоВыполнения КАК ДатаНачала,
	|	втРейсыОтборТ.ПлановоеОкончаниеВыполнения КАК ДатаОкончания,
	|	НАЧАЛОПЕРИОДА(втРейсыОтборТ.ПлановоеНачалоВыполнения, ДЕНЬ) КАК НачалоДняДатаНачала,
	|	КОНЕЦПЕРИОДА(втРейсыОтборТ.ПлановоеОкончаниеВыполнения, ДЕНЬ) КАК КонецДняДатаОкончания,
	|	втРейсыОтборТ.Перевозчик КАК ПеревозчикРейса,
	|	втРейсыОтборТ.Рейс КАК Рейс,
	|	втРейсыОтборТ.ТипТС КАК ТипТС,
	|	втРейсыОтборТ.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втРейсыОтборТ.ОсновнойВодитель КАК ОсновнойВодитель,
	|	втРейсыОтборТ.ВторойОсновнойВодитель КАК ВторойОсновнойВодитель
	|ПОМЕСТИТЬ втСотрудникиРейсы
	|ИЗ
	|	втСотрудники КАК втСотрудникиТ,
	|	втРейсыОтбор КАК втРейсыОтборТ
	|;
	|//{Запрос: 4 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиТ.Сотрудник КАК Сотрудник,
	|	втСотрудникиТ.ГрафикРаботы КАК ГрафикРаботы,
	|	втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы КАК ИспользуетсяИндивидуальныйГрафикРаботы,
	|	МИНИМУМ(втСотрудникиТ.НачалоДняДатаНачала) КАК НачалоДняДатаНачала,
	|	МАКСИМУМ(втСотрудникиТ.КонецДняДатаОкончания) КАК КонецДняДатаОкончания
	|ПОМЕСТИТЬ втГрафикиРаботыПоСотрудникам
	|ИЗ
	|	втСотрудникиРейсы КАК втСотрудникиТ
	|ГДЕ &КонтрольРасписанияРаботыВодителей
	|СГРУППИРОВАТЬ ПО
	|	втСотрудникиТ.Сотрудник,
	|	втСотрудникиТ.ГрафикРаботы,
	|	втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы
	|;
	|//{Запрос: 5 ////////////////////////////////////////
	|// вап3456вс3р Определение расписания работ при помощи механизма БСП.Начало
	|ВЫБРАТЬ
	|	втСотрудникиТ.ГрафикРаботы КАК ГрафикРаботы,
	|	МИНИМУМ(втСотрудникиТ.НачалоДняДатаНачала) КАК НачалоДняДатаНачала,
	|	МАКСИМУМ(втСотрудникиТ.КонецДняДатаОкончания) КАК КонецДняДатаОкончания
	|ПОМЕСТИТЬ втГрафикиРаботы
	|ИЗ
	|	втГрафикиРаботыПоСотрудникам КАК втСотрудникиТ
	|ГДЕ ИСТИНА
	|	И &КонтрольРасписанияРаботыВодителей
	|	И НЕ (втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы)
	|СГРУППИРОВАТЬ ПО
	|	втСотрудникиТ.ГрафикРаботы
	|;
	|//{Запрос: 6 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблонЗаполнения.Ссылка КАК ГрафикРаботы,
	|	МАКСИМУМ(ШаблонЗаполнения.НомерСтроки) КАК ДлинаЦикла
	|ПОМЕСТИТЬ ВТДлинаЦиклаГрафиков
	|ИЗ
	|	Справочник.Календари.ШаблонЗаполнения КАК ШаблонЗаполнения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ШаблонЗаполнения.Ссылка = втГрафикиРаботы.ГрафикРаботы
	|СГРУППИРОВАТЬ ПО
	|	ШаблонЗаполнения.Ссылка
	|;
	|//{Запрос: 7 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПредпраздничныйДень
	|ПОМЕСТИТЬ ВТПредпраздничныеДни
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ИСТИНА
	|		И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = втГрафикиРаботы.ГрафикРаботы
	|		И ДанныеПроизводственногоКалендаря.Дата >= втГрафикиРаботы.НачалоДняДатаНачала
	|		И ДанныеПроизводственногоКалендаря.Дата <= втГрафикиРаботы.КонецДняДатаОкончания
	|		И ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	|;
	|//{Запрос: 8 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втГрафикиРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДатаГрафика,
	|	ДанныеПроизводственногоКалендаря.ДатаПереноса КАК ДатаПереноса
	|ПОМЕСТИТЬ ВТДатыПереноса
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ИСТИНА
	|		И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = втГрафикиРаботы.ГрафикРаботы
	|		И ДанныеПроизводственногоКалендаря.Дата >= втГрафикиРаботы.НачалоДняДатаНачала
	|		И ДанныеПроизводственногоКалендаря.Дата <= втГрафикиРаботы.КонецДняДатаОкончания
	|		И ДанныеПроизводственногоКалендаря.ДатаПереноса <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|//{Запрос: 9 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	КалендарныеГрафики.Календарь КАК ГрафикРаботы,
	|	КалендарныеГрафики.ДатаГрафика КАК ДатаГрафика,
	|	РАЗНОСТЬДАТ(Календари.ДатаОтсчета, КалендарныеГрафики.ДатаГрафика, ДЕНЬ) + 1 КАК ДнейОтДатыОтсчета,
	|	ПредпраздничныеДни.ПредпраздничныйДень КАК ПредпраздничныйДень,
	|	ДатыПереноса.ДатаПереноса КАК ДатаПереноса
	|ПОМЕСТИТЬ ВТДниВключенныеВГрафик
	|ИЗ
	|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботы КАК втГрафикиРаботы
	|	ПО ИСТИНА
	|		И КалендарныеГрафики.Календарь = втГрафикиРаботы.ГрафикРаботы
	|		И КалендарныеГрафики.ДатаГрафика >= втГрафикиРаботы.НачалоДняДатаНачала
	|		И КалендарныеГрафики.ДатаГрафика <= втГрафикиРаботы.КонецДняДатаОкончания
	|		И КалендарныеГрафики.ДеньВключенВГрафик
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	|	ПО Календари.Ссылка = втГрафикиРаботы.ГрафикРаботы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПредпраздничныеДни КАК ПредпраздничныеДни
	|	ПО ИСТИНА
	|		И ПредпраздничныеДни.ГрафикРаботы = КалендарныеГрафики.Календарь
	|		И ПредпраздничныеДни.ДатаГрафика = КалендарныеГрафики.ДатаГрафика
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыПереноса КАК ДатыПереноса
	|	ПО ИСТИНА
	|		И ДатыПереноса.ГрафикРаботы = КалендарныеГрафики.Календарь
	|		И ДатыПереноса.ДатаГрафика = КалендарныеГрафики.ДатаГрафика
	|;
	|//{Запрос: 10 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|	ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ДниВключенныеВГрафик.РезультатДеленияПоМодулю = 0
	|			ТОГДА ДниВключенныеВГрафик.ДлинаЦикла
	|		ИНАЧЕ ДниВключенныеВГрафик.РезультатДеленияПоМодулю
	|	КОНЕЦ КАК НомерДня,
	|	ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень
	|ПОМЕСТИТЬ ВТДатыНомераДней
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|		ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|		ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень,
	|		ДниВключенныеВГрафик.ДлинаЦикла КАК ДлинаЦикла,
	|		ДниВключенныеВГрафик.ДнейОтДатыОтсчета - ДниВключенныеВГрафик.ЦелаяЧастьРезультатаДеления * ДниВключенныеВГрафик.ДлинаЦикла КАК РезультатДеленияПоМодулю
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|			ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|			ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень,
	|			ДниВключенныеВГрафик.ДнейОтДатыОтсчета КАК ДнейОтДатыОтсчета,
	|			ДлинаЦиклов.ДлинаЦикла КАК ДлинаЦикла,
	|			(ВЫРАЗИТЬ(ДниВключенныеВГрафик.ДнейОтДатыОтсчета / ДлинаЦиклов.ДлинаЦикла КАК ЧИСЛО(15, 0))) - ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ДниВключенныеВГрафик.ДнейОтДатыОтсчета / ДлинаЦиклов.ДлинаЦикла КАК ЧИСЛО(15, 0))) > ДниВключенныеВГрафик.ДнейОтДатыОтсчета / ДлинаЦиклов.ДлинаЦикла
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ КАК ЦелаяЧастьРезультатаДеления
	|		ИЗ
	|			ВТДниВключенныеВГрафик КАК ДниВключенныеВГрафик
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	|			ПО ИСТИНА
	|				И ДниВключенныеВГрафик.ГрафикРаботы = Календари.Ссылка
	|				И Календари.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияГрафикаРаботы.ПоЦикламПроизвольнойДлины)
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДлинаЦиклаГрафиков КАК ДлинаЦиклов
	|			ПО ДниВключенныеВГрафик.ГрафикРаботы = ДлинаЦиклов.ГрафикРаботы) КАК ДниВключенныеВГрафик) КАК ДниВключенныеВГрафик
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|	ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|	ВЫБОР
	|		КОГДА ДниВключенныеВГрафик.ДатаПереноса ЕСТЬ NULL
	|			ТОГДА ДЕНЬНЕДЕЛИ(ДниВключенныеВГрафик.ДатаГрафика)
	|		ИНАЧЕ ДЕНЬНЕДЕЛИ(ДниВключенныеВГрафик.ДатаПереноса)
	|	КОНЕЦ КАК НомерДня,
	|	ДниВключенныеВГрафик.ПредпраздничныйДень КАК ПредпраздничныйДень
	|ИЗ
	|	ВТДниВключенныеВГрафик КАК ДниВключенныеВГрафик
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Календари КАК Календари
	|	ПО ДниВключенныеВГрафик.ГрафикРаботы = Календари.Ссылка
	|ГДЕ Календари.СпособЗаполнения = ЗНАЧЕНИЕ(Перечисление.СпособыЗаполненияГрафикаРаботы.ПоНеделям)
	|;
	|//{Запрос: 11 ////////////////////////////////////////
	|// Определение расписания работ при помощи механизма БСП.Окончание
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДниВключенныеВГрафик.ГрафикРаботы КАК ГрафикРаботы,
	|	ДниВключенныеВГрафик.ДатаГрафика КАК ДатаГрафика,
	|	ДниВключенныеВГрафик.НомерДня КАК НомерДня,
	|	ДОБАВИТЬКДАТЕ(ДниВключенныеВГрафик.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ЕСТЬNULL(РасписанияРаботыПредпраздничногоДня.ВремяНачала, РасписанияРаботы.ВремяНачала), СЕКУНДА)) КАК ДатаНачала,
	|	ДОБАВИТЬКДАТЕ(ДниВключенныеВГрафик.ДатаГрафика, СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), ЕСТЬNULL(РасписанияРаботыПредпраздничногоДня.ВремяОкончания, РасписанияРаботы.ВремяОкончания), СЕКУНДА)) КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРасписанияРаботы
	|ИЗ
	|	ВТДатыНомераДней КАК ДниВключенныеВГрафик
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Календари.РасписаниеРаботы КАК РасписанияРаботы
	|	ПО ИСТИНА
	|		И РасписанияРаботы.Ссылка = ДниВключенныеВГрафик.ГрафикРаботы
	|		И РасписанияРаботы.НомерДня = ДниВключенныеВГрафик.НомерДня
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Календари.РасписаниеРаботы КАК РасписанияРаботыПредпраздничногоДня
	|	ПО ИСТИНА
	|		И РасписанияРаботыПредпраздничногоДня.Ссылка = ДниВключенныеВГрафик.ГрафикРаботы
	|		И РасписанияРаботыПредпраздничногоДня.НомерДня = 0
	|		И ДниВключенныеВГрафик.ПредпраздничныйДень
	|;
	|//{Запрос: 12 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикиРаботы.Сотрудник КАК Сотрудник,
	|	ГрафикиРаботы.Период КАК ДатаГрафика,
	|	ГрафикиРаботы.ДатаНачала КАК ДатаНачала,
	|	ГрафикиРаботы.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРасписанияРаботыИндивидуальныеГрафики
	|ИЗ
	|	РегистрСведений.упГрафикиРаботыСотрудников КАК ГрафикиРаботы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрафикиРаботыПоСотрудникам КАК втСотрудники
	|	ПО ИСТИНА
	|		И &КонтрольРасписанияРаботыВодителей
	|		И ГрафикиРаботы.Сотрудник = втСотрудники.Сотрудник
	|		И втСотрудники.ИспользуетсяИндивидуальныйГрафикРаботы
	|		И ГрафикиРаботы.Период <= втСотрудники.КонецДняДатаОкончания
	|		И ГрафикиРаботы.Период >= втСотрудники.НачалоДняДатаНачала
	|;
	|//{Запрос: 13 ////////////////////////////////////////
	|// вап3456вс32 Склеивание периодов по дням в непрерывные периоды.Начало
	|ВЫБРАТЬ
	|	втСотрудникиТ.Сотрудник КАК Сотрудник,
	|	ВТРасписанияРаботыТ.ДатаГрафика КАК Период,
	|	ВТРасписанияРаботыТ.ДатаНачала КАК ДатаНачала,
	|	ВТРасписанияРаботыТ.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ втПериодыРаботы
	|ИЗ
	|	втГрафикиРаботыПоСотрудникам КАК втСотрудникиТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК ВТРасписанияРаботыТ
	|	ПО ИСТИНА
	|		И ВТРасписанияРаботыТ.ГрафикРаботы = втСотрудникиТ.ГрафикРаботы
	|		И НЕ (втСотрудникиТ.ИспользуетсяИндивидуальныйГрафикРаботы)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.Сотрудник КАК Сотрудник,
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.ДатаГрафика КАК Период,
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.ДатаНачала КАК ДатаНачала,
	|	ВТРасписанияРаботыИндивидуальныеГрафикиТ.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	ВТРасписанияРаботыИндивидуальныеГрафики КАК ВТРасписанияРаботыИндивидуальныеГрафикиТ
	|;
	|//{Запрос: 14 ////////////////////////////////////////
	|// Для каждого периода определяется есть ли для него
	|// следующий(начало которого совпадает с окончанием
	|// текущего) и предыдущий(окончания которого
	|// совпадает с началом текущего)
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА втПериоды2.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПредыдущийПериодКонецРавен,
	|	// Имеется предыдущий период
	|	// Имеется следующий период
	|	ВЫБОР
	|		КОГДА втПериоды3.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СледующийПериодНачалоРавен
	|ПОМЕСТИТЬ втПериодыПодготовка
	|ИЗ
	|	втПериодыРаботы КАК втПериоды
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыРаботы КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды.Период = втПериоды2.Период
	|		И втПериоды.ДатаНачала = втПериоды2.ДатаОкончания
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыРаботы КАК втПериоды3
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды3.Сотрудник
	|		И втПериоды.Период = втПериоды3.Период
	|		И втПериоды.ДатаОкончания = втПериоды3.ДатаНачала
	|;
	|//{Запрос: 15 ////////////////////////////////////////
	|// Периоды по дням с объедененными интервалами по времени.
	|// Здесь нет периодов по которым объединять нечего.
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	МИНИМУМ(втПериоды2.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ втОбъединенныеВремена
	|ИЗ
	|	втПериодыПодготовка КАК втПериоды
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериодыПодготовка КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды.Период = втПериоды2.Период
	|		И втПериоды2.ДатаНачала > втПериоды.ДатаНачала
	|		И втПериоды.СледующийПериодНачалоРавен
	|		И втПериоды2.ПредыдущийПериодКонецРавен
	|		И НЕ (втПериоды2.СледующийПериодНачалоРавен)
	|		И НЕ (ИСТИНА
	|			И втПериоды.ПредыдущийПериодКонецРавен = ИСТИНА
	|			И втПериоды.СледующийПериодНачалоРавен = ИСТИНА)
	|СГРУППИРОВАТЬ ПО
	|	втПериоды.Сотрудник,
	|	втПериоды.Период,
	|	втПериоды.ДатаНачала
	|;
	|//{Запрос: 16 ////////////////////////////////////////
	|// Объединение периодов-дней с объединенными временными
	|// интервалами и периодов-дней по которым объединенять нечего
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ втПериодыВремена
	|ИЗ
	|	втПериодыПодготовка КАК втПериоды
	|ГДЕ ИСТИНА
	|	И втПериоды.ПредыдущийПериодКонецРавен = ЛОЖЬ
	|	И втПериоды.СледующийПериодНачалоРавен = ЛОЖЬ
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втОбъединенныеВремена.Сотрудник КАК Сотрудник,
	|	втОбъединенныеВремена.Период КАК Период,
	|	втОбъединенныеВремена.ДатаНачала КАК ДатаНачала,
	|	втОбъединенныеВремена.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	втОбъединенныеВремена КАК втОбъединенныеВремена
	|;
	|//{Запрос: 17 ////////////////////////////////////////
	|// Для каждого периода определяется:
	|// Оканчивается ли он в 23:59:59
	|// Длится ли он целые сутки
	|// Имеется ли следующий период, который начинается в 00:00:00 следующего дня
	|// Имеется ли предыдущий период, который оканичивается в 23:59:29 предыдущего дня
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.Период КАК Период,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания,
	|	ВЫБОР
	|		КОГДА КОНЕЦПЕРИОДА(втПериоды.Период, ДЕНЬ) = втПериоды.ДатаОкончания
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоКонцаСуток,
	|	// Дата окончания текущего периода - 23:59:59
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(втПериоды.ДатаНачала, втПериоды.ДатаОкончания, СЕКУНДА) = 86399
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолныеСутки,
	|	// Текущий период длится сутки с 00:00:00 по 23:59:59
	|	ВЫБОР
	|		КОГДА втПериоды2.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПредыдущийПериодДоКонцаСуток,
	|	// У текущего опериода есть предыущий, оканчивающийся в 23:59 предыдущих суток
	|	// У текущего опериода есть следующий, начинающийся в 00:00 следующих суток
	|	ВЫБОР
	|		КОГДА втПериоды3.Период ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СледующийПериодСНачалаСуток
	|ПОМЕСТИТЬ втПериоды
	|ИЗ
	|	втПериодыВремена КАК втПериоды
	|	ЛЕВОЕ СОЕДИНЕНИЕ // Периоды оканчивающиеся в 23:59 предыдущих суток
	|	втПериодыВремена КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды.ДатаНачала = втПериоды.Период
	|		И втПериоды.ДатаНачала = ДОБАВИТЬКДАТЕ(втПериоды2.ДатаОкончания, СЕКУНДА, 1)
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыВремена КАК втПериоды3
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды3.Сотрудник
	|		И ДОБАВИТЬКДАТЕ(втПериоды.ДатаОкончания, СЕКУНДА, 1) = втПериоды3.ДатаНачала
	|		// Периоды начинающиеся в 00:00 следующих суток
	|	
	|;
	|//{Запрос: 18 ////////////////////////////////////////
	|// Периоды длительностью более суток
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	МИНИМУМ(втПериоды2.ДатаОкончания) КАК ДатаОкончания
	|ПОМЕСТИТЬ втОбъединенныеИнтервалы
	|ИЗ
	|	втПериоды КАК втПериоды
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПериоды КАК втПериоды2
	|	ПО ИСТИНА
	|		И втПериоды.Сотрудник = втПериоды2.Сотрудник
	|		И втПериоды2.Период > втПериоды.Период
	|		И втПериоды.ДоКонцаСуток = ИСТИНА
	|		И втПериоды.СледующийПериодСНачалаСуток = ИСТИНА
	|		И НЕ (ИСТИНА
	|			И втПериоды.ПолныеСутки = ИСТИНА
	|			И втПериоды.ПредыдущийПериодДоКонцаСуток = ИСТИНА)
	|		И НЕ (ИСТИНА
	|			И втПериоды2.ПолныеСутки = ИСТИНА
	|			И втПериоды2.СледующийПериодСНачалаСуток = ИСТИНА)
	|СГРУППИРОВАТЬ ПО
	|	втПериоды.Сотрудник,
	|	втПериоды.ДатаНачала
	|;
	|//{Запрос: 19 ////////////////////////////////////////
	|//////////////
	|// Склеивание периодов по дням в непрерывные периоды.Окончание
	|// Объединяются периоды длительностью дент и периоды
	|// длительностью более суток
	|ВЫБРАТЬ
	|	втПериоды.Сотрудник КАК Сотрудник,
	|	втПериоды.ДатаНачала КАК ДатаНачала,
	|	втПериоды.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ втПериодыСотрудникаПоРасписанию
	|ИЗ
	|	втПериоды КАК втПериоды
	|ГДЕ ИСТИНА
	|	И НЕ (ИСТИНА
	|		И втПериоды.Период = втПериоды.ДатаНачала
	|		И втПериоды.ПредыдущийПериодДоКонцаСуток = ИСТИНА)
	|	И НЕ (ИСТИНА
	|		И втПериоды.ДоКонцаСуток
	|		И втПериоды.СледующийПериодСНачалаСуток = ИСТИНА)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втОбъединенныеИнтервалы.Сотрудник КАК Сотрудник,
	|	втОбъединенныеИнтервалы.ДатаНачала КАК ДатаНачала,
	|	втОбъединенныеИнтервалы.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	втОбъединенныеИнтервалы КАК втОбъединенныеИнтервалы
	|;
	|//{Запрос: 20 ////////////////////////////////////////
	|// р566е3
	|ВЫБРАТЬ
	|	Рейсы.Рейс КАК Рейс,
	|	ВТРасписанияРаботы.ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ПодходящиеГрафикиРаботыПоРейсам
	|ИЗ
	|	втРейсыОтбор КАК Рейсы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК ВТРасписанияРаботы
	|	ПО ИСТИНА
	|		И НАЧАЛОПЕРИОДА(Рейсы.ПлановоеНачалоВыполнения, ДЕНЬ) <= ВТРасписанияРаботы.ДатаГрафика
	|		И НАЧАЛОПЕРИОДА(Рейсы.ПлановоеОкончаниеВыполнения, ДЕНЬ) >= ВТРасписанияРаботы.ДатаГрафика
	|		И &КонтрольРасписанияРаботыВодителей
	|СГРУППИРОВАТЬ ПО
	|	Рейсы.Рейс,
	|	ВТРасписанияРаботы.ГрафикРаботы
	|ИМЕЮЩИЕ КОЛИЧЕСТВО(*) - 1 = РАЗНОСТЬДАТ(МАКСИМУМ(Рейсы.ПлановоеНачалоВыполнения), МАКСИМУМ(Рейсы.ПлановоеОкончаниеВыполнения), ДЕНЬ)
	|;
	|//{Запрос: 21 ////////////////////////////////////////
	|// р566е4
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСотрудникиРейсы.Сотрудник КАК Сотрудник,
	|	втСотрудникиРейсы.ТипСотрудника КАК ТипСотрудника,
	|	втСотрудникиРейсы.Перевозчик КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА втСотрудникиРейсы.Сотрудник = втСотрудникиРейсы.ОсновнойВодитель
	|			ТОГДА -1
	|		КОГДА втСотрудникиРейсы.Сотрудник = втСотрудникиРейсы.ВторойОсновнойВодитель
	|			ТОГДА 0
	|		КОГДА втСотрудникиРейсы.Перевозчик = втСотрудникиРейсы.Перевозчик
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок,
	|	втСотрудникиРейсы.ТипТС КАК ТипТС,
	|	втСотрудникиРейсы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втСотрудникиРейсы.Рейс КАК Рейс
	|ПОМЕСТИТЬ втСотрудникиПоРейсам
	|ИЗ
	|	втСотрудникиРейсы КАК втСотрудникиРейсы
	|	ЛЕВОЕ СОЕДИНЕНИЕ втПериодыСотрудникаПоРасписанию КАК втПериодыСотрудникаПоРасписанию
	|	ПО ИСТИНА
	|		И &КонтрольРасписанияРаботыВодителей
	|		И втПериодыСотрудникаПоРасписанию.Сотрудник = втСотрудникиРейсы.Сотрудник
	|		И втСотрудникиРейсы.ДатаНачала <= втПериодыСотрудникаПоРасписанию.ДатаОкончания
	|		И втСотрудникиРейсы.ДатаОкончания >= втПериодыСотрудникаПоРасписанию.ДатаНачала
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упРасписаниеРаботыЭкипажей КАК упРасписаниеРаботыВодителейТ
	|	ПО ИСТИНА
	|		И втСотрудникиРейсы.Сотрудник = упРасписаниеРаботыВодителейТ.Водитель
	|		И (ЛОЖЬ
	|			ИЛИ (ИСТИНА
	|				И втСотрудникиРейсы.ДатаНачала <= упРасписаниеРаботыВодителейТ.ДатаНачала
	|				И втСотрудникиРейсы.ДатаОкончания >= упРасписаниеРаботыВодителейТ.ДатаНачала)
	|			ИЛИ (ИСТИНА
	|				И втСотрудникиРейсы.ДатаНачала <= упРасписаниеРаботыВодителейТ.ДатаОкончания
	|				И втСотрудникиРейсы.ДатаОкончания >= упРасписаниеРаботыВодителейТ.ДатаОкончания)
	|			ИЛИ (ИСТИНА
	|				И втСотрудникиРейсы.ДатаНачала >= упРасписаниеРаботыВодителейТ.ДатаНачала
	|				И втСотрудникиРейсы.ДатаОкончания <= упРасписаниеРаботыВодителейТ.ДатаОкончания))
	|ГДЕ ИСТИНА
	|	И упРасписаниеРаботыВодителейТ.Водитель ЕСТЬ NULL
	|	И (ЛОЖЬ
	|		ИЛИ НЕ (&КонтрольРасписанияРаботыВодителей)
	|		ИЛИ НЕ (втПериодыСотрудникаПоРасписанию.Сотрудник ЕСТЬ NULL))
	|;
	|//{Запрос: 22 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиПоТС.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоТС.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ втТипыНеобходимыхДокументов
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТипыНеобходимыхДокументовПоТС КАК втТипыНеобходимыхДокументов
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втСотрудникиПоТС.ТранспортноеСредство = втТипыНеобходимыхДокументов.ТранспортноеСредство
	|;
	|//{Запрос: 23 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втТипыНеобходимыхДокументов.Сотрудник КАК Сотрудник,
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента,
	|	тбДокументы.Регистратор КАК Регистратор,
	|	тбДокументы.ДействуетПо КАК ДействуетПо,
	|	тбДокументы.ТипДокумента.ИнтервалПредупреждения КАК ИнтервалПредупреждения,
	|	тбДокументы.ТипДокумента.СрокДействия КАК СрокДействия,
	|	тбДокументы.ТипДокумента.ПредупреждатьОбОкончанииСрокаДействия КАК ПредупреждатьОбОкончанииСрокаДействия,
	|	тбДокументы.ТипДокумента.ДокументВыдается КАК ДокументВыдается,
	|	тбДокументы.Регистратор.ДействуетС КАК ДействуетС
	|ПОМЕСТИТЬ втДействующиеДокументы
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упДействующиеДокументыТСВодителей.СрезПоследних КАК тбДокументы
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втТипыНеобходимыхДокументов.ТипДокумента = тбДокументы.ТипДокумента
	|		И (ЛОЖЬ
	|			ИЛИ втТипыНеобходимыхДокументов.ТранспортноеСредство = тбДокументы.ТранспортноеСредство
	|			ИЛИ втТипыНеобходимыхДокументов.Сотрудник = тбДокументы.Водитель)
	|ГДЕ ИСТИНА
	|	И КОНЕЦПЕРИОДА(тбДокументы.ДействуетПо, ДЕНЬ) >= &ТекущаяДата
	|	И НАЧАЛОПЕРИОДА(тбДокументы.Регистратор.ДействуетС, ДЕНЬ) <= &ТекущаяДАта
	|;
	|//{Запрос: 24 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТипыНеобходимыхДокументов.Сотрудник КАК Сотрудник,
	|	втТипыНеобходимыхДокументов.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втТипыНеобходимыхДокументов.ТипДокумента КАК ТипДокумента
	|ПОМЕСТИТЬ втДокументыКоторыхНетВНаличии
	|ИЗ
	|	втТипыНеобходимыхДокументов КАК втТипыНеобходимыхДокументов
	|	ЛЕВОЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|	ПО ИСТИНА
	|		И втТипыНеобходимыхДокументов.Сотрудник = втДействующиеДокументы.Сотрудник
	|		И втТипыНеобходимыхДокументов.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|		И втТипыНеобходимыхДокументов.ТипДокумента = втДействующиеДокументы.ТипДокумента
	|ГДЕ втДействующиеДокументы.ТипДокумента ЕСТЬ NULL
	|;
	|//{Запрос: 25 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втСотрудникиПоРейсам.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втСотрудникиПоТС
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоРейсам
	|;
	|//{Запрос: 26 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втДокументыКоторыхНетВНаличии.Сотрудник КАК Сотрудник,
	|	втДокументыКоторыхНетВНаличии.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втСотрудникиТранспортныеСредстваБезПакетаДокументов
	|ИЗ
	|	втДокументыКоторыхНетВНаличии КАК втДокументыКоторыхНетВНаличии
	|;
	|//{Запрос: 27 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиПоТС.Сотрудник КАК Сотрудник,
	|	втСотрудникиПоТС.ТранспортноеСредство КАК ТранспортноеСредство
	|ПОМЕСТИТЬ втСотрудникиСНеобходимымПакетомДокументов
	|ИЗ
	|	втСотрудникиПоТС КАК втСотрудникиПоТС
	|	ЛЕВОЕ СОЕДИНЕНИЕ втСотрудникиТранспортныеСредстваБезПакетаДокументов КАК втСотрудникиТранспортныеСредстваБезПакетаДокументов
	|	ПО ИСТИНА
	|		И втСотрудникиПоТС.Сотрудник = втСотрудникиТранспортныеСредстваБезПакетаДокументов.Сотрудник
	|		И втСотрудникиПоТС.ТранспортноеСредство = втСотрудникиТранспортныеСредстваБезПакетаДокументов.ТранспортноеСредство
	|ГДЕ ИСТИНА
	|	И &КонтрольДокументов
	|	И втСотрудникиТранспортныеСредстваБезПакетаДокументов.Сотрудник ЕСТЬ NULL
	|;
	|//{Запрос: 28 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСотрудникиПоРейсам.Сотрудник КАК Водитель1,
	|	втСотрудникиПоРейсам.ТипСотрудника КАК ТипСотрудника,
	|	втСотрудникиПоРейсам.Перевозчик КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА втСотрудникиПоРейсам.Перевозчик = ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ втСотрудникиПоРейсам.Перевозчик.РейтингПеревозчика
	|	КОНЕЦ КАК РейтингПеревозчика,
	|	втСотрудникиПоРейсам.Порядок КАК Порядок,
	|	втСотрудникиПоРейсам.Рейс КАК Рейс,
	|	втСотрудникиПоРейсам.ТипТС КАК ТипТС,
	|	втСотрудникиПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоРейсам
	|ГДЕ НЕ (&КонтрольДокументов)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	втСотрудникиПоРейсам.Сотрудник КАК Водитель1,
	|	втСотрудникиПоРейсам.ТипСотрудника КАК ТипСотрудника,
	|	втСотрудникиПоРейсам.Перевозчик КАК Перевозчик,
	|	ВЫБОР
	|		КОГДА втСотрудникиПоРейсам.Перевозчик = ЗНАЧЕНИЕ(Справочник.упПартнеры.ПустаяСсылка)
	|			ТОГДА 0
	|		ИНАЧЕ втСотрудникиПоРейсам.Перевозчик.РейтингПеревозчика
	|	КОНЕЦ КАК РейтингПеревозчика,
	|	втСотрудникиПоРейсам.Порядок КАК Порядок,
	|	втСотрудникиПоРейсам.Рейс КАК Рейс,
	|	втСотрудникиПоРейсам.ТипТС КАК ТипТС,
	|	втСотрудникиПоРейсам.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоРейсам
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудникиСНеобходимымПакетомДокументов КАК втСотрудникиСНеобходимымПакетомДокументов
	|	ПО ИСТИНА
	|		И &КонтрольДокументов
	|		И втСотрудникиПоРейсам.Сотрудник = втСотрудникиСНеобходимымПакетомДокументов.Сотрудник
	|		И втСотрудникиПоРейсам.ТранспортноеСредство = втСотрудникиСНеобходимымПакетомДокументов.ТранспортноеСредство
	|УПОРЯДОЧИТЬ ПО
	|	Рейс,
	|	Порядок
	|;
	|//{Запрос: 29 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДействующиеДокументы.Сотрудник КАК Водитель1,
	|	втДействующиеДокументы.ТранспортноеСредство КАК ТранспортноеСредство,
	|	втДействующиеДокументы.ТипДокумента КАК ТипДокумента,
	|	втДействующиеДокументы.Регистратор КАК Регистратор,
	|	втДействующиеДокументы.ДействуетПо КАК ДействуетПо,
	|	втДействующиеДокументы.ДействуетС КАК ДействуетС,
	|	втДействующиеДокументы.ИнтервалПредупреждения КАК ИнтервалПредупреждения,
	|	втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия КАК ПредупреждатьОбОкончанииСрокаДействия,
	|	втДействующиеДокументы.ДокументВыдается КАК ДокументВыдается
	|ИЗ
	|	втСотрудникиПоРейсам КАК втСотрудникиПоТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДействующиеДокументы КАК втДействующиеДокументы
	|	ПО ИСТИНА
	|		И втСотрудникиПоТС.Сотрудник = втДействующиеДокументы.Сотрудник
	|		И втСотрудникиПоТС.ТранспортноеСредство = втДействующиеДокументы.ТранспортноеСредство
	|ГДЕ ИСТИНА
	|	И втДействующиеДокументы.ПредупреждатьОбОкончанииСрокаДействия
	|	И РАЗНОСТЬДАТ(&ТекущаяДата, втДействующиеДокументы.ДействуетПо, ДЕНЬ) <= втДействующиеДокументы.ИнтервалПредупреждения
	|";



КонецФункции

// Функция - Подбор полного паросочетания по алгоритму Куна.
// 			 Реализация алгоритма взята с сайта http://e-maxx.ru/algo/assignment_hungary.
//
// Параметры:
//  matrix - двумерный массив(для корректной работы должнен быть добавлен фиктивный нулевой столбец и нулевая строка),
//				граф заданный матрицей.
//
// Возвращаемое значение:
//	 Массив - массив в котором для каждой строки i(индекс) хранится номер выбранного в ней столбца.
//
Функция ВенгерскийАлгоритм(matrix) Экспорт 
	
	INF = ЗначениеБесконечности();
	n = matrix.Количество()-1;		// Количество строк.
	m = matrix[0].Количество()-1; 	// Количество столбцов.
	ans  = СоздатьМассив(n+1,0);
	
	Если m < n Тогда
		
		Возврат ans;
	КонецЕсли;
	
	u = СоздатьМассив(n+1,0);		// Потенциалы.
	v = СоздатьМассив(m+1,0);		// Потенциалы.
	p = СоздатьМассив(m+1,0);		// Паросочетания для каждого столбца.
	way = СоздатьМассив(m+1, 0);	// Информация о том где достигаются минимумы, чтобы впоследствии смогли восстановить увеличивающую цепочкун.
	
	// Цикл по строкам.
	Для i = 1 По n Цикл
		
		p[0] = i;
		j0=0;
		minv 	= СоздатьМассив(m+1,INF); 	// Для каждого столбца j вспомогательные минимумы, необходимые для быстрого пересчёта потенциала.
		used	= СоздатьМассив(m+1, Ложь); // Хранятся задействованные столбцы.
		
		Пока Истина Цикл
			used[j0] = Истина;
			i0 = p[j0];
			delta = INF;
			j1 = 0;
			
			// Цикл по столбцам.
			// Ищется свободный столбец.
			Для j = 1 По m Цикл
				Если НЕ used[j] Тогда
					cur = matrix[i0][j] - u[i0] - v[j];
					Если cur<minv[j] Тогда
						minv[j] = cur;
						way[j] 	= j0;
					КонецЕсли;
					Если minv[j] < delta Тогда
						delta 	= minv[j];
						j1 		= j;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Для j = 0 По m Цикл
				Если used[j] Тогда
					u[p[j]] = u[p[j]] + delta;
					v[j] 	= v[j] - delta;
				Иначе
					minv[j] = minv[j] - delta;
				КонецЕсли;
			КонецЦикла;
			j0 = j1;
			Если p[j0] = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Пока Истина Цикл
			j1 		= Way[j0];
			p[j0] 	= p[j1];
			j0 		= j1;
			Если j0 = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	Для j=1 По m Цикл
		ans[p[j]] = j;	
	КонецЦикла;
	
	Возврат ans;
	
КонецФункции // ВенгерскийАлгоритм()

// Функция - Создать массив.
//
// Параметры:
//  Размерность - Число - Количество элементов массива.
//  ЗначениеПоУмолчанию	 - Строка - значение которым по умолчанию заполняется массив.
// 
// Возвращаемое значение:
//  Массив - Результат обработки.
//
Функция СоздатьМассив(Размерность, ЗначениеПоУмолчанию) 
	
	мсвРезультат = Новый Массив(Размерность);
	
	Для й=0 По Размерность-1 Цикл
		мсвРезультат[й] = ЗначениеПоУмолчанию;
	КонецЦикла;

	Возврат мсвРезультат;	

КонецФункции // СоздатьМассив()

// Функция - Возвращает трассировку решения, собранную на основании исходной матрицы назначений,
//				решения и сообщений диагностики.
//
// Параметры:
//  тбзОбъектыНазначения - ТаблицаЗначений - список объектов назначения на рейсы,
//					либо транспортные средства, либо типы ТС.
//  Рейсы				 - ТаблицаЗначений - список рейсов для назначений.
//  мсвМатрицаНазначений - Массив		   - матрица назначений.
//  мсвРешение			 - Массив		   - решение задачи о назначениях.
//  мсвСообщений		 - Массив		   - диагностические сообщения в ходе решения задачи о назначениях.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - сформированная трассировка.
//
Функция ТрассировкаРешения(тбзОбъектыНазначения, Рейсы, мсвМатрицаНазначений, мсвРешение, мсвСообщений) Экспорт
	
	текРезультатТрассировки = Новый ТабличныйДокумент;
	
	Макет = Обработки.упРМНазначенияТСНаРейсы.ПолучитьМакет("РезультатТрассировки");
		
	// Заголовок.
	Заголовок = Макет.ПолучитьОбласть("ЗаголовокМатрицыНазначений");
	текРезультатТрассировки.Вывести(Заголовок);
		
	// Шапка матрицы.
	ЗаголовокПустой = Макет.ПолучитьОбласть("ЗаголовокРейс|Заголовок");
	текРезультатТрассировки.Вывести(ЗаголовокПустой);
	
	Для каждого текСтрокаОбъектаНазначения Из тбзОбъектыНазначения Цикл
		ЗаголовокТранспортноеСредство = Макет.ПолучитьОбласть("ЗаголовокОбъект|Заголовок");
		ЗаголовокТранспортноеСредство.Параметры.ТранспортноеСредство 	= текСтрокаОбъектаНазначения.Объект;
		ЗаголовокТранспортноеСредство.Области.ТСШапка.Расшифровка 		= текСтрокаОбъектаНазначения.Объект;
		текРезультатТрассировки.Присоединить(ЗаголовокТранспортноеСредство);
	КонецЦикла;
		
	ЗаголовокРешение = Макет.ПолучитьОбласть("Решение|Заголовок");
	текРезультатТрассировки.Присоединить(ЗаголовокРешение);
	
	текКоличествоОбъектовНазначения = тбзОбъектыНазначения.Количество();
	текКоличествоРейсов				= Рейсы.Количество();
	INF								= ЗначениеБесконечности();
	
	// Заполнение матрицы.
	Для й = 1 По текКоличествоРейсов Цикл
			
		текСтрокаРейс	= Рейсы.Получить(й-1);
		текРейс 		= текСтрокаРейс.Рейс;
		
		// Заголовок рейса.
		ЗаголовокРейс	= Макет.ПолучитьОбласть("ЗаголовокРейс|Строка");
		ЗаголовокРейс.Параметры.Рейс = текРейс;
		ОбластьРейса 				 = ЗаголовокРейс.Области.Рейс;
		ОбластьРейса.Расшифровка 	 = текРейс;
			
		текРезультатТрассировки.Вывести(ЗаголовокРейс);
		
		текРезультатТрассировки.НачатьГруппуСтрок(,Ложь);
		
		// Определение решения по конкретному рейсу.
		Если текКоличествоОбъектовНазначения > текКоличествоРейсов Тогда
			текПозицияРешения = мсвРешение[й];
		Иначе	
			текПозицияРешения = Неопределено;
		КонецЕсли;
		
		текОбъект = Неопределено;
		
		// Заполнение рейтингов по рейсу.
		Для ц = 1 По текКоличествоОбъектовНазначения Цикл
			
			текРейтинг = мсвМатрицаНазначений[й][ц];
			
			// Решение по рейсу.
			Если текПозицияРешения = Неопределено Тогда
				Если й = мсвРешение[ц] Тогда
					Если НЕ текРейтинг = INF Тогда
						текОбъектНазначения = тбзОбъектыНазначения.Получить(ц-1).Объект;
					КонецЕсли;	
					СтрокаРейтинг = Макет.ПолучитьОбласть("ЗаголовокОбъект|СтрокаРешение");
				Иначе	
					СтрокаРейтинг = Макет.ПолучитьОбласть("ЗаголовокОбъект|Строка"); 				
				КонецЕсли;	
			Иначе
				Если ц = текПозицияРешения Тогда
					Если НЕ текРейтинг = INF Тогда
						текОбъектНазначения = тбзОбъектыНазначения.Получить(ц-1).Объект;
					КонецЕсли;	
					СтрокаРейтинг = Макет.ПолучитьОбласть("ЗаголовокОбъект|СтрокаРешение");
				Иначе	
					СтрокаРейтинг = Макет.ПолучитьОбласть("ЗаголовокОбъект|Строка"); 				
				КонецЕсли;
			КонецЕсли;
			
			// Рейтинг по рейсу.
			Если текРейтинг = INF Тогда
				СтрокаРейтинг.Параметры.Рейтинг = "inf";
			Иначе
				СтрокаРейтинг.Параметры.Рейтинг = мсвМатрицаНазначений[й][ц];
			КонецЕсли;
			
			текРезультатТрассировки.Присоединить(СтрокаРейтинг);
		КонецЦикла;
		
		// Вывод решения по рейсу.
		СтрокаРешение = Макет.ПолучитьОбласть("Решение|Строка");
		СтрокаРешение.Параметры.Объект = текОбъектНазначения;
		текРезультатТрассировки.Присоединить(СтрокаРешение);
		
		// Вывод комментариев причин не выбора ТС.
		мсвСообщенийТрассировки = мсвСообщений[й-1];
		Для каждого текСообщение Из мсвСообщенийТрассировки Цикл
			СтрокаКомментарий 	= Макет.ПолучитьОбласть("СтрокаРейсКомментарий");
			СтрокаКомментарий.Параметры.Комментарий 			= текСообщение.Сообщение;
			СтрокаКомментарий.Области.Комментарий.Расшифровка 	= текСообщение.Объект;
			текРезультатТрассировки.Вывести(СтрокаКомментарий);
		КонецЦикла;
		текРезультатТрассировки.ЗакончитьГруппуСтрок();
		
	КонецЦикла;
	Пояснение = Макет.ПолучитьОбласть("Пояснение");
	текРезультатТрассировки.Присоединить(Пояснение);

	Возврат текРезультатТрассировки;
	
КонецФункции	

// Функция - Получить значение бесконечности.
// 
// Возвращаемое значение:
//  Число - заданное значение, представляемое собой максимально возможное значение.
//
Функция ЗначениеБесконечности()

	Возврат 9999999999999;	

КонецФункции // ПолучитьЗначениеБесконечности()

#КонецОбласти