#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		Для Каждого Строка1 Из Связи Цикл
			Для Каждого Строка2 Из Связи Цикл
				Если Истина
					И Строка1.ЗависимыйТипГруза = Строка2.ОсновнойТипГруза
					И Строка1.ОсновнойТипГруза = Строка2.ЗависимыйТипГруза
				Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр(СтрШаблон("ru='Нельзя добавлять зеркальные пары типов в связи (%1 -> %2)'", Строка1.ОсновнойТипГруза, Строка1.ЗависимыйТипГруза)),
						Ссылка,,, Отказ);
				КонецЕсли; 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 