#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	мсвДокументСсылка = ОбработатьПрерыванияГрузовыхПотоков(ПараметрКоманды, ТекстОшибки, Отказ);
	
	Если Не Отказ Тогда
		Для каждого ДокументСсылка Из мсвДокументСсылка Цикл
			ОткрытьФорму("Документ.упКорректировкаЭтаповПеревозки.ФормаОбъекта", Новый Структура("Ключ", ДокументСсылка), ПараметрыВыполненияКоманды.Источник);
		КонецЦикла;
	Иначе
		Если ТекстОшибки = "" Тогда
			ТекстОшибки = НСтр("ru = 'При обработке прерываний грузовых потоков произошли ошибки.'");		    
		КонецЕсли; 
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбработатьПрерыванияГрузовыхПотоков(ЗаявкиНаПеревозкуГруза, ТекстОшибки, Отказ)
	
	Возврат Документы.упКорректировкаЭтаповПеревозки.ОбработатьПрерыванияГрузовыхПотоков(ЗаявкиНаПеревозкуГруза, ТекстОшибки, Отказ);
	
КонецФункции

#КонецОбласти 