#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ)
			И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		 упУправленияЗаявками.ЗаполнитьЭтапыОплатыТЧСхемыПоУмолчанию(Объект.ЭтапыОплаты);	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ЭтапыОплатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОплатыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УчетОтсрочкиПриИзменении(Элемент)
	ОбновитьВидимость();
	Если Объект.УчетОтсрочки = ПредопределенноеЗначение("Перечисление.упСпособыУчетаОтсрочки.ПоРабочимДням") Тогда
		Объект.ПроизводственныйКалендарь = ПодобратьПроизводственныйКалендарь();	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПодобратьПроизводственныйКалендарь()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПроизводственныеКалендари.Ссылка
	                      |ИЗ
	                      |	Справочник.ПроизводственныеКалендари КАК ПроизводственныеКалендари");
                     
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ПроизводственныеКалендари.ПустаяСсылка()
	КонецЕсли; 

КонецФункции // ПодобратьПроизводственныйКалендарь()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимость()
	Элементы.ПроизводственныйКалендарь.Видимость = (Объект.УчетОтсрочки = ПредопределенноеЗначение("Перечисление.упСпособыУчетаОтсрочки.ПоРабочимДням"));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Нет.
	
#КонецОбласти
