
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор, ЗаголовокФормы", Новый Структура("ТипРасчета",ПредопределенноеЗначение("Перечисление.упТипРасчета.Топливо")), "Правила расчета норм топлива");
	ОткрытьФорму("Справочник.упПравилаРасчета.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "Топливо", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти 