
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	сткПараметрыРейса = ЕстьВозможностьСформироватьОтчетИнкассатора(ПараметрКоманды, ТекстОшибки, Отказ);
	
	Если Не Отказ Тогда
			ПараметрыФормы = Новый Структура("Рейс, Водитель", ПараметрКоманды, сткПараметрыРейса.Водитель);
			ОткрытьФорму("Документ.упЗаявкаНаПеревозкуГруза.Форма.ФормаПодбораЗаявок", 
			ПараметрыФормы, 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, 
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ПараметрКоманды);
		
		Если ТекстОшибки = "" Тогда
			ТекстОшибки = НСтр("ru = 'Документы не сформированы.'");		    
		КонецЕсли; 
		//ПоказатьПредупреждение(, ТекстОшибки);
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЕстьВозможностьСформироватьОтчетИнкассатора(Рейс, ТекстСообщения, Отказ)
	
	Возврат Документы.упРейс.ЕстьВозможностьСформированияОтчетИнкассатораПоРейсу(Рейс, ТекстСообщения, Отказ);
	
КонецФункции

#КонецОбласти 