
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.упРежимыРаботыОборудования.ФормаСписка",
	              ПараметрыФормы,
				  ПараметрыВыполненияКоманды.Источник,
				  ПараметрыВыполненияКоманды.Уникальность,
				  ПараметрыВыполненияКоманды.Окно,
				  ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти 