
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура производит первоначальное заполнение предопределенных элементов справочника.
//
// Параметры:
//  Параметры  - Структура - Параметры.
//
Процедура ПервоначальноеЗаполнение(Параметры = Неопределено) Экспорт
	
	текЭлемент = Справочники.упМоделиТрекеров.УстройствоAndroid.ПолучитьОбъект();
	текЭлемент.ТипУстройства           = Перечисления.упТипУстройства.АндроидКлиент;
	текЭлемент.ПередаетТекущуюСкорость = Истина;
	текЭлемент.Записать();
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли
	
