#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ПараметрыПеревозки);
	
	Элементы.ВариантОпределенияВременногоОкнаОтправления.Видимость 	= ОпределятьВременныеОкнаЗаданий;
	Элементы.ВариантОпределенияВременногоОкнаПолучения.Видимость 	= ОпределятьВременныеОкнаЗаданий;
	Элементы.ГруппаВремяНахожденияВТочке.Видимость 				= ОпределятьВременныеОкнаЗаданий;
	Элементы.ГрафикРаботыАдресаОтправления.Видимость				= ОпределятьВременныеОкнаЗаданий И ФормироватьВременныеОкнаПоГрафикамРаботыАдресов;
	Элементы.ГрафикРаботыАдресаПолучения.Видимость				= ОпределятьВременныеОкнаЗаданий И ФормироватьВременныеОкнаПоГрафикамРаботыАдресов;
	
	Если ОпределятьВременныеОкнаЗаданий Тогда
		Если НЕ ЗначениеЗаполнено(ВариантОпределенияВременногоОкнаПолучения) Тогда
			ВариантОпределенияВременногоОкнаПолучения 	= Перечисления.упВариантыОпределенияВременныхОкон.ПолноеОграничение;
			ВариантОпределенияВременногоОкнаОтправления 	= Перечисления.упВариантыОпределенияВременныхОкон.ПолноеОграничение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	КонтрагентПолучателя = ПолучитьОсновногоКонтрагента(Получатель);		
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	КонтрагентОтправителя = ПолучитьОсновногоКонтрагента(Отправитель);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	сткРезультат = Новый Структура;
	сткРезультат.Вставить("Отправитель");
	сткРезультат.Вставить("Получатель");
	сткРезультат.Вставить("КонтактноеЛицоОтправителя");
	сткРезультат.Вставить("КонтактноеЛицоПолучателя");
	сткРезультат.Вставить("КонтрагентОтправителя");
	сткРезультат.Вставить("КонтрагентПолучателя");
	сткРезультат.Вставить("НомерСтроки");
	сткРезультат.Вставить("ВремяВПути");
	сткРезультат.Вставить("ЧасовойПояс");
	сткРезультат.Вставить("ВремяНахожденияВТочке");
	сткРезультат.Вставить("ВариантОпределенияВременногоОкнаПолучения");
	сткРезультат.Вставить("ГрафикРаботыАдресаПолучения");
	сткРезультат.Вставить("ВариантОпределенияВременногоОкнаОтправления");
	сткРезультат.Вставить("ГрафикРаботыАдресаОтправления");
	ЗаполнитьЗначенияСвойств(сткРезультат, ЭтаФорма);
	Закрыть(сткРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ПолучитьОсновногоКонтрагента(Партнер)
	Возврат Справочники.упКонтрагенты.ПолучитьОсновногоКонтрагента(Партнер);	
КонецФункции

#КонецОбласти


