
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает значение по умолчанию.
//
// Параметры:
//  Значение  - СправочникиСсылка.упВидыПеревозок - ссылка на элемент.
//
// Возвращаемое значение:
//   СправочникиСсылка.упВидыПеревозок - Результат выполнения.
//
Функция ЗначениеПоУмолчанию(Значение = Неопределено) Экспорт
	
	Если Значение = Неопределено Тогда 
		Значение = Перечисления.упТопливныеКомпании.Лукойл;
	КонецЕсли;	
	
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#КонецЕсли
	