
Процедура ПолучитьСписокЗонИРодителей(ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	ШаблонСДанными = ПолучитьСписокЗонИРодителейЗапрос();
	АдресХранилища = ПоместитьВоВременноеХранилище(ШаблонСДанными, АдресХранилища);
	
КонецПроцедуры



Функция ПолучитьСписокЗонИРодителейЗапрос() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ упГеографическиеЗоныПолигон.НомерСтроки) КАК КоличествоСтрок,
	               |	упГеографическиеЗоныПолигон.Ссылка.Ссылка
	               |ПОМЕСТИТЬ втВсеГеозоны
	               |ИЗ
	               |	Справочник.упГеографическиеЗоны.Полигон КАК упГеографическиеЗоныПолигон
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упГеографическиеЗоныПолигон.Ссылка.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втВсеГеозоны.Ссылка КАК Зона
	               |ПОМЕСТИТЬ втГеокодированны
	               |ИЗ
	               |	втВсеГеозоны КАК втВсеГеозоны
	               |ГДЕ
	               |	втВсеГеозоны.КоличествоСтрок > 2
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	упИерархияГеографическихЗон.Зона КАК Зона,
	               |	упИерархияГеографическихЗон.Родитель,
	               |	упИерархияГеографическихЗон.Уровень КАК Уровень
	               |ПОМЕСТИТЬ втЗоныРодителиУровни
	               |ИЗ
	               |	РегистрСведений.упИерархияГеографическихЗон КАК упИерархияГеографическихЗон,
	               |	втГеокодированны КАК втГеокодированны
	               |ГДЕ
	               |	упИерархияГеографическихЗон.Зона <> упИерархияГеографическихЗон.Родитель
	               |	И упИерархияГеографическихЗон.Зона В
	               |			(ВЫБРАТЬ
	               |				втГеокодированны.Зона
	               |			ИЗ
	               |				втГеокодированны КАК втГеокодированны)
	               |	И упИерархияГеографическихЗон.Родитель В
	               |			(ВЫБРАТЬ
	               |				втГеокодированны.Зона
	               |			ИЗ
	               |				втГеокодированны КАК втГеокодированны)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(втЗоныРодителиУровни.Уровень) КАК Уровень,
	               |	втЗоныРодителиУровни.Зона
	               |ПОМЕСТИТЬ втМаксимальныеУровни
	               |ИЗ
	               |	втЗоныРодителиУровни КАК втЗоныРодителиУровни
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втЗоныРодителиУровни.Зона
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	втЗоныРодителиУровни.Зона,
	               |	втЗоныРодителиУровни.Родитель
	               |ПОМЕСТИТЬ втЗоныИРодители
	               |ИЗ
	               |	втЗоныРодителиУровни КАК втЗоныРодителиУровни
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаксимальныеУровни КАК втМаксимальныеУровни
	               |		ПО втЗоныРодителиУровни.Уровень = втМаксимальныеУровни.Уровень
	               |			И втЗоныРодителиУровни.Зона = втМаксимальныеУровни.Зона
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упГеографическиеЗоныПолигон.Широта,
	               |	упГеографическиеЗоныПолигон.Долгота,
	               |	втЗоныИРодители.Зона,
	               |	втЗоныИРодители.Родитель
	               |ПОМЕСТИТЬ втТочки
	               |ИЗ
	               |	Справочник.упГеографическиеЗоны.Полигон КАК упГеографическиеЗоныПолигон
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗоныИРодители КАК втЗоныИРодители
	               |		ПО упГеографическиеЗоныПолигон.Ссылка.Ссылка = втЗоныИРодители.Зона
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упГеографическиеЗоныПолигон.Ссылка КАК Зона,
	               |	КОЛИЧЕСТВО(упГеографическиеЗоныПолигон.НомерСтроки) КАК Количество,
	               |	МИНИМУМ(упГеографическиеЗоныПолигон.Широта) КАК Широта_Мин,
	               |	МАКСИМУМ(упГеографическиеЗоныПолигон.Широта) КАК Широта_Макс,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан
	               |				ТОГДА ВЫБОР
	               |						КОГДА упГеографическиеЗоныПолигон.Долгота < 0
	               |							ТОГДА 360 + упГеографическиеЗоныПолигон.Долгота
	               |						ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |					КОНЕЦ
	               |			ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |		КОНЕЦ) КАК Долгота_Мин,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан
	               |				ТОГДА ВЫБОР
	               |						КОГДА упГеографическиеЗоныПолигон.Долгота < 0
	               |							ТОГДА 360 + упГеографическиеЗоныПолигон.Долгота
	               |						ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |					КОНЕЦ
	               |			ИНАЧЕ упГеографическиеЗоныПолигон.Долгота
	               |		КОНЕЦ) КАК Долгота_Макс,
	               |	упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан КАК Меридиан_180
	               |ПОМЕСТИТЬ втПолигонПараметры
	               |ИЗ
	               |	Справочник.упГеографическиеЗоны.Полигон КАК упГеографическиеЗоныПолигон,
	               |	втЗоныИРодители КАК втЗоныИРодители
	               |ГДЕ
	               |	упГеографическиеЗоныПолигон.Ссылка.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втЗоныИРодители.Родитель
	               |			ИЗ
	               |				втЗоныИРодители КАК втЗоныИРодители)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	упГеографическиеЗоныПолигон.Ссылка,
	               |	упГеографическиеЗоныПолигон.Ссылка.ПроходитЧерез180Меридиан
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Точки.Зона КАК ЗонаТочки,
	               |	Точки.Родитель КАК Родитель,
	               |	Точки.Широта,
	               |	Точки.Долгота
	               |ПОМЕСТИТЬ ТочкиНаходятсяВЗонеРодителя
	               |ИЗ
	               |	втПолигонПараметры КАК втПолигонПараметры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТочки КАК Точки
	               |		ПО (ВЫБОР
	               |				КОГДА втПолигонПараметры.Меридиан_180
	               |					ТОГДА ВЫБОР
	               |							КОГДА Точки.Долгота < 0
	               |								ТОГДА 360 + Точки.Долгота
	               |							ИНАЧЕ Точки.Долгота
	               |						КОНЕЦ
	               |				ИНАЧЕ Точки.Долгота
	               |			КОНЕЦ МЕЖДУ втПолигонПараметры.Долгота_Мин И втПолигонПараметры.Долгота_Макс)
	               |			И (Точки.Широта МЕЖДУ втПолигонПараметры.Широта_Мин И втПолигонПараметры.Широта_Макс)
	               |			И втПолигонПараметры.Зона = Точки.Родитель
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ТочкиНаходятсяВЗонеРодителя.ЗонаТочки, """") = """"
	               |			ТОГДА втТочки.Зона
	               |	КОНЕЦ КАК Зона
	               |ПОМЕСТИТЬ втНевошедшиеЗоны
	               |ИЗ
	               |	втТочки КАК втТочки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТочкиНаходятсяВЗонеРодителя КАК ТочкиНаходятсяВЗонеРодителя
	               |		ПО втТочки.Широта = ТочкиНаходятсяВЗонеРодителя.Широта
	               |			И втТочки.Долгота = ТочкиНаходятсяВЗонеРодителя.Долгота
	               |			И втТочки.Родитель = ТочкиНаходятсяВЗонеРодителя.Родитель
	               |			И втТочки.Зона = ТочкиНаходятсяВЗонеРодителя.ЗонаТочки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втЗоныИРодители.Зона,
	               |	втЗоныИРодители.Родитель
	               |ИЗ
	               |	втНевошедшиеЗоны КАК втНевошедшиеЗоны
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗоныИРодители КАК втЗоныИРодители
	               |		ПО втНевошедшиеЗоны.Зона = втЗоныИРодители.Зона";
				   
				   Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции	
