
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОписаниеОшибки = "";
	Отказ = Ложь;
	ПутевойЛист = СформироватьПутевойЛистНаСервере(ПараметрКоманды, Отказ);
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("Ключ", ПутевойЛист);
		ОткрытьФорму("Документ.упПутевойЛист.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	Иначе
		ТекстОшибки = НСтр("ru = 'Путевой лист не сформирован.'");
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПутевойЛистНаСервере(мсвРейсы, Отказ)
	текПутевойЛист = упПутевойЛистУчетГСМ.СформироватьПутевойЛистПоРейсам(мсвРейсы, , ,Отказ);
	Возврат текПутевойЛист;
КонецФункции

#КонецОбласти 

