
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура производит первоначальное заполнение справочника.
//
Процедура СформироватьЦветовыеСхемыПоУмолчанию() Экспорт
	
	// синяя		
	СиняяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#0000FF");
	Если Не СиняяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", СиняяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Синяя'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = СиняяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСиний);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
			
		КонецЕсли;
	КонецЕсли;
	
	// белая		
	БелаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFFFFF");
	Если Не БелаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", БелаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Белая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = БелаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// голубая		
	ГолубаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#00FFFF");
	Если Не ГолубаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ГолубаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Голубая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ГолубаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубой);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// желтая		
	ЖелтаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFFF00");
	Если Не ЖелтаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ЖелтаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Желтая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ЖелтаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// зеленая		
	ЗеленаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#00FF00");
	Если Не ЗеленаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ЗеленаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Зеленая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ЗеленаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// красная
	КраснаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FF0000");
	Если Не КраснаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", КраснаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Красная'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = КраснаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасный);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// оранжевая
	ОранжеваяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFA500");
	Если Не ОранжеваяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ОранжеваяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Оранжевая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ОранжеваяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// розовая
	РозоваяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#FFC0CB");
	Если Не РозоваяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", РозоваяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Розовая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = РозоваяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// серая
	СераяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#BEBEBE");
	Если Не СераяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", СераяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Серая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = СераяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// фиолетовая
	ФиолетоваяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#EE82EE");
	Если Не ФиолетоваяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ФиолетоваяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Фиолетовая'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ФиолетоваяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовый);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;
	
	// черная
	ЧернаяЛиния = Справочники.упСтилиЛиний.НайтиПоРеквизиту("Цвет", "#000000");
	Если Не ЧернаяЛиния.Пустая() Тогда
		Если Справочники.упЦветовыеСхемы.НайтиПоРеквизиту("СтильЛинии", ЧернаяЛиния).Пустая() Тогда
			НовыйЭлемент = Справочники.упЦветовыеСхемы.СоздатьЭлемент();
			НовыйЭлемент.Наименование                       = НСтр("ru = 'Черная'");
			НовыйЭлемент.ИспользоватьДляОтображенияМаршрута = Истина;
			НовыйЭлемент.СтильЛинии                         = ЧернаяЛиния;
			НовыйЭлемент.СтильМаркера                       = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерный);
			НовыйЭлемент.СтильВыделенногоМаркера            = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыделенный);
			НовыйЭлемент.СтильВыбранногоМаркера             = Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыбранный);
			Попытка
				НовыйЭлемент.Записать();
			Исключение                                                                                                                                                                                                                                                                                                                                                                                                                                                
				ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				Если Не ЗначениеЗаполнено(ТекстСообщения) Тогда 
					ТекстСообщения = ОписаниеОшибки();
				КонецЕсли;
				ЗаписьЖурналаРегистрации("Создание простой цветовой схемы", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Справочники.упЦветовыеСхемы,, ТекстСообщения);
			КонецПопытки; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры // ПервоначальноеЗаполнение()
	
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
	// Нет.
	
#КонецОбласти
	
#КонецЕсли
