#Область ПрограммныйИнтерфейс

// Процедура записывает движения по регистру "упРасходы".
//
// Параметры:
//	ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на элемент.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	РеквизитыОбъекта - Структура - Реквизиты.
//	Отказ - Булево - Применить изменения объекта.
//
Процедура СформироватьДвиженияРасходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ) Экспорт
	
	упРаспределениеРасходов.СформироватьРасходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
КонецПроцедуры

#КонецОбласти

