
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
		
	СписокИсключений = Новый СписокЗначений;
	СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ПлановыеРасходыПоПеревозке);
	СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ПредполагаемаяСтоимостьПеревозки);
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоЗагрузочныхМетров") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоЗагрузочныхМетровГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоЗагрузочныхМетровТС);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоМестГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоМестТС);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьМассу") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.МассаГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ГрузоподъемностьТС);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ОбъемныйВес);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоЗагрузочныхМетровГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.КоличествоМестГруза);
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ОценочнаяСтоимостьГруза);
	КонецЕсли;	
	Если Не ПолучитьФункциональнуюОпцию("упКонтролироватьТемпературныеРежимы") Тогда 
		СписокИсключений.Добавить(Перечисления.упПараметрыРасчета.ТемпературныйРежим);
	КонецЕсли;	

			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упПараметрыРасчета.Ссылка
	|ИЗ
	|	Перечисление.упПараметрыРасчета КАК упПараметрыРасчета
	|ГДЕ
	|	НЕ упПараметрыРасчета.Ссылка В (&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	упПараметрыРасчета.Порядок";
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти