#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Сформировать наименование
//
// Параметры:
//  Агрегат			 - СправочникСсылка.упШиныУзлыИАгрегаты  	 - агрегат.
//  ВидПеревозки		 - СправочникСсылка.упВидыПеревозок 	 - вид перевозки.
//  Сотрудник			 - СправочникСсылка.упСотрудники 	 - сотрудник.
//  ТранспортноеСредство	 - СправочникСсылка.упТранспортныеСредства 	 - транспортное средство.
// 
// Возвращаемое значение:
//  Строка - наименование аналитического разреза.
//
Функция СформироватьНаименование(Агрегат = Неопределено, ВидПеревозки = Неопределено, Сотрудник = Неопределено, ТранспортноеСредство = Неопределено) Экспорт
	мсвНаименование = Новый Массив;
	Если ЗначениеЗаполнено(Агрегат) Тогда
		мсвНаименование.Добавить(Агрегат);
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидПеревозки) Тогда
		мсвНаименование.Добавить(ВидПеревозки);
	КонецЕсли;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		мсвНаименование.Добавить(Сотрудник);
	КонецЕсли;
	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		мсвНаименование.Добавить(ТранспортноеСредство);
	КонецЕсли;
	Возврат СтрСоединить(мсвНаименование, ";");
КонецФункции

#КонецОбласти

#КонецЕсли
