 
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
		
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	БлокировкаДанных = Новый БлокировкаДанных;
		
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упНаправленияДеятельностиТранспортныхСредств");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", ТранспортноеСредство);

	упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Граница = Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Включая);
	
	РеквизитыОбъекта = Новый Структура();
	РеквизитыОбъекта.Вставить("ТранспортноеСредство", ТранспортноеСредство);
	РеквизитыОбъекта.Вставить("НаправлениеДеятельности", НаправлениеДеятельности);
	РеквизитыОбъекта.Вставить("Граница", Граница);
	РеквизитыОбъекта.Вставить("Дата", Дата);
	
	// Установка Направления Деятельности транспортного средства.
	упУчетТранспортныхСредств.СформироватьДвижениеНаправленияДеятельностиТС(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
КонецПроцедуры

#КонецОбласти  

#КонецЕсли
