#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает описание полей в виде структуры,
//  по которому подбирается схема мультимодальных перевозок.
//
// Возвращаемое значение:
//   Структура - Результат выполнения.
//
Функция ПолучитьСтруктуруОтбора() Экспорт
	
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("Организация");
	сткОтбор.Вставить("ВидПеревозки");
	сткОтбор.Вставить("Заказчик");
	сткОтбор.Вставить("Соглашение");
	сткОтбор.Вставить("АдресОтправления");
	сткОтбор.Вставить("АдресПолучения");
	сткОтбор.Вставить("ЗонаОтправления");
	сткОтбор.Вставить("ЗонаПолучения");	
	
	Возврат сткОтбор
	
КонецФункции // ПолучитьСтруктуруОтбора()

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	Для каждого текРек из Метаданные.Справочники.упСхемыМультимодальныхПеревозок.Реквизиты цикл
		Если НЕ текРек.Имя = "Комментарий" тогда
			БлокируемыеРеквизиты.Добавить(текРек.Имя);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область СобытияЖурналаРегистрации

Функция СобытиеЖурналаРегистрации()
	
	Возврат НСтр("ru = 'Схема мультимодальной перевозки.%1'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());

КонецФункции

Функция СобытиеЖРПроверкаСовместимостиВидовПеревозок() Экспорт
	
	СобытиеЖР = СобытиеЖурналаРегистрации();
	СобытиеЖР = СтрШаблон(СобытиеЖР, НСтр("ru = 'Проверка совместимости видов перевозок'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()));
	
	Возврат СобытиеЖР;
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти
