#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВариантПредставленияПериода <> 1 Тогда
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйКалендарь");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		Если Ложь
			Или КоличествоНедельПлюсНачалоПериода > КоличествоНедельПлюсОкончаниеПериода 
			Или (Истина
				И КоличествоНедельПлюсНачалоПериода = КоличествоНедельПлюсОкончаниеПериода 
				И ДеньНеделиНачалоПериода > ДеньНеделиОкончаниеПериода)
			Или (Истина
				И КоличествоНедельПлюсНачалоПериода = КоличествоНедельПлюсОкончаниеПериода 
				И ДеньНеделиНачалоПериода > ДеньНеделиОкончаниеПериода
				И ВремяНачалаПериода > ВремяОкончанияПериода)
			Или КоличествоДнейПлюсНачалоПериода > КоличествоДнейПлюсОкончаниеПериода
			Или (Истина
				И КоличествоДнейПлюсНачалоПериода = КоличествоДнейПлюсОкончаниеПериода
				И ВремяНачалаПериода > ВремяОкончанияПериода)
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Начало периода больше конца'"), ЭтотОбъект,,, Отказ);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли



