
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	СписокИсключений = Новый СписокЗначений;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьМассу") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.Масса);
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьОбъем") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.Объем);
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.КоличествоМест);
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоЗагрузочныхМетров") Тогда 
		СписокИсключений.Добавить(Перечисления.упПоказателиРаспределенияРасходов.КоличествоЗагрузочныхМетров);
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упПоказателиРаспределенияРасходов.Ссылка
	|ИЗ
	|	Перечисление.упПоказателиРаспределенияРасходов КАК упПоказателиРаспределенияРасходов
	|ГДЕ
	|	НЕ упПоказателиРаспределенияРасходов.Ссылка В(&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	упПоказателиРаспределенияРасходов.Порядок";
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти