#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт

	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	НастройкиОтчета.Описание = НСтр("ru = 'Планируемая и фактическая маржинальность по заявкам.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализМаржинальностиПоЗаявкам");
	НастройкиВарианта.Описание = СтрШаблон(НСтр("ru = 'Анализ распределения доходов и расходов по статьям в разрезе %1заявок на перевозку, заказчиков и пр. Сравнение плана и факта по доходам и расходам'"), Символы.ПС);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДиаграммаПрибыль");
	НастройкиВарианта.Описание = СтрШаблон(НСтр("ru = 'Диаграмма динамики изменения прибыли по дням по датам %1заявок на перевозку'"), Символы.ПС);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДиаграммаМаржинальность");
	НастройкиВарианта.Описание = НСтр("ru = 'График изменения маржинальности по дням по датам заявок на перевозку'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли