
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтатусРейса = ПолучитьСтатус(ПараметрКоманды);
	ТекстОшибки = "";
	Отказ	  = Ложь;
	
	упПрохождениеТочки.ПроверитьСпособПрохожденияМаршрута(ПараметрКоманды, ТекстОшибки, Отказ);
	
	Если НЕ Отказ Тогда
		Если упРаботаСоСтатусамиКлиентСервер.РазрешеноФормироватьКорректировкуРейса(СтатусРейса)  Тогда
			ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
			ОткрытьФорму("Документ.упКорректировкаРейса.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
		Иначе
			ТекстОшибки = НСтр(СтрШаблон("ru = 'Запрещено формировать корректировку по рейсу в статусе ""%1""'", СтатусРейса));
			упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
		КонецЕсли;
	Иначе	
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;
	
		
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСтатус(Рейс)
	Возврат упРаботаСоСтатусами.ПолучитьТекущийСтатус(Рейс);	
КонецФункции

#КонецОбласти 