#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура заполнения дополнительных свойств документа.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упГСМ.ГСМ КАК Материал,
	|	СУММА(упГСМ.Количество) КАК Количество
	|ПОМЕСТИТЬ втМатериалы
	|ИЗ
	|	Документ.упСписаниеМатериалов.ГСМ КАК упГСМ
	|ГДЕ
	|	упГСМ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	упГСМ.ГСМ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упЗапчасти.Запчасть,
	|	СУММА(упЗапчасти.Количество)
	|ИЗ
	|	Документ.упСписаниеМатериалов.Запчасти КАК упЗапчасти
	|ГДЕ
	|	упЗапчасти.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	упЗапчасти.Запчасть
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упПоступлениеМатериалов.Склад,
	|	втМатериалы.Материал,
	|	втМатериалы.Количество
	|ИЗ
	|	втМатериалы КАК втМатериалы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упСписаниеМатериалов КАК упПоступлениеМатериалов
	|		ПО (упПоступлениеМатериалов.Ссылка = &Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		ДополнительныеСвойства.Вставить("ОстаткиМатериалов", Результат.Выгрузить());
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
