
#Область ОбработчикиСобытий

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Функция ищет ячейку по коду
//
// Параметры:
//  Склад  - СправочникСсылка - ссылка на элемент.
//  Код  - Строка - Код.
//
// Возвращаемое значение:
//   СправочникСсылка.упСкладскиеЯчейки - Результат выполнения.
//
Функция НайтиЯчейкуНаСкладеПоКоду(Склад, Код) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка
	|ИЗ
	|	Справочник.упСкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Владелец = &Склад
	|	И СкладскиеЯчейки.Код = &Код";
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Код",  Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.упСкладскиеЯчейки.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // НайтиЯчейкуНаСкладеПоКоду()

#КонецОбласти 
