
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.упВидыГрузов.Груз);
	Если ПолучитьФункциональнуюОпцию("упИспользуютсяУслугиИнкассации") Тогда
		ДанныеВыбора.Добавить(Перечисления.упВидыГрузов.ИнкассируемаяЦенность);
	КонецЕсли; 
	Если ПолучитьФункциональнуюОпцию("упВедетсяУчетТары") Тогда
		ДанныеВыбора.Добавить(Перечисления.упВидыГрузов.Тара);
	КонецЕсли; 
	
КонецПроцедуры
