#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Подсистема Свойства
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Справочник_упНоменклатура");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("НесовместимыеВидыНоменклатуры") Тогда
		Набор = РегистрыСведений.упНесовместимыеВидыНоменклатуры.СоздатьНаборЗаписей();
		Набор.Отбор.ВидНоменклатуры1.Установить(Ссылка);
		Для Каждого ВидНоменклатуры Из ДополнительныеСвойства.НесовместимыеВидыНоменклатуры Цикл
			СтрокаНабора = Набор.Добавить();
			СтрокаНабора.ВидНоменклатуры1 = Ссылка;
			СтрокаНабора.ВидНоменклатуры2 = ВидНоменклатуры;
		КонецЦикла;
		Набор.Записать();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти  

#КонецЕсли
