
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбратныйПуть") Тогда 
		Для Каждого текЗапись Из ЭтотОбъект Цикл 
			Если текЗапись.НачальнаяЗона = текЗапись.КонечнаяЗона Тогда 
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.упРасстоянияМеждуЗонами.СоздатьНаборЗаписей();
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОбратныйПуть");
			НаборЗаписей.Отбор.НачальнаяЗона.Установить(текЗапись.КонечнаяЗона);
			НаборЗаписей.Отбор.КонечнаяЗона.Установить(текЗапись.НачальнаяЗона);
			
			ОбратныйПуть = НаборЗаписей.Добавить();
			ОбратныйПуть.НачальнаяЗона = текЗапись.КонечнаяЗона;
			ОбратныйПуть.КонечнаяЗона  = текЗапись.НачальнаяЗона;
			ОбратныйПуть.Расстояние    = текЗапись.Расстояние;
			ОбратныйПуть.Время         = текЗапись.Время;
			
			НаборЗаписей.Записать();
		КонецЦикла;	                
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти