#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрытьТекущуюФорму	= Ложь;
	
	Если ЗначениеЗаполнено(Параметры.ВидГСМ) Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДополнительноеОборудование, "НормыРасходаГСМ.ВидГСМ", Параметры.ВидГСМ, ВидСравненияКомпоновкиДанных.Равно)
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НЕ ЗакрытьТекущуюФорму;	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КнопкаВыбратьНажатие(Элемент)
	ВыбраноЗначение();
КонецПроцедуры

&НаКлиенте
Процедура СписокДополнительноеОборудованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбраноЗначение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ВыбраноЗначение()
	ТекущиеДанные = Элементы.СписокДополнительноеОборудование.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка)
	Иначе
		ОповеститьОВыборе(ПредопределенноеЗначение("Справочник.упДополнительноеОборудование.ПустаяСсылка"));
	КонецЕсли;
	сткВозврата =Новый Структура;
	сткВозврата.Вставить("ИмяФормыПерехода", "ФормаВводаЗаправки");
	ЗакрытьТекущуюФорму = Истина;
	Закрыть(сткВозврата);
КонецПроцедуры
	
#КонецОбласти
