
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ДатаНачалаДействия) И ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
		Если ДатаОкончанияДействия < ДатаНачалаДействия Тогда
			ТекстСообщения = Нстр("ru = 'Период действия задан неправильно. Дата окончания меньше чем дата начала'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ,"Объект.ДатаОкончанияДействия",,Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.упДоговорыКонтрагентов") Тогда
		// Заполнение шапки
		Дата = ДанныеЗаполнения.Дата;
		ДатаНачалаДействия = ДанныеЗаполнения.ДатаНачалаДействия;
		ДатаОкончанияДействия = ДанныеЗаполнения.ДатаОкончанияДействия;
		Комментарий = ДанныеЗаполнения.Комментарий;
		КонтактноеЛицо = ДанныеЗаполнения.КонтактноеЛицо;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Наименование = ДанныеЗаполнения.Наименование;
		Организация = ДанныеЗаполнения.Организация;
		Владелец = ДанныеЗаполнения.Партнер;
		Договор = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли