
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Справочники.упТранспортныеСредства.УстановитьОтборПриВыбореПоПараметрам(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, Параметры, "ВладелецКонтейнера");
	Справочники.упТранспортныеСредства.ДобавитьУсловноеОформлениеКолонкиСостояниеТС(Список, "СостояниеКонтейнера.ТипСостоянияТС", "СостояниеКонтейнера");
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 