#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возрвает цену указанной запчасти.
//
// Параметры:
//  Ссылка  - СправочникСсылка - Ссылка на элемент.
//  ДатаСреза  - Дата - Период.
//
// Возвращаемое значение:
//   Число - Актуальная Цена.
//
Функция ПолучитьЦенуЗапчасти(Ссылка, ДатаСреза = Неопределено) Экспорт
	
	АктуальнаяЦена = 0;
	
	Запрос = новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	упЦеныЗапчастейСрезПоследних.Цена
	 |ИЗ
	 |	РегистрСведений.упЦеныЗапчастей.СрезПоследних(&Период, Запчасть = &Запчасть) КАК упЦеныЗапчастейСрезПоследних";
	 Запрос.УстановитьПараметр("Период", ?(ДатаСреза = Неопределено, ТекущаяДатаСеанса(), ДатаСреза));
	 Запрос.УстановитьПараметр("Запчасть", Ссылка);
	 Результат = Запрос.Выполнить();
	 
	 Если Не Результат.Пустой() Тогда
		 Выборка = Результат.Выбрать();
		 Выборка.Следующий();
		 АктуальнаяЦена = Выборка.Цена;
	 КонецЕсли; 
	
     Возврат АктуальнаяЦена;

КонецФункции // ПолучитьЦенуЗапчасти()
 
#КонецОбласти

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли



