
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	//БлокируемыеРеквизиты.Добавить("ВидРемонта");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыФункцииПечати

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
  // Нет.
   	
КонецПроцедуры // ДобавитьКомандыПечати()

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//  ПараметрыПечати - Структура - дополнительные настройки печати.
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати - СписокЗначений - объекты печати: 
//											  * значение - ссылка на объект.
//                                            * представление - имя области в которой был выведен объект (выходной параметр).
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Нет.
	
КонецПроцедуры // Печать()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Заполнить дополнительные свойства документа.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Оборудования.ДатаИзмененияСостояния КАК ДатаИзмененияСостояния,
	|	Оборудования.Оборудование КАК Оборудование
	|ИЗ
	|	Документ.упИзменениеСостоянийОборудования.Оборудование КАК Оборудования
	|ГДЕ
	|	Оборудования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаОборудования = Новый ТаблицаЗначений;
	ТаблицаОборудования.Колонки.Добавить("Оборудование",,"Оборудование");
	ТаблицаОборудования.Колонки.Добавить("Период",,"Период");
	ТаблицаОборудования.Колонки.Добавить("ТранспортноеСредство",,"ТранспортноеСредство");
	ТаблицаОборудования.Колонки.Добавить("Склад",,"Склад");
	ТаблицаОборудования.Колонки.Добавить("Операция",,"Операция");
	ТаблицаОборудования.Колонки.Добавить("Количество",,"Количество");
	ТаблицаОборудования.Колонки.Добавить("ЭтоТС",,"ЭтоТС");
	ТаблицаОборудования.Колонки.Добавить("ЭтоСклад",,"ЭтоСклад");
	
	ЗапросОборудования = Новый Запрос;
	ЗапросОборудования.Текст = "ВЫБРАТЬ
	|	упАгрегатыТранспортныхСредствСрезПоследних.Агрегат КАК Агрегат,
	|	упАгрегатыТранспортныхСредствСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упАгрегатыТранспортныхСредствСрезПоследних.Операция КАК Операция,
	|	ЗНАЧЕНИЕ(Справочник.упСклады.ПустаяСсылка) КАК Склад,
	|	ИСТИНА КАК ЭтоТС,
	|	ЛОЖЬ КАК ЭтоСклад,
	|	1 КАК Количество,
	|	упАгрегатыТранспортныхСредствСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ вт_Данные
	|ИЗ
	|	РегистрСведений.упАгрегатыТранспортныхСредств.СрезПоследних(&Период, Агрегат = &Оборудование) КАК упАгрегатыТранспортныхСредствСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упАгрегатыНаСкладахОстатки.Агрегат,
	|	ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.ПустаяСсылка),
	|	упАгрегатыНаСкладахОстатки.Склад,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	упАгрегатыНаСкладахОстатки.КоличествоОстаток,
	|	&ПериодСреза
	|ИЗ
	|	РегистрНакопления.упАгрегатыНаСкладах.Остатки(&Период, Агрегат = &Оборудование) КАК упАгрегатыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Данные.Агрегат КАК Агрегат,
	|	вт_Данные.ТранспортноеСредство КАК ТранспортноеСредство,
	|	вт_Данные.Операция КАК Операция,
	|	вт_Данные.Склад КАК Склад,
	|	вт_Данные.ЭтоТС КАК ЭтоТС,
	|	вт_Данные.ЭтоСклад КАК ЭтоСклад,
	|	вт_Данные.Количество КАК Количество,
	|	вт_Данные.Период КАК Период
	|ИЗ
	|	вт_Данные КАК вт_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упАгрегатыТранспортныхСредствСрезПоследних.Агрегат КАК Агрегат,
	|	упАгрегатыТранспортныхСредствСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
	|	упАгрегатыТранспортныхСредствСрезПоследних.Операция КАК Операция,
	|	ЗНАЧЕНИЕ(Справочник.упСклады.ПустаяСсылка) КАК Склад,
	|	ИСТИНА КАК ЭтоТС,
	|	ЛОЖЬ КАК ЭтоСклад,
	|	1 КАК Количество,
	|	упАгрегатыТранспортныхСредствСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.упАгрегатыТранспортныхСредств.СрезПоследних(&Период, Агрегат = &Оборудование) КАК упАгрегатыТранспортныхСредствСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упАгрегатыНаСкладах.Агрегат,
	|	ЗНАЧЕНИЕ(Справочник.упТранспортныеСредства.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Перечисление.упТипыОперацийМонтажа.ПустаяСсылка),
	|	упАгрегатыНаСкладах.Склад,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	упАгрегатыНаСкладах.Количество,
	|	МАКСИМУМ(упАгрегатыНаСкладах.Период)
	|ИЗ
	|	РегистрНакопления.упАгрегатыНаСкладах КАК упАгрегатыНаСкладах
	|ГДЕ
	|	упАгрегатыНаСкладах.Агрегат = &Оборудование
	|	И упАгрегатыНаСкладах.Период <= &ПериодСреза
	|
	|СГРУППИРОВАТЬ ПО
	|	упАгрегатыНаСкладах.Агрегат,
	|	упАгрегатыНаСкладах.Склад,
	|	упАгрегатыНаСкладах.Количество";

	
	// Выполним поиск текущего места положения каждого оборудывания на указанную дату.
	Пока Выборка.Следующий() Цикл
		Граница = Новый Граница(Выборка.ДатаИзмененияСостояния, ВидГраницы.Включая);
		ЗапросОборудования.УстановитьПараметр("Оборудование", Выборка.Оборудование);
		ЗапросОборудования.УстановитьПараметр("Период", Граница);
		ЗапросОборудования.УстановитьПараметр("ПериодСреза", Выборка.ДатаИзмененияСостояния);
		ПакетЗапросов = ЗапросОборудования.ВыполнитьПакет();
		ВыборкаПериода = ПакетЗапросов[2].Выбрать();
		Если ПакетЗапросов[1].Пустой() Тогда
			Пока ВыборкаПериода.Следующий() Цикл
				НоваяСтрока = ТаблицаОборудования.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПериода);
				НоваяСтрока.Оборудование =  Выборка.Оборудование;
			КонецЦикла;
		Иначе
			ВыборкаОборудования = ПакетЗапросов[1].Выбрать();		
			Пока ВыборкаОборудования.Следующий() Цикл
				НоваяСтрока = ТаблицаОборудования.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОборудования);
				НоваяСтрока.Оборудование =  Выборка.Оборудование;
				Если ВыборкаПериода.Следующий() Тогда
					НоваяСтрока.Период = ВыборкаПериода.Период;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЦикла;
	
	Если ТаблицаОборудования.Количество() Тогда
		ДополнительныеСвойства.Вставить("Оборудование", ТаблицаОборудования.Скопировать());
	КонецЕсли; 
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

#КонецОбласти

#КонецОбласти

#КонецЕсли


