

#Область КомплектыДокументов

Функция ПечатьШаблонаПечатныхФормПоЗаданиюНаПеревозку(ОписаниеКоманды) Экспорт
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	НаборПакетовПФ = упУправлениеПечатьюВызовСервера.ПечатьШаблонаПечатныхФормПоЗаданиюНаПеревозку(ОписаниеКоманды.ОбъектыПечати,ОписаниеОшибки,Отказ);
	
	Если НЕ Отказ Тогда
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		Для каждого ТекущийНабор Из НаборПакетовПФ Цикл			
			ИменаМакетов = ТекущийНабор.ИдентификаторыПечатныхФорм;
			ИмяМенеджераПечати = ТекущийНабор.МенеджерПечати;
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекущийНабор.Документ);
			ВладелецФормы = ОписаниеКоманды.ОбъектыПечати;
			ПараметрыПечати = Новый Структура();
			ПараметрыПечати.Вставить("ЗаголовокФормы", СтрШаблон("Пакет печатных форм: %1",ТекущийНабор.Представление));			
			МодульУправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ИмяМенеджераПечати,ИменаМакетов,МассивОбъектов,ВладелецФормы,ПараметрыПечати);			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецФункции // ПечатьШаблонаПечатныхФормПоЗаданиюНаПеревозку()

Функция ПечатьШаблонаПечатныхФормПоЗаданиюНаПеревозкуНаПринтер(ОписаниеКоманды) Экспорт
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	НаборПакетовПФ = упУправлениеПечатьюВызовСервера.ПечатьШаблонаПечатныхФормПоЗаданиюНаПеревозку(ОписаниеКоманды.ОбъектыПечати,ОписаниеОшибки,Отказ);
	
	Если НЕ Отказ Тогда
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		Для каждого ТекущийНабор Из НаборПакетовПФ Цикл
			ИменаМакетов = ТекущийНабор.ИдентификаторыПечатныхФорм;
			ИмяМенеджераПечати = ТекущийНабор.МенеджерПечати;
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(ТекущийНабор.Документ);
			ВладелецФормы = ОписаниеКоманды.ОбъектыПечати;
			ПараметрыПечати = Новый Структура();			
			ПараметрыПечати.Вставить("ЗаголовокФормы", СтрШаблон("Пакет печатных форм: %1",ТекущийНабор.Представление));			
			МассивМакетов = СтрРазделить(ИменаМакетов,",");
			Для каждого ТекущийМакет Из МассивМакетов Цикл
				МодульУправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(ИмяМенеджераПечати,ТекущийМакет,МассивОбъектов,ПараметрыПечати);			
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;	
	
КонецФункции // ПечатьШаблонаПечатныхФормПоЗаданиюНаПеревозкуНаПринтер()

#КонецОбласти