
#Область СлужебныеПроцедурыИФункции

// Процедура производит первоначальное заполнение предопределенных элементов справочника.
//
// Параметры:
//  Параметры  - Структура - Параметры.
//
Процедура ПервоначальноеЗаполнение(Параметры = Неопределено) Экспорт
	
	текЭлемент = Справочники.упСервераСбораДанных.СерверМобильныхПриложений.ПолучитьОбъект();
	текЭлемент.Тип     = Перечисления.упТипСервераСбораДанных.AndroidКлиент;
	текЭлемент.Активен = Истина;
	текЭлемент.Записать();
	
КонецПроцедуры	

#КонецОбласти