#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Отказ Тогда
		Если Тип = ПредопределенноеЗначение("Перечисление.упТипСервераСбораДанных.СКАУТ")
			И ИнтервалПолученияДанных < 10 Тогда
			ТекстСообщения = Нстр("ru = 'Укажите интервал получения данных для топлива'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ИнтервалПолученияДанных","Объект",Отказ);
			Событие = Нстр("ru = 'Ошибка при проверке заполнения Сервера сбора данных'");
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,, , ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли

