
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТипИсходногоДействия = Неопределено;
	Если Параметры.Отбор.Свойство("ТипИсходногоДействия", ТипИсходногоДействия) Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокСсылок = Новый СписокЗначений;
		СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
		Если ПолучитьФункциональнуюОпцию("ИспользоватьНапоминанияПользователя") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.НапоминаниеПользователю);
		КонецЕсли;
		СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОповеститьПользователя);
		СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьSMS);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗадачаПользователю);
		КонецЕсли;
		
		Если ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаПеревозку")  Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаданиеНаПеревозкуГруза);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаявкуКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СогласоватьЗаявку);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхДоходов);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратГруза);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратТары);	
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаявкиНаПеревозкуГруза") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаявкуКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СогласоватьЗаявку);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхДоходов);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратГруза);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаВозвратТары);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаданияНаПеревозку") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьЗаданиеВПериодическийРейс);	
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяМультимодальныеПеревозки") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьСледующийВМультимодальнойПеревозкеРейсКВыполнению);	
			КонецЕсли;
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаданияНаПеревозкуГруза") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьЗаданиеКПланированию);
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяМультимодальныеПеревозки") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьСледующийВМультимодальнойПеревозкеРейсКВыполнению);	
			КонецЕсли;
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаРейса") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьКонтрольныеТочкиВРейсПоПравилам);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СформироватьЗаявкиНаТС);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗавершитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтменитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхРасходов);		
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СписатьПланыПоЗаданиямНаПеревозку);
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяМультимодальныеПеревозки") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СкорректироватьПланПеревозки);
			КонецЕсли;
						
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьРейса") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьКонтрольныеТочкиВРейсПоПравилам);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СформироватьЗаявкиНаТС);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОбновитьУсловияВЗаявкахНаТС);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗавершитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтменитьРейс);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.РасчетПлановыхРасходов);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СписатьПланыПоЗаданиямНаПеревозку);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПодтвержденияЗаявкиНаТС") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтменитьРейс);	
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаТС") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьЗаявкуНаТСПеревозчику);	
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяИтерацииОформленияЗаявокНаТС") Тогда 
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПерейтиКСледующейИтерацииПодбораПеревозчика);	
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПерейтиКСледующемуЭтапуПодбораПеревозчика);	
			КонецЕсли;	
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПутевогоЛиста") 
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаПутевогоЛиста")  Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПередатьРейсКВыполнению);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СкорректироватьНачальныеОстаткиВСледующемПутевомЛисте);
			Если ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда 
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗапроситьЗначенияУровняТопливаНаПериодПутевогоЛиста);	
			КонецЕсли;	
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПредложенияПеревозчика") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьПодтверждениеЗаявкиНаТС);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеМаршрутаПоРейсу") Тогда	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ВключитьКонтрольныеТочкиВРейсПоПравилам);	
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОптимизироватьМаршрут);
			Если ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьСобытиеМониторингаОпозданиеВТочкеМаршрута);
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьСобытиеМониторингаПланируемоеОпозданиеВТочкеМаршрута);
			КонецЕсли; 
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьСобытияМониторинга") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОптимизироватьМаршрут);
			Если ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаСпутниковыйМониторинг") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтразитьЗаправкуСливВПутевомЛистеПоДаннымДатчиков);
			КонецЕсли; 	
			Если ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗадачуНаПодтверждениеАдреса);
				СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗадачуНаСогласованиеИзмененийМаршрута);
			КонецЕсли;
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ПрисоединениеФайла") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗапросаУсловийПеревозки") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОбработатьЗапросУсловийПеревозки);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаПеревозкуГруза);
			
	     ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗапросаУсловийПеревозки") Тогда			
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаПеревозкуГруза);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗадачиНаОтправкуФайлов") Тогда			
			СписокСсылок.Очистить();
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ЗадачаПользователю);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОповеститьПользователя);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьSMS);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗадачиИсполнителя") Тогда			
			СписокСсылок.Очистить();
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ПроизвольныйАлгоритм);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.НапоминаниеПользователю);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОповеститьПользователя);
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.ОтправитьSMS);
			
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьОперацийСКонтейнером")
			Или ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаОперацийСКонтейнером") Тогда
			СписокСсылок.Добавить(Перечисления.упАлгоритмыОбработкиСобытия.СоздатьЗаявкуНаПеревозкуКонтейнера);
			
		КонецЕсли;
		
		СписокИсключений = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	тбАлгоритмыОбработкиСобытия.Ссылка
		               |ИЗ
		               |	Перечисление.упАлгоритмыОбработкиСобытия КАК тбАлгоритмыОбработкиСобытия
		               |ГДЕ
		               |	тбАлгоритмыОбработкиСобытия.Ссылка В(&Список)
		               |	И НЕ тбАлгоритмыОбработкиСобытия.Ссылка В (&СписокИсключений)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	тбАлгоритмыОбработкиСобытия.Порядок";
		Запрос.УстановитьПараметр("Список",           СписокСсылок);
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти