#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		МенеджерЗначения = Константы.упПакетныйРежимЗапросовСервисуМаршрутизации.СоздатьМенеджерЗначения();
		МенеджерЗначения.Прочитать();
		МенеджерЗначения.Записать();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
	
#Область ПрограммныйИнтерфейс

// Получить разрешенное значение. К текущему значению применяются ограничения кодом.
//
Функция ПолучитьРазрешенноеЗначение() Экспорт 
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() И Значение = Перечисления.упТипыМаршрутизаторов.GoogleMaps Тогда
		Значение = Перечисления.упТипыМаршрутизаторов.AxelotMaps;
	КонецЕсли; 
	Возврат Значение;
	
КонецФункции


#КонецОбласти

#КонецЕсли


