
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ТипПоказателя = ПредопределенноеЗначение("Перечисление.упТипыПоказателейРасчета.Расчетный") Тогда
		//Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПараметрРасчета) ИЛИ НЕ упТарификацияКлиентСервер.ЭтоСсылочныйПараметр(ЭтотОбъект.ПараметрРасчета) Тогда
		//	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ЗначенияПараметра");
		//КонецЕсли;	
	Иначе
		//ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ЗначенияПараметра");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПараметрРасчета");
	КонецЕсли;
				
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		ЭтотОбъект.Код = упСервисныеФункцииКлиентСервер.ПолучитьИмяПоНаименованию(СокрЛП(Код));
		ЭтотОбъект.НеЗаменятьНаРазмер = ЗначенияПараметра.Количество() = 0;
		Если Не ЗначениеЗаполнено(ЭтотОбъект.ТипРасчета) И ЭтотОбъект.ТипПоказателя = Перечисления.упТипыПоказателейРасчета.Фиксированный Тогда
			 ЭтотОбъект.ТипРасчета = Перечисления.упТипРасчета.Тарификация;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли