
#Область ОбработчикиСобытий
// Нет.
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТочкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	ПроверитьКоординатыТочкиНаСервере(ВыбранноеЗначение, СтандартнаяОбработка);
	Если НЕ СтандартнаяОбработка Тогда
		ПоказатьПредупреждение(,"В выбираемой точке должны быть заполнены координаты!");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	Если НЕ ЗначениеЗаполнено(НачальнаяТочка) ИЛИ НЕ ЗначениеЗаполнено(КонечнаяТочка) Тогда
		ПоказатьПредупреждение(,"Точки маршрута должны быть заполнены!");
		Возврат;
	КонецЕсли; 
	
	АдресВХ = ПоместитьВВХ();
	Оповестить("ВыбраныНачальнаяКонечнаяТочкаМаршрута", Новый Структура("АдресВХ, ТолькоПросмотр", АдресВХ, ТолькоПросмотр));
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПроверитьКоординатыТочкиНаСервере(ВыбранноеЗначение, СтандартнаяОбработка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упАдреса.Широта,
		|	упАдреса.Долгота
		|ИЗ
		|	Справочник.упАдреса КАК упАдреса
		|ГДЕ
		|	упАдреса.Ссылка = &ВыбранноеЗначение
		|	И (упАдреса.Широта = 0
		|	ИЛИ упАдреса.Долгота = 0)";
	
	Запрос.УстановитьПараметр("ВыбранноеЗначение", ВыбранноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВВХ()

	Возврат ПоместитьВоВременноеХранилище(Новый Структура("НачальнаяТочка, КонечнаяТочка", НачальнаяТочка, КонечнаяТочка)); 	

КонецФункции // ПоместитьВВХ()

&НаКлиенте
Процедура ПерерассчитатьМаршрут(Команда)
	
	ПерерассчитатьМаршрутНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПерерассчитатьМаршрутНаСервере()
	
	//МенеджерЗаписи = РегистрыСведений.упРасстоянияМеждуТочками.СоздатьМенеджерЗаписи();
	//МенеджерЗаписи.НачальнаяШирота = НачальнаяТочка.Широта;
	//МенеджерЗаписи.НачальнаяДолгота = НачальнаяТочка.Долгота;
	//МенеджерЗаписи.КонечнаяШирота = КонечнаяТочка.Широта;
	//МенеджерЗаписи.КонечнаяДолгота = КонечнаяТочка.Долгота;
	//МенеджерЗаписи.Прочитать();
	ТаблицаРасстояний = Новый ТаблицаЗначений;
	ТаблицаРасстояний.Колонки.Добавить("НачальнаяШирота", Новый ОписаниеТипов("Число"));
	ТаблицаРасстояний.Колонки.Добавить("НачальнаяДолгота", Новый ОписаниеТипов("Число"));
	ТаблицаРасстояний.Колонки.Добавить("КонечнаяДолгота", Новый ОписаниеТипов("Число"));
	ТаблицаРасстояний.Колонки.Добавить("КонечнаяШирота", Новый ОписаниеТипов("Число"));
	ТаблицаРасстояний.Колонки.Добавить("Ограничение", Новый ОписаниеТипов("ПеречислениеСсылка.упОграниченияМаршрутизаторов"));
	ТаблицаРасстояний.Колонки.Добавить("ПытатьсяРассчитатьСнова");
	ТаблицаРасстояний.Колонки.Добавить("ДопОграниченияСитиГИД");
	СтрокаРасстояния = ТаблицаРасстояний.Добавить();
	СтрокаРасстояния.НачальнаяШирота = НачальнаяТочка.Широта;
	СтрокаРасстояния.НачальнаяДолгота = НачальнаяТочка.Долгота;
	СтрокаРасстояния.КонечнаяШирота = КонечнаяТочка.Широта;
	СтрокаРасстояния.КонечнаяДолгота = КонечнаяТочка.Долгота;
	СтрокаРасстояния.ПытатьсяРассчитатьСнова = Истина;
	СтрокаРасстояния.ДопОграниченияСитиГИД = Ложь;
	упМаршрутизация.РассчитатьПорциюРасстоянийПоКарте(ТаблицаРасстояний);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НачальнаяТочка") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "НачальнаяТочка, КонечнаяТочка"); 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 