
#Область ПрограммныйИнтерфейс

// Процедура сокращает время ожидания в рейсе.
//
// Параметры:
//  Маршрут - ТаблицаЗначений - Таблица данных.
//	Работы - ТаблицаЗначений - Таблица данных.
//	КоэффициентПереводаВЧасы - Число - Коэффициент.
//
Процедура СократитьВремяОжиданияВРейсе(Маршрут, Работы, КоэффициентПереводаВЧасы = 3600) Экспорт	
	
	КоличествоТочек = Маршрут.Количество();
	Сч = КоличествоТочек - 1;
	Сдвиг = 0;
	СледующаяТочка = Неопределено;
	Пока Сч > 0 Цикл
		текТочка = Маршрут[Сч];
		Если Сдвиг > 0 Тогда
			ВозможныйСдвиг = текТочка.ВременноеОкноОкончание - текТочка.ПлановоеУбытие;
			Если ВозможныйСдвиг > 0 Тогда
				ВозможныйСдвиг = Мин(ВозможныйСдвиг, Сдвиг);
				ВозможныйСдвигВЧасах = ВозможныйСдвиг/КоэффициентПереводаВЧасы;
				текТочка.ПлановоеУбытие = текТочка.ПлановоеУбытие + ВозможныйСдвиг;
				текТочка.ВремяОжиданияВТочке = текТочка.ВремяОжиданияВТочке + ВозможныйСдвигВЧасах;
				СвязанныеРаботы = Работы.НайтиСтроки(Новый Структура("Идентификатор", текТочка.Идентификатор));
				Для каждого текРабота Из СвязанныеРаботы Цикл
					текРабота.ПлановоеВремяНачалаРабот = текРабота.ПлановоеВремяНачалаРабот + ВозможныйСдвиг + 30;
					//Если текРабота.СтрокаНомер = 1 Тогда
					//	текРабота.ВремяОжидания = текТочка.ВремяОжиданияВТочке;
					//КонецЕсли; 
				КонецЦикла; 
				СледующаяТочка.ПлановоеПрибытие = СледующаяТочка.ПлановоеПрибытие + ВозможныйСдвиг;
				СледующаяТочка.ВремяОжиданияВТочке = СледующаяТочка.ВремяОжиданияВТочке - ВозможныйСдвигВЧасах;
				СвязанныеРаботы = Работы.НайтиСтроки(Новый Структура("Идентификатор", СледующаяТочка.Идентификатор));
				//Для каждого текРабота Из СвязанныеРаботы Цикл
				//	Если текРабота.СтрокаНомер = 1 Тогда
				//		текРабота.ВремяОжидания = СледующаяТочка.ВремяОжиданияВТочке;
				//	КонецЕсли; 
				//КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		СледующаяТочка = текТочка;
		Сдвиг = текТочка.ВремяОжиданияВТочке*КоэффициентПереводаВЧасы;
		Сч = Сч - 1;
	КонецЦикла; 
	Если Сдвиг > 0 Тогда
		НачалоМаршрута = Маршрут[0];
		ВозможныйСдвиг = НачалоМаршрута.ВременноеОкноОкончание - НачалоМаршрута.ПлановоеУбытие;
		Если ВозможныйСдвиг > 0 Тогда
			ВозможныйСдвиг = Мин(ВозможныйСдвиг, Сдвиг);
			ВозможныйСдвигВЧасах = ВозможныйСдвиг/КоэффициентПереводаВЧасы;
			НачалоМаршрута.ПлановоеПрибытие = НачалоМаршрута.ПлановоеПрибытие + ВозможныйСдвиг;
			НачалоМаршрута.ПлановоеУбытие = НачалоМаршрута.ПлановоеУбытие + ВозможныйСдвиг;
			СвязанныеРаботы = Работы.НайтиСтроки(Новый Структура("Идентификатор", НачалоМаршрута.Идентификатор));
			Для каждого текРабота Из СвязанныеРаботы Цикл
				текРабота.ПлановоеВремяНачалаРабот = текРабота.ПлановоеВремяНачалаРабот + ВозможныйСдвиг + 30;
			КонецЦикла;
			СледующаяТочка.ПлановоеПрибытие = СледующаяТочка.ПлановоеПрибытие + ВозможныйСдвиг;
			СледующаяТочка.ВремяОжиданияВТочке = СледующаяТочка.ВремяОжиданияВТочке - ВозможныйСдвигВЧасах;
			СвязанныеРаботы = Работы.НайтиСтроки(Новый Структура("Идентификатор", СледующаяТочка.Идентификатор));
			//Для каждого текРабота Из СвязанныеРаботы Цикл
			//	Если текРабота.СтрокаНомер = 1 Тогда
			//		текРабота.ВремяОжидания = СледующаяТочка.ВремяОжиданияВТочке;
			//	КонецЕсли; 
			//КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СократитьВремяОжиданияВРейсе()

// Процедура - Переключить ожидание после работ
//
// Параметры:
//  ТекущиеДанные	 - ТекущиеДанные - строка данных.
//
Процедура ПереключитьОжиданиеПослеРабот(ТекущиеДанные) Экспорт 
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	ТекущиеДанные.НеИспользоватьАвторасчетУбытияИзТочки = Не ТекущиеДанные.НеИспользоватьАвторасчетУбытияИзТочки;
	Если ТекущиеДанные.НеИспользоватьАвторасчетУбытияИзТочки Тогда
		ТекстСообщения = "Выключен авторасчет времени ожидания после работ в текущей точке";
	Иначе 
		ТекстСообщения = "Включен авторасчет времени ожидания после работ в текущей точке";
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);

КонецПроцедуры

#КонецОбласти		
