#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда 
		Если ЗначениеЗаполнено(ВнешняяОбработка) Тогда
			Если ВнешняяОбработка.Наименование <> Наименование Тогда
				ВнешняяОбработкаОбъект = ВнешняяОбработка.ПолучитьОбъект();
				ВнешняяОбработкаОбъект.Наименование = Наименование;
				ВнешняяОбработкаОбъект.Записать();
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		Если СпособРасчета = Перечисления.упСпособыРасчета.Произвольный Тогда
			ЭтотОбъект.Формула = "";
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 