
#Область ОбработчикиСобытий	

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СформироватьОтчет(ДокументРезультат, ДанныеРасшифровки);
	
КонецПроцедуры // ПриКомпоновкеРезультата()

// Процедура выполняет формирование табличного документа по настройкам СКД.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - ТабличныйДокумент.
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных - Объект, содержащий информацию о расшифровке.
//
Процедура СформироватьОтчет(ТабличныйДокумент, ДанныеРасшифровки) 
		
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных, ));	
	
	// Компоновка макета
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки,);
	
	// при необходимости вставим внешние наборы данных в СКД
	ВнешниеНаборыДанных = Новый Структура;
	
	ТаблицаВнешнегоНабораДанных = ПолучитьТаблицуВнешнегоНабораДанных();
	ВнешниеНаборыДанных.Вставить("ТаблицаВнешнегоНабораДанных",ТаблицаВнешнегоНабораДанных);
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,ВнешниеНаборыДанных,ДанныеРасшифровки);	
	
	ТабличныйДокумент.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 

КонецПроцедуры // СформироватьОтчет()

// В данной функции можно сформировать таблицу внешнего набора данных для СКД,
// Функция должна возвращать таблицу данных (например таблицу значений).
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Результат выпонления.
//
Функция ПолучитьТаблицуВнешнегоНабораДанных()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СрезПоследних.Документ КАК Документ
	|ПОМЕСТИТЬ втДокументы
	|ИЗ
	|	РегистрСведений.упСтатусыЗаданийНаПеревозкуГруза.СрезПоследних(&ТекущийПериод, Статус В (ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаданияНаПеревозкуГруза.ВключеноВРейс), ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаданияНаПеревозкуГруза.КВыполнению), ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаданияНаПеревозкуГруза.Выполняется), ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаданияНаПеревозкуГруза.ВПути))) КАК СрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упЗаданиеНаПеревозкуГрузаГрузовыеМеста.ГрузовоеМесто КАК Груз
	|ПОМЕСТИТЬ втГрузовыеМеста
	|ИЗ
	|	Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упЗаданиеНаПеревозкуГрузаГрузовыеМеста
	|ГДЕ
	|	упЗаданиеНаПеревозкуГрузаГрузовыеМеста.Ссылка В
	|			(ВЫБРАТЬ
	|				втДокументы.Документ КАК Ссылка
	|			ИЗ
	|				втДокументы КАК втДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втГрузовыеМеста.Груз КАК Груз,
	|	упГрузовыеМестаТоварныйСоставГруза.НомерСтроки КАК НомерСтроки,
	|	упГрузовыеМестаТоварныйСоставГруза.Номенклатура КАК Номенклатура
	|ИЗ
	|	втГрузовыеМеста КАК втГрузовыеМеста
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упГрузовыеМеста.ТоварныйСоставГруза КАК упГрузовыеМестаТоварныйСоставГруза
	|		ПО втГрузовыеМеста.Груз = упГрузовыеМестаТоварныйСоставГруза.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Груз,
	|	НомерСтроки,
	|	Номенклатура
	|ИТОГИ ПО
	|	Номенклатура ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("ТекущийПериод", КонецДня(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	ТаблицаЗначений.Колонки.Добавить("Груз",Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"),"Груз");
	ТаблицаЗначений.Колонки.Добавить("ПерваяГруппа",Новый ОписаниеТипов("СправочникСсылка.упНоменклатура"),"ПерваяГруппа");	
	ТаблицаЗначений.Колонки.Добавить("НомерСтроки",,"НомерСтроки");
	
	ПерваяГруппа = Справочники.упНоменклатура.ПустаяСсылка();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Уровень() = 0 Тогда 
			ПерваяГруппа = ВыборкаДетальныеЗаписи.Номенклатура;
		ИначеЕсли ВыборкаДетальныеЗаписи.ТипЗаписи() = ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			
			тОтбор = Новый Структура;
			тОтбор.Вставить("Груз",ВыборкаДетальныеЗаписи.Груз);
			тОтбор.Вставить("ПерваяГруппа",ПерваяГруппа);
			НайденыеСтроки = ТаблицаЗначений.НайтиСтроки(тОтбор);
			
			Если НайденыеСтроки.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаЗначений.Добавить();
				НоваяСтрока.Груз = ВыборкаДетальныеЗаписи.Груз;
				НоваяСтрока.ПерваяГруппа = ПерваяГруппа;
				НоваяСтрока.НомерСтроки = ВыборкаДетальныеЗаписи.НомерСтроки;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТаблицаЗначений;
	
КонецФункции // ПолучитьТаблицуВнешнегоНабораДанных()

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 