

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбратныйПуть") Тогда 
		Для Каждого текЗапись Из ЭтотОбъект Цикл 
			Если текЗапись.НачальныйАдрес = текЗапись.КонечныйАдрес Тогда 
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.упРасстоянияМеждуАдресами.СоздатьНаборЗаписей();
			НаборЗаписей.ДополнительныеСвойства.Вставить("ОбратныйПуть");
			НаборЗаписей.Отбор.НачальныйАдрес.Установить(текЗапись.КонечныйАдрес);
			НаборЗаписей.Отбор.КонечныйАдрес.Установить(текЗапись.НачальныйАдрес);
			
			ОбратныйПуть = НаборЗаписей.Добавить();
			ОбратныйПуть.НачальныйАдрес = текЗапись.КонечныйАдрес;
			ОбратныйПуть.КонечныйАдрес  = текЗапись.НачальныйАдрес;
			ОбратныйПуть.Расстояние     = текЗапись.Расстояние;
			ОбратныйПуть.Время          = текЗапись.Время;
			
			НаборЗаписей.Записать();
		КонецЦикла;	                
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти