#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПорядокИсполненияЗаявки = ПорядокИсполненияЗаявки(ПараметрКоманды);
	
	Если ПорядокИсполненияЗаявки = ПредопределенноеЗначение("Перечисление.упПорядокИсполненияЗаявок.Рейсом") Тогда
		ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды);
		ОткрытьФорму("Документ.упВходящаяПретензия.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	Иначе	
		ОписаниеОшибки = Нстр("ru = 'Запрещено формировать входящую претензию по заявке с порядком исполнения ""путевым листом""'");
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ОписаниеОшибки, Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПорядокИсполненияЗаявки(Ссылка)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПорядокИсполненияЗаявки");	
КонецФункции

#КонецОбласти
