
&НаКлиенте
Процедура ДанныеВыполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДанныеГеозоны"  Тогда
		
		ОткрытьФорму("Обработка.упЭлектроннаяГеографическаяКарта.Форма");
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Элемент.ТекущиеДанные.Зона);
		ПараметрКоманды.Добавить(Элемент.ТекущиеДанные.Родитель);
		Оповестить("ОтобразитьГеографическиеОбъекты", ПараметрКоманды);
			
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресХранилища") Тогда
		Данные.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресХранилища));
		Для Каждого строкаДанных Из Данные Цикл
			строкаДанных.Геозоны = Истина;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
