
#Область ПеременныеМодуляФормы

#КонецОбласти 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТранспортноеСредство") Тогда
		Список.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
		
		мсвМоделейТС = Новый Массив;
		мсвМоделейТС.Добавить(Справочники.упМоделиТС.ПустаяСсылка());
		Если ЗначениеЗаполнено(Параметры.ТранспортноеСредство) Тогда
			МодельТС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ТранспортноеСредство, "Модель");
			Если ЗначениеЗаполнено(МодельТС) Тогда
				мсвМоделейТС.Добавить(МодельТС);
			КонецЕсли; 
		КонецЕсли;	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "МодельТС", мсвМоделейТС, ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 