#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	НастройкиОтчета.Описание = НСтр("ru = 'Планируемые и фактические расходы по рейсам.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализРасходовПоРейсам");
	НастройкиВарианта.Описание = СтрШаблон(НСтр("ru = 'Анализ распределения расходов по статьям в разрезе рейсов, %1 перевозчиков и пр. Сравнение плана и факта по расходам'"), Символы.ПС);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДиаграммаДинамикиИзменения");
	НастройкиВарианта.Описание = НСтр("ru = 'Диаграмма динамики изменения расходам по дням по датам рейсов'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализРасходовПоТС");
	НастройкиВарианта.Описание = СтрШаблон(НСтр("ru = 'Анализ распределения расходов по статьям в разрезе транспортных средств. %1 Сравнение плана и факта по расходам'"), Символы.ПС);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли