
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ДоступностьЭлементов(Истина);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипОперацииПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяСканированиеШКПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьНомерИсходногоДокументаПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСоставаПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяФотографияПриОтменеЗадачиПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноПробитиеКассовогоЧекаПриИзменении(Элемент)
	
	ДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДоступностьЭлементов(Открытие = Ложь)

	Если Запись.ТипОперации = ПредопределенноеЗначение("Перечисление.упТипыОпераций.ДополнительнаяОперация") Тогда 
		Элементы.ТребуетсяСканированиеШК.Доступность = Ложь;
		Если Не Открытие Тогда 
			Запись.ТребуетсяСканированиеШК = Ложь;
		КонецЕсли;	
	Иначе	
		Элементы.ТребуетсяСканированиеШК.Доступность = Истина;
	КонецЕсли;	
	
	Элементы.РазрешенаУстановкаНовогоШК.Доступность                                 = Запись.ТребуетсяСканированиеШК;
	Элементы.СпособФормированияНомераДокумента.Доступность                          = Запись.ВыводитьНомерИсходногоДокумента;
	Элементы.ТребуетсяОтчитыватьсяОЗадачеПоКаждойСтрокеТоварногоСостава.Доступность = Запись.РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава;
	Элементы.НеобходимостьФотографииОпределяетсяНаУровнеПроблемы.Доступность        = Запись.ТребуетсяФотографияПриОтменеЗадачи;
	Элементы.ПробиватьКаждыйЧекОтдельнойКассовойСменой.Доступность                  = Запись.РазрешеноПробитиеКассовогоЧека;
	
КонецПроцедуры

#КонецОбласти 
