#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки размещения в панели отчетов.
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. "Реквизиты для изменения" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
// Описание:
//   См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Вспомогательные методы:
//   НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "<ИмяВарианта>");
//   ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Истина/Ложь); // Отчет
//   поддерживает только этот режим.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	
	НастройкиОтчета.Описание = НСтр("ru = 'Постатейный анализ финансовых результатов предприятия.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ФинансовыеРезультатыПредприятия");
	НастройкиВарианта.Описание = СтрШаблон(НСтр("ru = 'Анализ финансовых результатов предприятия по статьям доходов и расходов%1в разрезах организаций, подразделений и направлений деятельности'"), Символы.ПС);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ФинансовыеРезультатыПоНаправлениямДеятельности");
	НастройкиВарианта.Описание = СтрШаблон(НСтр("ru = 'Анализ финансовых результатов по статьям доходов и расходов%1в разрезе направлений деятельности'"), Символы.ПС);
	мсвФункциональныеОпции = Новый Массив;
	мсвФункциональныеОпции.Добавить("упИспользуетсяУчетПоНаправлениямДеятельности");
	НастройкиВарианта.ФункциональныеОпции = мсвФункциональныеОпции;
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ФинансовыеРезультатыПоПодразделениям");
	НастройкиВарианта.Описание = СтрШаблон(НСтр("ru = 'Анализ финансовых результатов по статьям доходов и расходов%1в разрезе подразделений'"), Символы.ПС);
	мсвФункциональныеОпции = Новый Массив;
	мсвФункциональныеОпции.Добавить("упИспользуетсяУчетПодразделений");
	НастройкиВарианта.ФункциональныеОпции = мсвФункциональныеОпции;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли