#Область ПрограммныйИнтерфейс

// Определить объекты метаданных, в модулях менеджеров которых ограничивается возможность 
// редактирования реквизитов при групповом изменении.
//
// Параметры:
//   Объекты - Соответствие - в качестве ключа указать полное имя объекта метаданных,
//                            подключенного к подсистеме "Групповое изменение объектов". 
//                            Дополнительно в значении могут быть перечислены имена экспортных функций:
//                            "РеквизитыНеРедактируемыеВГрупповойОбработке",
//                            "РеквизитыРедактируемыеВГрупповойОбработке".
//                            Каждое имя должно начинаться с новой строки.
//                            Если указано "*", значит в модуле менеджера определены обе функции.
//
// Пример: 
//   Объекты.Вставить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(), "*"); // определены обе функции.
//   Объекты.Вставить(Метаданные.БизнесПроцессы.ЗаданиеСРолевойАдресацией.ПолноеИмя(), "РеквизитыРедактируемыеВГрупповойОбработке");
//   Объекты.Вставить(Метаданные.Справочники.Партнеры.ПолноеИмя(), "РеквизитыРедактируемыеВГрупповойОбработке
//		|РеквизитыНеРедактируемыеВГрупповойОбработке");
//
Процедура ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты) Экспорт
	
	Объекты.Вставить(Метаданные.Справочники.упАдреса);
	Объекты.Вставить(Метаданные.Справочники.упГруппыТарифов);
	Объекты.Вставить(Метаданные.Справочники.упДатчики);
	Объекты.Вставить(Метаданные.Справочники.упДополнительноеОборудование);
	Объекты.Вставить(Метаданные.Справочники.упДополнительныеОперации);
	Объекты.Вставить(Метаданные.Справочники.упЗначенияДатчиков);
	Объекты.Вставить(Метаданные.Справочники.упКалибровочныеГрафики);
	Объекты.Вставить(Метаданные.Справочники.упКонтактныеЛицаПартнеров);
	Объекты.Вставить(Метаданные.Справочники.упКонтрагенты.ПолноеИмя(), "РеквизитыНеРедактируемыеВГрупповойОбработке");
	Объекты.Вставить(Метаданные.Справочники.упМобильныеУстройстваИТрекеры);
	Объекты.Вставить(Метаданные.Справочники.упМоделиТС);
	Объекты.Вставить(Метаданные.Справочники.упНоменклатура);
	Объекты.Вставить(Метаданные.Справочники.упНормыРасходаГСМ);
	Объекты.Вставить(Метаданные.Справочники.упПартнеры);
	Объекты.Вставить(Метаданные.Справочники.упПоказателиРасчета);
	Объекты.Вставить(Метаданные.Справочники.упПроблемы);
	Объекты.Вставить(Метаданные.Справочники.упПрочиеСоглашения);
	Объекты.Вставить(Метаданные.Справочники.упРасписанияПериодическихРейсов);
	Объекты.Вставить(Метаданные.Справочники.упСоглашенияСКлиентами);
	Объекты.Вставить(Метаданные.Справочники.упСоглашенияСПеревозчиками);
	Объекты.Вставить(Метаданные.Справочники.упСотрудники);
	Объекты.Вставить(Метаданные.Справочники.упСтилиЛиний);
	Объекты.Вставить(Метаданные.Справочники.упСтилиМаркеров);
	Объекты.Вставить(Метаданные.Справочники.упСтилиПолигонов);
	Объекты.Вставить(Метаданные.Справочники.упСхемыМультимодальныхПеревозок);
	Объекты.Вставить(Метаданные.Справочники.упТипыГрузов);
	Объекты.Вставить(Метаданные.Справочники.упТипыДокументовТСВодителей);
	Объекты.Вставить(Метаданные.Справочники.упТипыСобытий);
	Объекты.Вставить(Метаданные.Справочники.упТипыСобытийМониторинга);
	Объекты.Вставить(Метаданные.Справочники.упТипыШинУзловИАгрегатов);
	Объекты.Вставить(Метаданные.Справочники.упТопливныеКарты);
	Объекты.Вставить(Метаданные.Справочники.упТранспортныеСредства);
	Объекты.Вставить(Метаданные.Справочники.упУпаковкиНоменклатуры);
	Объекты.Вставить(Метаданные.Справочники.упЦветовыеСхемы);
	Объекты.Вставить(Метаданные.Справочники.упШиныУзлыИАгрегаты);
	Объекты.Вставить(Метаданные.Справочники.упПравилаПодбораПеревозчиковНаРейсы);
	
КонецПроцедуры

#КонецОбласти
