#Область ПрограммныйИнтерфейс
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ВидФормы = "ФормаСписка" Тогда
			ВызватьИсключение НСтр("ru = 'Содержимое служебного регистра ""Виды ГСМ транспортных средств"" 
									|редактируется в справочнике ""Транспортные средства"" на закладке ""Пробег/ГСМ"".'");

	КонецЕсли;
КонецПроцедуры
#КонецОбласти