
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	сткОтбор     = Новый Структура("ДополнительнаяОперация", ПараметрКоманды);
	сткПараметры = Новый Структура("Отбор", сткОтбор);
	ОткрытьФорму("Справочник.упТипыДополнительногоОборудования.ФормаСписка", сткПараметры, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти