
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Сообщение) Тогда
		ЭтаФорма.СообщениеПользователю = Параметры.Сообщение;
	ИначеЕсли Параметры.БылиОшибки Тогда 
		ЭтаФорма.СообщениеПользователю = "При выполнении команды возникли ошибки";
	КонецЕсли;
	ЭтаФорма.ДатаНачала = Параметры.ДатаНачала;
	Если Параметры.ОтборПоТекущемуСеансу Тогда 
		ЭтаФорма.НомерСеанса.Добавить(НомерСеансаИнформационнойБазы());
	КонецЕсли; 
	Элементы.КартинкаОшибка.Видимость = Параметры.БылиОшибки;
	Элементы.ЖурналОшибок.Видимость = Параметры.БылиОшибки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИнформацияНажатие(Элемент)
	
	ОтборПоУровню = Новый СписокЗначений;
	ОтборПоУровню.Добавить("Ошибка", "Ошибка");
	ОтборПоУровню.Добавить("Предупреждение", "Предупреждение");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Уровень", ОтборПоУровню);
	Если НомерСеанса.Количество() > 0 Тогда
		ПараметрыФормы.Вставить("Сеанс", НомерСеанса);
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда // Здесь дата по часовому поясу сеанса
		ДатаНачала = ТекущаяДата() - 8 * 60 * 60;
	КонецЕсли; 
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		ПараметрыФормы.Вставить("ДатаНачала", ДатаНачала);
	КонецЕсли;
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы);
	Закрыть();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура КопироватьВБуферОбмена(Команда)
	
	 упСервисныеФункцииКлиент.ПоместитьТекстВБуферОбменаОС(СообщениеПользователю);
	
КонецПроцедуры

#КонецОбласти 