#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьРегистрыДвижений(ДеревоОтчета)Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НовыйТипОбъектОтчета = ДеревоОтчета.Строки.Добавить();
	НовыйТипОбъектОтчета.ТипДанных = "ОбъектыРегистрации";
	ЗаполнитьРегистрыРегистратора(НовыйТипОбъектОтчета.Строки, Документ);
	
	НовыйТипОбъектОтчета = ДеревоОтчета.Строки.Добавить();
	НовыйТипОбъектОтчета.ТипДанных = "ОбъектыСсылочные";
	ЗаполнитьРегистрыПоСсылке(НовыйТипОбъектОтчета.Строки, Документ);
	
	ДеревоОтчета.Строки.Сортировать("ИмяРегистра", Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//КонецПроцедуры

Процедура ЗаполнитьРегистрыРегистратора(СтрокиРегистров, ДокументЗаполнения)

	ИгнорируемыеРегистры = ИменаИгнорируемыхРегистров();
	
	Для Каждого ЭлементДвижения Из ДокументЗаполнения.Метаданные().Движения Цикл
		Если ИгнорируемыеРегистры.Получить(ЭлементДвижения.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЕстьТакойРегистр(СтрокиРегистров, ЭлементДвижения.Имя) Тогда
			НовыйОбъектОтчета = СтрокиРегистров.Добавить();
			НовыйОбъектОтчета.ИмяРегистра = ЭлементДвижения.Имя;
			НовыйОбъектОтчета.ИмяТипаРегистра = ИмяТипаРегистраДляЗапроса(ЭлементДвижения.Имя);
			НовыйОбъектОтчета.Представление = ЭлементДвижения.Синоним;
		КонецЕсли;
	КонецЦикла;
	
	ПринудительныеРегистры = ПринудительноВыводимыеРегистры();
	Для Каждого ЭлементДвижения Из ПринудительныеРегистры Цикл
		Если ИгнорируемыеРегистры.Получить(ЭлементДвижения.Значение.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЕстьТакойРегистр(СтрокиРегистров, ЭлементДвижения.Значение.Имя) Тогда
			НовыйОбъектОтчета = СтрокиРегистров.Добавить();
			НовыйОбъектОтчета.ИмяРегистра = ЭлементДвижения.Значение.Имя;
			НовыйОбъектОтчета.ИмяТипаРегистра = ИмяТипаРегистраДляЗапроса(ЭлементДвижения.Значение.Имя);
			НовыйОбъектОтчета.Представление = ЭлементДвижения.Значение.Синоним;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРегистрыПоСсылке(СтрокиРегистров, ДокументЗаполнения)

	ИменаИгнорируемыхРегистры = ИменаИгнорируемыхРегистров();
	МассивПоиска = Новый Массив;
	МассивПоиска.Добавить(ДокументЗаполнения);
	НайденныеДанные = НайтиПоСсылкам(МассивПоиска);
	Для Каждого НайденныйЭлемент Из НайденныеДанные Цикл
		Если ИменаИгнорируемыхРегистры.Получить(НайденныйЭлемент[2].Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НадоДобавить = Ложь;
		Если Метаданные.РегистрыСведений.Найти(НайденныйЭлемент.Метаданные.Имя) <> Неопределено Тогда
			НадоДобавить = Истина;
		ИначеЕсли Метаданные.РегистрыСведений.Найти(НайденныйЭлемент.Метаданные.Имя) <> Неопределено Тогда
			НадоДобавить = Истина;
		КонецЕсли;
		Если НадоДобавить
			И СтрокиРегистров.Найти(НайденныйЭлемент.Метаданные.Имя, "ИмяРегистра") <> Неопределено Тогда
			НадоДобавить = Ложь;
		КонецЕсли;
		Если НадоДобавить Тогда
			Если Не ЕстьТакойРегистр(СтрокиРегистров, НайденныйЭлемент[2].Имя) Тогда
				НовыйОбъектОтчета = СтрокиРегистров.Добавить();
				НовыйОбъектОтчета.ИмяРегистра = НайденныйЭлемент[2].Имя;
				НовыйОбъектОтчета.ИмяТипаРегистра = ИмяТипаРегистраДляЗапроса(НайденныйЭлемент[2].Имя);
				НовыйОбъектОтчета.Представление = НайденныйЭлемент[2].Синоним;
				НовыйОбъектОтчета.ИскатьКолонкуРегистратора = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ЗаполнитьРегистрыПоСсылке(СтрокиРегистров)

Функция ЕстьТакойРегистр(СтрокиРегистров, ИмяРегистра)
	
	ЕстьРегистр = Истина;
	Если СтрокиРегистров.Найти(ИмяРегистра) = Неопределено Тогда
		ЕстьРегистр = Ложь;
	КонецЕсли;
	
	Возврат ЕстьРегистр;

КонецФункции // НетТакогоРегистра(СтрокиРегистров, ИмяРегистра)()

Функция ИмяТипаРегистраДляЗапроса(ИмяРегистра)

	ИмяТипаРегистра = "";
	Если Метаданные.РегистрыСведений.Найти(ИмяРегистра) <> Неопределено Тогда
		ИмяТипаРегистра = "РегистрСведений";
	ИначеЕсли Метаданные.РегистрыНакопления.Найти(ИмяРегистра) <> Неопределено Тогда
		ИмяТипаРегистра = "РегистрНакопления";
	КонецЕсли;
	
	Возврат ИмяТипаРегистра;

КонецФункции // ИмяТипаРегистраПоИмениРегистра()

// Список имен регистров, которые не нужно выводить в отчете
// для демонстрации пользователю
Функция ИменаИгнорируемыхРегистров()

	ИменаРегистров = Новый Соответствие;
	ИменаРегистров.Вставить("упРасстоянияМеждуТочками", Истина);
	ИменаРегистров.Вставить("упДанныеТрекеров"        , Истина);
	ИменаРегистров.Вставить("упДанныеДатчиков"        , Истина);
	
	Возврат ИменаРегистров;

КонецФункции // ИменаИнгорируемыхРегистров()

// Список имен регистров, в движении которых так же надо искать
// ссылку на документ отчета
Функция ПринудительноВыводимыеРегистры()

	Регистры = Новый СписокЗначений;
	Регистры.Добавить(Метаданные.РегистрыСведений.упСтатусыЗапросовУсловийПеревозок);
	//Регистры.Добавить(Метаданные.РегистрыСведений.упСтатусыЗаявокНаПеревозкуГруза);
	//Регистры.Добавить(Метаданные.РегистрыСведений.упСтатусыЗаданийНаПеревозкуГруза);
	Регистры.Добавить(Метаданные.РегистрыСведений.упСтатусыРейсов);
	Регистры.Добавить(Метаданные.РегистрыСведений.упСтатусыЗаявокНаТС);
	Регистры.Добавить(Метаданные.РегистрыСведений.упСтатусыПутевыхЛистов);
	Регистры.Добавить(Метаданные.РегистрыСведений.упСтатусыРемонтовИТОТС);
	
	Возврат Регистры;

КонецФункции // ИменаПринудительноВыводимыхРегистров()

#КонецОбласти