
#Область ПрограммныйИнтерфейс

// Описание типовых профилей доступа системы.
//
// Параметры:
//	ОписанияПрофилей - Структура - Описание.
//	ПараметрыОбновления - Структура - Параметры.
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

	#Область Описание_профиля_Логист
	
		// Профиль "Логист".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Идентификатор = "4e9c1bb9-ffc7-11e5-89e8-005056c00008";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Логист'");
		ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем осуществляется управление заявками и заданиями, производится планирование и исполнение рейсов. 
					|Ведется учет дорожных проишествий, и учет регламентных документов. Доступна настройка соответствующей НСИ'");
					
		// Роли БСП.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
				
		// ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБазовойНСИ"); // Старый БСП
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
		
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
		
		// ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщейБазовойНСИ"); // Старый БСП
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКалендарныхГрафиков");
		
		ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиТекущиеДела");
		ОписаниеПрофиля.Роли.Добавить("РаботаСПапкамиФайлов");
		ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
		ОписаниеПрофиля.Роли.Добавить("РежимВсеФункции");
		ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
		
		// ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ"); // Старый БСП
		ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
		// ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ"); Старый БСП
		
		// Роли ТМС.
		ОписаниеПрофиля.Роли.Добавить("упБазовыеПрава");
		
		// Документы, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗаявокНаПеревозкуГруза");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗаданийНаПеревозкуГруза");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеФактическиеДоходы");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеРейсов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеОтменыПеревозки");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеКорректировкиРейсов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗаявокНаТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПредложенияПеревозчика");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПодтвержденияЗаявкиНаТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПрохождениеТочек");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеДвижениеДокументовРейса");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеДоверенность");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеОтчетовИнкассатора");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗапросовУсловийПеревозок");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеФактическихРасходов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПрочихРасходов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСобытийМониторинга");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеВходящихПретензий");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеИсходящихПретензий");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеАвансовыхОтчетов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗадачСогласованияМаршрута");		
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеРегистрацияЗадолженностиПоДокументамРейса");
				
		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПутевыеЛисты");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаТранспортногоСредстваВодителя");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаПроисшествиеВПути");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеЗанятостьТранспорта");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаЧекККМ");
		
		// Справочники, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеВариантовНастроек");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеНСИ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСоглашенийСПеревозчиками");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеГрузовыхМест");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСотрудников");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеРасписанияПериодическихРейсов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПакетовРегламентныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеВидовПеревозок");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеГаражей");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТиповДокументовТСИВодителей");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСхемыМультимодальныхПеревозок");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПравилПодбораПеревозчиков");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПравилаВключенияКонтрольныхТочекВРейс");
						
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСоглашенийСКлиентами");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеНастроекПланирования");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеНастроекГрузовыхМест");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеТранспортныеСредства");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСклады");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПодразделений");		
		ОписаниеПрофиля.Роли.Добавить("упЧтениеНаправленийДеятельности");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПравилПодбораПеревозчиков");
				
		// Регистры сведений, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииРейсы");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеРасписаниеРаботыЭкипажей");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииФактическиеМестоположенияТС");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииСтатусыЗапросовУсловийПеревозок");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииНепереданныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииВыдачаТопливныеКарты");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииВидыГСМТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииАгрегатыТранспортныхСредств");
		
								
		// Отчеты.
		ОписаниеПрофиля.Роли.Добавить("упОтчетыУправлениеЗаявками");
		ОписаниеПрофиля.Роли.Добавить("упОтчетыПланированиеРейсов");
		ОписаниеПрофиля.Роли.Добавить("упОтчетыИсполнениеРейсов");
		ОписаниеПрофиля.Роли.Добавить("упОтчетыСпутниковыйМониторинг");
		ОписаниеПрофиля.Роли.Добавить("упОтчетыФинансы");
		ОписаниеПрофиля.Роли.Добавить("упОтчетыСервис");
		
		// Обработки.
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеПланированиеПериодическихРейсов");
				
		// Разделы.
		ОписаниеПрофиля.Роли.Добавить("упРазделПланированиеПеревозокЗаявкиИЗадания");
		ОписаниеПрофиля.Роли.Добавить("упРазделПланированиеПеревозокПланированиеРейсов");
		ОписаниеПрофиля.Роли.Добавить("упРазделПланированиеПеревозокПодборТСПеревозчика");
		// ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТСиУчетГСМДорожныеПроишествия");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомУправлениеДокументами");
		ОписаниеПрофиля.Роли.Добавить("упРазделИсполнениеПеревозокИсполнениеРейса");
		ОписаниеПрофиля.Роли.Добавить("упРазделСпутниковыйМониторингИМобильныйКлиентСпутниковыйМониторинг");
		ОписаниеПрофиля.Роли.Добавить("упРазделСервисИНастройкиУчетДокументов");
		ОписаниеПрофиля.Роли.Добавить("упРазделСервисИНастройкиНастройкиПланирования");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаРемонтыИТО");
		ОписаниеПрофиля.Роли.Добавить("упРазделСервисИНастройкиГрузы");
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеПредприятие");
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеНоменклатура");
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеПартнеры");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомНСИТранспорт");
		ОписаниеПрофиля.Роли.Добавить("упРазделФинансыФактическиеДоходы");
		ОписаниеПрофиля.Роли.Добавить("упРазделФинансыФактическиеРасходы");
		ОписаниеПрофиля.Роли.Добавить("упРазделФинансыТарификация");

		 								
		// Дополнительные опции.
		ОписаниеПрофиля.Роли.Добавить("упСогласованиеЗаявкиНаПеревозкуГруза");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеГеографическихКарт");
		ОписаниеПрофиля.Роли.Добавить("упОтменаЗаданияНаПеревозкуГруза");
		ОписаниеПрофиля.Роли.Добавить("упОтменаЗаявкиНаПеревозкуГруза");
		ОписаниеПрофиля.Роли.Добавить("упОтменаРейсаВСтатусеКВыполнению");
		
		
		// Рабочие места.
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМПланированиеРейсов");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМНазначениеТСНаРейсы");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМКонтрольИИсполнениеРейсов");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМСпутниковыйМониторинг");
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
		
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	#КонецОбласти
	
	#Область Описание_профиля_Диспетчер_гаража
	
		// Профиль "Диспетчер гаража".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
		ОписаниеПрофиля.Идентификатор = "4e9c1bb9-ffc7-11e5-89e8-005056c00009";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Диспетчер гаража'");
		ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем осуществляется работа с путевыми листами. Ведется учет транспортных средств, документов водителей и транспортных средств. 
					|Возможен учет дорожных проишествий. Доступна настройка соответствующей НСИ'");
					
		// Роли БСП.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
		// ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБазовойНСИ");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
		ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");

		// ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ"); // Старый БСП
		ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
		
		// ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ"); Старый БСП
		
		// Роли ТМС.
		ОписаниеПрофиля.Роли.Добавить("упБазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("упМониторинг");
		
		// Документы, добавление.
		// ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПроишествиеВПути");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПутевыхЛистов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеДокументовТранспортныхСредствВодителей");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗаправокСливовГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеИзменениеСостоянияТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПрисоединениеОтсоединениеПрицепов");
					
				
		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаРейс");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаЭтапПодбораПеревозчика");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаЗаданиеНаПеревозкуГруза");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаПодтверждениеЗаявкиНаТС");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПрохождениеТочки");
				
		// Справочники, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТиповДокументовТСИВодителей");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТопливныхКарт");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеВариантовНастроек");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеНормРасходаГСМ");
								
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСоглашенийСПеревозчиками");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеТранспортныеСредства");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеОрганизации");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСоглашенийПрочие");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСтатейДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеГаражи");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСотрудники");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПодразделений");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеНаправленийДеятельности");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеРежимовРаботыОборудования");
						
		// Регистры сведений, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииРейсы");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииАгрегатыТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииНормыРасходаРежимовРаботы");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииВыдачаТопливныеКарты");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииДанныеТопливныхКомпаний");

		
		// Регистры накоплений, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеОстаткиГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПробегТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеНормТО");
		
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииНаработкаОборудования");
		
		// Отчеты.
		ОписаниеПрофиля.Роли.Добавить("упОтчетыУправлениеТСиУчетГСМ");
		
		// Обработки.
				
		// Разделы.
		// ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТСиУчетГСМДорожныеПроишествия");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомУправлениеДокументами");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомУправлениеТранспортнымиСредствами");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаУчетГСМ");
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеПартнеры");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомНСИТранспорт");
		ОписаниеПрофиля.Роли.Добавить("упРазделИсполнениеПеревозокИсполнениеРейса");
		ОписаниеПрофиля.Роли.Добавить("упРазделСпутниковыйМониторингИМобильныйКлиентСпутниковыйМониторинг");
		ОписаниеПрофиля.Роли.Добавить("упРазделИсполнениеПеревозокПутевыеЛисты");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаРемонтыИТО");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаНормыРасходаГСМ");
		ОписаниеПрофиля.Роли.Добавить("упРазделСервисИНастройкиТопология");
								
		// Дополнительные опции.
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеГеографическихКарт");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеЗагрузкиДанныхОтТопливныхКомпаний");
		
		// Рабочие места.
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМДиспетчерГаража");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМСпутниковыйМониторинг");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеФормыНастройкиОтбора");
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
				
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
		
		
		
		
	#КонецОбласти
	
	#Область Описание_профиля_Механик
	
		// Профиль "Механик".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
		ОписаниеПрофиля.Идентификатор = "4e9c1bb9-ffc7-11e5-89e8-005056c00010";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Механик'");
		ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем осуществляется управление заявками и заданиями, производится планирование и исполнение рейсов. 
					|Ведется учет дорожных проишествий, и учет регламентных документов. Доступна настройка соответствующей НСИ'");
					
		// Роли БСП.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");

		// ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБазовойНСИ"); // Старый БСП
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафиковРаботы");
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
		
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов");
		ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
		ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
		ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");

		// ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ"); // Старый БСП
		ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
		
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
		// ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБазовойНСИ"); Старый БСП
		ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
		
		// Роли ТМС.
		ОписаниеПрофиля.Роли.Добавить("упБазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("упМониторинг");
		
		
		// Задачи, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗадачПродленияДокументовТСИВодителей");
		
		// Документы, добавление.
		// ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПроишествиеВПути");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПутевыхЛистов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеИзменениеСостоянияТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПринятиеКУчетуТранспортногоСредства");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСнятиеСУчетаТранспортногоСредства");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПрисоединениеОтсоединениеПрицепов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗаправокСливовГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеКорректировокОстатковГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТопливныхКарт");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеРемонтныхДокументов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеВидыРемонтов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗапчасти");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеРаботыПоРемонту");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПрочихРасходов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеДокументовТранспортныхСредствВодителей");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПоступлениеАгрегатов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСписаниеАгрегатов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПеремещениеАгрегатов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеКорректировкаОстатковАгрегатов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПоступлениеМатериалов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСписаниеМатериалов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПеремещениеМатериалов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеКорректировкаОстатковМатериалов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеШтраф");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСлужебноеРасследование");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеРегламентнаяОперация");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСобственныхТранспортныхСредств");
		                               
		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаРейс");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаЭтапПодбораПеревозчика");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаЗаданиеНаПеревозкуГруза");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаПодтверждениеЗаявкиНаТС");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПрохождениеТочки");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаПроисшествиеВПути");
		
		// Справочники, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеГаражей");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСотрудников");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗапчасти");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеРаботыПоРемонту");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТопливныхКарт");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЦенРаботПоРемонту");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеШиныУзлыИАгрегаты");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТипыШинУзловИАгрегатов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТипыТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеМоделейТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеТипыКузововТС");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПроизводственныеКалендари");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеМестаРемонтов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеНормРасходаГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеСклады");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСтатейДоходовРасходов");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеВариантовНастроек");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСоглашенийСКлиентами");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеУпаковкиНоменклатуры");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеНастроекГрузовыхМест");
				
		// Журналы.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеЖурналаДвижениеАгрегатов");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеЖурналаДвижениеМатериалов");
		
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСоглашенийСПеревозчиками");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеСоглашенийПрочие");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииПоПартнерам");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеТранспортныеСредства");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеОрганизации");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПодразделений");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеНаправленийДеятельности");		

		// Регистры сведений, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЦенРаботПоРемонту");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеУчетнаяПолитика");
		
		// Регистры сведений, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииРейсы");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииВыдачаТопливныеКарты");
		
		// Регистры накоплений, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеОстаткиГСМ");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПробегТС");
						
		// Отчеты.
		ОписаниеПрофиля.Роли.Добавить("упОтчетыУправлениеТСиУчетГСМ");
		ОписаниеПрофиля.Роли.Добавить("упОтчетыЖурналУчетаДвиженияПутевыхЛистов");
				
		// Обработки.
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеЗакрытияМесяца");
						
		// Разделы.                    
		// ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТСиУчетГСМДорожныеПроишествия");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомУправлениеДокументами");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаУчетГСМ");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомУправлениеТранспортнымиСредствами");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаРемонтыИТО");
       	ОписаниеПрофиля.Роли.Добавить("упРазделФинансыФактическиеРасходы");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаУчетШинУзловИАгрегатов");
       	ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаУправлениеЗапасами");
		ОписаниеПрофиля.Роли.Добавить("упРазделИсполнениеПеревозокДорожныеПроисшествия");
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеПартнеры");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомНСИТранспорт");
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеНСИ");
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеПредприятие");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаРемонтыИТО");
		ОписаниеПрофиля.Роли.Добавить("упРазделОбслуживаниеТранспортаНормыРасходаГСМ");
		ОписаниеПрофиля.Роли.Добавить("упРазделСпутниковыйМониторингИМобильныйКлиентСобытияМониторинга");
		ОписаниеПрофиля.Роли.Добавить("упРазделИсполнениеПеревозокИсполнениеРейса");
		ОписаниеПрофиля.Роли.Добавить("упРазделИсполнениеПеревозокПутевыеЛисты");
		ОписаниеПрофиля.Роли.Добавить("упРазделСпутниковыйМониторингИМобильныйКлиентСпутниковыйМониторинг");
		
		// Дополнительные опции.
		
		// Рабочие места.
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМСпутниковыйМониторинг");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеФормыНастройкиОтбора");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМПланированиеРемонтов");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМУправлениеРемонтами");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМДиспетчерГаража");
		
		ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
		ОписаниеПрофиля.ВидыДоступа.Добавить("Организации"                 , "ВначалеВсеРазрешены");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	#КонецОбласти
	
	#Область Описание_профиля_Перевозчик
	
		// Профиль "Перевозчик".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
		ОписаниеПрофиля.Идентификатор = "4e9c1bb9-ffc7-11e5-89e8-005056c00011";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Перевозчик'");
		ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем осуществляется доступ внешних пользователей для формирования предложений перевозчиков и прохождения точек рейсов.'");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписаниеПрофиля.Назначение, Метаданные.ОпределяемыеТипы.ВнешнийПользователь.Тип.Типы());
		
		// Роли БСП.
		ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВнешнегоПользователя");
		ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
		ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");

		// ОписаниеПрофиля.Роли.Добавить("ЧтениеБазовойНСИ"); // Старый БСП
		ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботы");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
		                      
		ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
		
		
		// Роли ТМС.
		ОписаниеПрофиля.Роли.Добавить("упБазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("упПеревозчик");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеТекущегоВнешнегоПользователя");
		
		// Документы, добавление.
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПрохождениеТочекПеревозчиком");
		//ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеПодтвержденияЗаявкиНаТС");
		
		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаЭтапПодбораПеревозчика");
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПроблемы");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеМоделиТрекеров");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеМобильныеУстройстваИТрекеры");

		// Регистры сведений, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииУчетныеПараметрыТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииСостояниеТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииВидыГСМТранспортныхСредств");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииУстановленныеТрекеры");
		
		// Регистры накоплений, чтение.
		ОписаниеПрофиля.Роли.Добавить("упРазделАдминистрированиеПартнеры");
		ОписаниеПрофиля.Роли.Добавить("упРазделУправлениеТранспортомНСИТранспорт");
		//ОписаниеПрофиля.Роли.Добавить("упРазделСервисИНастройкиТопология");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеИнформацииОстаткиГСМ");
				
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	#КонецОбласти
	
	#Область Описание_Профиля_МобильныйКлиент
	
		// Профиль "МобильныйКлиент".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
		ОписаниеПрофиля.Идентификатор = "4e9c1bb9-ffc7-11e5-89e8-005056c00012";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Мобильный клиент (служебный)'");
		ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем осуществляются вызовы веб-сервисов сервером мобильных приложений.'");
		
		ОписаниеПрофиля.Роли.Добавить("упМобильныйКлиент");
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
	#КонецОбласти 
	
#Область Описание_профиля_Оператор
	
	// Профиль "Оператор".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = "4e9c1bb9-ffc7-11e5-89e8-005056c00013";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Оператор'");
	ОписаниеПрофиля.Описание =
	НСтр("ru = 'Под профилем осуществляется работа со всеми объектами системы ");
	
	мсвНедоступныхРолей = ПолучитьНедоступныеОператоруРоли();
	
	Для каждого текРоль Из Метаданные.Роли Цикл
		Если мсвНедоступныхРолей.Найти(текРоль.Имя) = Неопределено Тогда
			ОписаниеПрофиля.Роли.Добавить(текРоль.Имя);
		КонецЕсли; 
	КонецЦикла; 
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации"  , "ВначалеВсеРазрешены");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	
#КонецОбласти

#Область Описание_профиля_ТорговыйПредставитель
	
		// Профиль "Тороговый представитель".
		ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();;
		ОписаниеПрофиля.Идентификатор = "4e9c1bb9-ffc7-11e5-34e8-005056c00013";
		ОписаниеПрофиля.Наименование  = НСтр("ru = 'Торговый представитель'");
		ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем осуществляется доступ внешних пользователей для просмотра информации по маршруту и заданиям.'");
			
		// Роли БСП.
//{{MRG[ <-> ]
		ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
//}}MRG[ <-> ]
		ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
		ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
		ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
		ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
		
		// Роли ТМС.
		ОписаниеПрофиля.Роли.Добавить("упБазовыеПрава");
		ОписаниеПрофиля.Роли.Добавить("упИспользованиеРМТорговогоПредставителя");
		ОписаниеПрофиля.Роли.Добавить("упДобавлениеИзменениеЗадачСогласованияМаршрута");
		
		
		// Справочники, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПроблемы");
		
		// Документы, чтение.
		ОписаниеПрофиля.Роли.Добавить("упЧтениеПрохождениеТочки");
		ОписаниеПрофиля.Роли.Добавить("упЧтениеДокументаЗаявкаНаПеревозкуГруза");
		
		// Разделы.                    
		ОписаниеПрофиля.Роли.Добавить("упРазделПланированиеПеревозокТорговыеПредставители");
		
		ОписанияПрофилей.Добавить(ОписаниеПрофиля);
			
	#КонецОбласти

КонецПроцедуры	

// См. ВзаимодействияПереопределяемый.ПриЗаполненииНаборовЗначенийДоступа.
Процедура ПриЗаполненииНаборовЗначенийДоступаДляОбъектаВзаимодействия(Объект, Таблица) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ДокументОбъект.Встреча") Тогда
		ПриЗаполненииНаборовЗначенийДоступаДляВстречи(Объект, Таблица);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЗапланированноеВзаимодействие") Тогда
		ПриЗаполненииНаборовЗначенийДоступаДляЗапланированногоВзаимодействия(Объект, Таблица);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.СообщениеSMS") Тогда
		ПриЗаполненииНаборовЗначенийДоступаДляСообщенияSMS(Объект, Таблица);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ТелефонныйЗвонок") Тогда
		ПриЗаполненииНаборовЗначенийДоступаДляТелефонногоЗвонка(Объект, Таблица);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЭлектронноеПисьмоВходящее") Тогда
		ПриЗаполненииНаборовЗначенийДоступаДляЭлектронногоПисьмаВходящего(Объект, Таблица);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ДокументОбъект.ЭлектронноеПисьмоИсходящее") Тогда
		ПриЗаполненииНаборовЗначенийДоступаДляЭлектронногоПисьмаИсходящего(Объект, Таблица);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

// Заполнение значений наборов доступа.

Процедура ПриЗаполненииНаборовЗначенийДоступаДляВстречи(Объект, Таблица)

	// Логика ограничения следующая: объект доступен если доступен  "Автор" или "Ответственный".
	// Логика "ИЛИ" реализуется через различные номера наборов.

	// Ограничение по "УчетныеЗаписиЭлектроннойПочты".
	НомерНабора = 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.Автор;

	// Ограничение по "Ответственный".
	НомерНабора = НомерНабора + 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.Ответственный;

	МассивКонтактныхЛиц = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.Участники Цикл

		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контакт) Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упПартнеры") Тогда

			НомерНабора = НомерНабора + 1;

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = СтрокаТаблицы.Контакт;

		ИначеЕсли ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упКонтактныеЛицаПартнеров") Тогда

			МассивКонтактныхЛиц.Добавить(СтрокаТаблицы.Контакт);

		КонецЕсли;

	КонецЦикла;

	Если МассивКонтактныхЛиц.Количество() > 0 Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеров.Владелец КАК Партнер
		|ИЗ
		|	Справочник.упКонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Ссылка В(&МассивКонтактныхЛиц)
		|");
		Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл

			НомерНабора = НомерНабора + 1;

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Выборка.Партнер;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаполненииНаборовЗначенийДоступаДляЗапланированногоВзаимодействия(Объект, Таблица)

	// Логика ограничения следующая: объект доступен если доступен  "Автор" или "Ответственный".
	// Логика "ИЛИ" реализуется через различные номера наборов.

	// Ограничение по "УчетныеЗаписиЭлектроннойПочты".
	НомерНабора = 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.Автор;

	// Ограничение по "Ответственный".
	НомерНабора = НомерНабора + 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.Ответственный;

	МассивКонтактныхЛиц = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.Участники Цикл

		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контакт) Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упПартнеры") Тогда

			НомерНабора = НомерНабора + 1;

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = СтрокаТаблицы.Контакт;

		ИначеЕсли ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упКонтактныеЛицаПартнеров") Тогда

			МассивКонтактныхЛиц.Добавить(СтрокаТаблицы.Контакт);

		КонецЕсли;

	КонецЦикла;

	Если МассивКонтактныхЛиц.Количество() > 0 Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеров.Владелец КАК Партнер
		|ИЗ
		|	Справочник.упКонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Ссылка В(&МассивКонтактныхЛиц)
		|");
		Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл

			НомерНабора = НомерНабора + 1;

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Выборка.Партнер;

		КонецЦикла;

	КонецЕсли;	

КонецПроцедуры

Процедура ПриЗаполненииНаборовЗначенийДоступаДляСообщенияSMS(Объект, Таблица)

	// Логика ограничения следующая: объект доступен если доступен  "Автор" или "Ответственный".
	// Логика "ИЛИ" реализуется через различные номера наборов.

	// Ограничение по "УчетныеЗаписиЭлектроннойПочты".
	НомерНабора = 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.Автор;

	// Ограничение по "Ответственный".
	НомерНабора = НомерНабора + 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.Ответственный;

	МассивКонтактныхЛиц = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.Адресаты Цикл

		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контакт) Тогда
			Продолжить;
		КонецЕсли;

		Если ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упПартнеры") Тогда

			НомерНабора = НомерНабора + 1;

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = СтрокаТаблицы.Контакт;

		ИначеЕсли ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упКонтактныеЛицаПартнеров") Тогда

			МассивКонтактныхЛиц.Добавить(СтрокаТаблицы.Контакт);

		КонецЕсли;

	КонецЦикла;

	Если МассивКонтактныхЛиц.Количество() > 0 Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеров.Владелец КАК Партнер
		|ИЗ
		|	Справочник.упКонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Ссылка В(&МассивКонтактныхЛиц)
		|");
		Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл

			НомерНабора = НомерНабора + 1;

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Выборка.Партнер;

		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаполненииНаборовЗначенийДоступаДляТелефонногоЗвонка(Объект, Таблица)

	// Логика ограничения следующая: объект доступен если доступен  "Автор" или "Ответственный".
	// Логика "ИЛИ" реализуется через различные номера наборов.
	
	// Ограничение по "Автор".
	НомерНабора = 1;

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.НомерНабора     = НомерНабора;
	СтрокаТаблицы.ЗначениеДоступа = Объект.Автор;

	// Ограничение по "Ответственный".
	НомерНабора = НомерНабора + 1;

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.НомерНабора     = НомерНабора;
	СтрокаТаблицы.ЗначениеДоступа = Объект.Ответственный;

	Если ЗначениеЗаполнено(Объект.АбонентКонтакт) Тогда

		Если ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.упПартнеры") Тогда

			НомерНабора = НомерНабора + 1;

			СтрокаТаблицы = Таблица.Добавить();
			СтрокаТаблицы.упПартнерыНомерНабора     = НомерНабора;
			СтрокаТаблицы.ЗначениеДоступа = Объект.АбонентКонтакт;

		ИначеЕсли ТипЗнч(Объект.АбонентКонтакт) = Тип("СправочникСсылка.упКонтактныеЛицаПартнеров") Тогда

			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КонтактныеЛицаПартнеров.Владелец КАК Партнер
			|ИЗ
			|	Справочник.упКонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
			|ГДЕ
			|	КонтактныеЛицаПартнеров.Ссылка =&АбонентКонтакт
			|");
			Запрос.УстановитьПараметр("АбонентКонтакт", Объект.АбонентКонтакт);
			Выборка = Запрос.Выполнить().Выбрать();

			Пока Выборка.Следующий() Цикл

				НомерНабора = НомерНабора + 1;

				СтрокаТаблицы = Таблица.Добавить();
				СтрокаТаблицы.НомерНабора     = НомерНабора;
				СтрокаТаблицы.ЗначениеДоступа = Выборка.Партнер;

			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаполненииНаборовЗначенийДоступаДляЭлектронногоПисьмаВходящего(Объект, Таблица)

	// Логика ограничения следующая: объект доступен если доступен  "Ответственный" или "Учетная запись".
	// Логика "ИЛИ" реализуется через различные номера наборов.

	// Ограничение по "УчетныеЗаписиЭлектроннойПочты".
	НомерНабора = 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.УчетнаяЗапись;

	// Ограничение по "Ответственный".
	НомерНабора = НомерНабора + 1;

	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.НомерНабора     = НомерНабора;
	СтрокаТаб.ЗначениеДоступа = Объект.Ответственный;

	МассивКонтактныхЛиц = Новый Массив;

	МассивТабличныхЧастей = Новый Массив;
	МассивТабличныхЧастей.Добавить("ПолучателиПисьма");
	МассивТабличныхЧастей.Добавить("ПолучателиКопий");
	МассивТабличныхЧастей.Добавить("ПолучателиОтвета");
	Для Каждого ТабличнаяЧасть Из МассивТабличныхЧастей Цикл

		Для Каждого СтрокаТаблицы Из Объект[ТабличнаяЧасть] Цикл

			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контакт) Тогда
				Продолжить;
			КонецЕсли;

			Если ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упПартнеры") Тогда

				НомерНабора = НомерНабора + 1;

				СтрокаТаб = Таблица.Добавить();
				СтрокаТаб.НомерНабора     = НомерНабора;
				СтрокаТаб.ЗначениеДоступа = СтрокаТаблицы.Контакт;

			ИначеЕсли ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упКонтактныеЛицаПартнеров") Тогда

				МассивКонтактныхЛиц.Добавить(СтрокаТаблицы.Контакт);

			КонецЕсли;

		КонецЦикла;
	КонецЦикла;

	Если МассивКонтактныхЛиц.Количество() > 0 Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеров.Владелец КАК Партнер
		|ИЗ
		|	Справочник.упКонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Ссылка В(&МассивКонтактныхЛиц)
		|");
		Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл

			НомерНабора = НомерНабора + 1;

			СтрокаТаб = Таблица.Добавить();
			СтрокаТаб.НомерНабора     = НомерНабора;
			СтрокаТаб.ЗначениеДоступа = Выборка.Партнер;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаполненииНаборовЗначенийДоступаДляЭлектронногоПисьмаИсходящего(Объект, Таблица)

	// Логика ограничения следующая: объект доступен если доступен  "Ответственный" или "Учетная запись"
	// или "Автор".
	// Логика "ИЛИ" реализуется через различные номера наборов.

	НомерНабора = 1;

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.НомерНабора     = НомерНабора;
	СтрокаТаблицы.ЗначениеДоступа = Объект.УчетнаяЗапись;

	НомерНабора = НомерНабора + 1;

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.НомерНабора     = НомерНабора;
	СтрокаТаблицы.ЗначениеДоступа = Объект.Автор;

	НомерНабора = НомерНабора + 1;

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.НомерНабора     = НомерНабора;
	СтрокаТаблицы.ЗначениеДоступа = Объект.Ответственный;

	МассивКонтактныхЛиц = Новый Массив;

	МассивТабличныхЧастей = Новый Массив;
	МассивТабличныхЧастей.Добавить("ПолучателиПисьма");
	МассивТабличныхЧастей.Добавить("ПолучателиКопий");
	МассивТабличныхЧастей.Добавить("ПолучателиОтвета");
	МассивТабличныхЧастей.Добавить("ПолучателиСкрытыхКопий");
	Для Каждого ТабличнаяЧасть Из МассивТабличныхЧастей Цикл

		Для Каждого СтрокаТаблицы Из Объект[ТабличнаяЧасть] Цикл

			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Контакт) Тогда
				Продолжить;
			КонецЕсли;

			Если ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упПартнеры") Тогда

				НомерНабора = НомерНабора + 1;

				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.НомерНабора     = НомерНабора;
				НоваяСтрока.ЗначениеДоступа = СтрокаТаблицы.Контакт;

			ИначеЕсли ТипЗнч(СтрокаТаблицы.Контакт) = Тип("СправочникСсылка.упКонтактныеЛицаПартнеров") Тогда

				МассивКонтактныхЛиц.Добавить(СтрокаТаблицы.Контакт);

			КонецЕсли;

		КонецЦикла;
	КонецЦикла;

	Если МассивКонтактныхЛиц.Количество() > 0 Тогда

		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КонтактныеЛицаПартнеров.Владелец КАК Партнер
		|ИЗ
		|	Справочник.упКонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
		|ГДЕ
		|	КонтактныеЛицаПартнеров.Ссылка В(&МассивКонтактныхЛиц)
		|");
		Запрос.УстановитьПараметр("МассивКонтактныхЛиц", МассивКонтактныхЛиц);
		Выборка = Запрос.Выполнить().Выбрать();

		Пока Выборка.Следующий() Цикл

			НомерНабора = НомерНабора + 1;

			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.НомерНабора     = НомерНабора;
			НоваяСтрока.ЗначениеДоступа = Выборка.Партнер;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

// Заполнение ограничения доступа.

Функция ПолучитьНедоступныеОператоруРоли()	
	
	мсвНедоступныхРолей = Новый Массив;
	мсвНедоступныхРолей.Добавить("АдминистраторСистемы");
	мсвНедоступныхРолей.Добавить("Администрирование");
	мсвНедоступныхРолей.Добавить("БазовыеПраваВнешнегоПользователя");
	мсвНедоступныхРолей.Добавить("ДобавлениеИзменениеВнешнихПользователей");
	мсвНедоступныхРолей.Добавить("ДобавлениеИзменениеПользователей");
	мсвНедоступныхРолей.Добавить("ЗапускAutomation");
	мсвНедоступныхРолей.Добавить("ЗапускВнешнегоСоединения");
	мсвНедоступныхРолей.Добавить("НастройкаИОценкаПроизводительности");
	мсвНедоступныхРолей.Добавить("ОбновлениеКонфигурацииБазыДанных");
	мсвНедоступныхРолей.Добавить("ПодключениеКСервисуИнтернетПоддержки");
	мсвНедоступныхРолей.Добавить("ПолныеПрава");
	мсвНедоступныхРолей.Добавить("сшпАдминистратор");
	мсвНедоступныхРолей.Добавить("сшпОбменСESB");
	мсвНедоступныхРолей.Добавить("УдаленныйДоступАдминистрированиеИБВМоделиСервиса");
	мсвНедоступныхРолей.Добавить("УдаленныйДоступБазоваяФункциональность");
	мсвНедоступныхРолей.Добавить("УдаленныйДоступОбменДаннымиВМоделиСервиса");
	мсвНедоступныхРолей.Добавить("УдаленныйДоступОбменСообщениями");
	мсвНедоступныхРолей.Добавить("УдаленныйДоступСтандартныйИнтерфейсOData");
	мсвНедоступныхРолей.Добавить("упРазработчик");
	мсвНедоступныхРолей.Добавить("упМобильныйКлиент");
	мсвНедоступныхРолей.Добавить("упАнализЗаявок");
	мсвНедоступныхРолей.Добавить("упАнализИспользованияТС");
	мсвНедоступныхРолей.Добавить("упАнализРейсов");
	мсвНедоступныхРолей.Добавить("упДиспетчерТС");
	мсвНедоступныхРолей.Добавить("упМониторинг");
	мсвНедоступныхРолей.Добавить("упПеревозчик");
	мсвНедоступныхРолей.Добавить("упПодборТС");
	мсвНедоступныхРолей.Добавить("упУправлениеЗаданиями");
	мсвНедоступныхРолей.Добавить("упУправлениеЗаявками");
	мсвНедоступныхРолей.Добавить("упФормированиеРейсов");
	мсвНедоступныхРолей.Добавить("упДобавлениеИзменениеПрохождениеТочекПеревозчиком");
	мсвНедоступныхРолей.Добавить("упПодтверждениеКорректностиГеографическихДанных");


	Возврат мсвНедоступныхРолей; 
	
КонецФункции
	
#КонецОбласти