
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоМаршрута    = Параметры.НачалоМаршрута;
	ОкончаниеМаршрута = Параметры.ОкончаниеМаршрута;
	
	Если ЗначениеЗаполнено(НачалоМаршрута) Тогда
		ВыезжатьИзГаража = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОкончаниеМаршрута) Тогда
		ВозвращатьсяВГараж = Истина;
	КонецЕсли;
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыезжатьИзГаражаПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы()
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвращатьсяВГаражПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы()
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Отказ = Ложь;
	Если ВыезжатьИзГаража И Не ЗначениеЗаполнено(НачалоМаршрута) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите гараж выезда'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "НачалоМаршрута",, Отказ);	
	КонецЕсли; 
	
	Если ВозвращатьсяВГараж И Не ЗначениеЗаполнено(ОкончаниеМаршрута) Тогда
	    ТекстСообщения = НСтр("ru = 'Укажите гараж возвращения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ОкончаниеМаршрута",, Отказ);	
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	Закрыть(Новый Структура("НачалоМаршрута, ОкончаниеМаршрута", ?(ВыезжатьИзГаража, НачалоМаршрута, Неопределено), ?(ВозвращатьсяВГараж, ОкончаниеМаршрута, Неопределено)));	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если ВыезжатьИзГаража Тогда
		Элементы.НачалоМаршрута.Доступность = Истина;
		Элементы.ДекорацияНачалоМаршрута.Доступность = Истина;
		Элементы.НачалоМаршрута.ПодсказкаВвода = НСтр("ru = 'укажите начало маршрута'");
	Иначе	
		Элементы.НачалоМаршрута.Доступность = Ложь;
		Элементы.ДекорацияНачалоМаршрута.Доступность = Ложь;
		Элементы.НачалоМаршрута.ПодсказкаВвода = "";
	КонецЕсли; 
	
	Если ВозвращатьсяВГараж Тогда
		Элементы.ОкончаниеМаршрута.Доступность = Истина;
		Элементы.ДекорацияОкончаниеМаршрута.Доступность = Истина;
		Элементы.ОкончаниеМаршрута.ПодсказкаВвода = НСтр("ru = 'укажите окончание маршрута'");
	Иначе	
		Элементы.ОкончаниеМаршрута.Доступность = Ложь;
		Элементы.ДекорацияОкончаниеМаршрута.Доступность = Ложь;
		Элементы.ОкончаниеМаршрута.ПодсказкаВвода = "";
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 