#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
		ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
		упРаспределениеРасходов.ЗаполнитьДоходыРасходы(ЭтотОбъект, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРасходы(ЗаполнитьРасходыПоРейсам = Истина, ЗаполнитьРасходыПоТС = Истина, ЗаполнитьРасходыФинансовыйРезультат = Истина, сткПараметры = Неопределено) Экспорт
	
	РеквизитыОбъекта = Новый Структура("Дата,
								|ПериодРаспределенияЗатратНачало,
								|ПериодРаспределенияЗатратОкончание,
								|Валюта,
								|ПравилоРаспределенияПрямыхРасходов, 
								|Организация, 										
								|Подразделение,
								|ДанныеРегистраРасходы,
								|ДанныеРегистраРасходыНаТС,
								|ДанныеРегистраДоходыРасходыПредприятия,
								|НаправлениеДеятельности");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("АналитическийРазрез", Неопределено);
	
	ВедетсяВалютныйУчет	   = ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет",                 ВедетсяВалютныйУчет);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоРейсам",            ЗаполнитьРасходыПоРейсам);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоТС",                ЗаполнитьРасходыПоТС);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыФинансовыйРезультат", ЗаполнитьРасходыФинансовыйРезультат);
	
	Отказ = Ложь;
	упРаспределениеРасходов.ЗаполнитьПрямыеРасходы(ДополнительныеСвойства, ЭтотОбъект.Ссылка, РеквизитыОбъекта, Отказ, сткПараметры);
	
КонецПроцедуры

Процедура РаспределитьРасходы(ЗаполнитьРасходыПоРейсам = Истина, ЗаполнитьРасходыПоТС = Истина, ЗаполнитьРасходыФинансовыйРезультат = Истина, сткПараметры = Неопределено) Экспорт
	
	РеквизитыОбъекта = Новый Структура("Дата,
								|ПериодРаспределенияЗатратНачало,
								|ПериодРаспределенияЗатратОкончание,
								|Валюта,
								|ПравилоРаспределенияПрямыхРасходов, 
								|Организация, 										
								|Подразделение,
								|ДанныеРегистраРасходы,
								|ДанныеРегистраРасходыНаТС,
								|ДанныеРегистраДоходыРасходыПредприятия,
								|РасходыПоРейсам,
								|РасходыПоТС,
								|РасходыФинансовыйРезультат,
								|НаправлениеДеятельности");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("АналитическийРазрез", Неопределено);
	
	ВедетсяВалютныйУчет	   = ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет",                 ВедетсяВалютныйУчет);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоРейсам",            ЗаполнитьРасходыПоРейсам);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоТС",                ЗаполнитьРасходыПоТС);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыФинансовыйРезультат", ЗаполнитьРасходыФинансовыйРезультат);
	
	Отказ = Ложь;
	упРаспределениеРасходов.РаспределитьПрямыеРасходы(ДополнительныеСвойства, ЭтотОбъект.Ссылка, РеквизитыОбъекта, Отказ, сткПараметры);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	РеквизитыОбъекта = Новый Структура("Дата,
								|Организация,
								|Валюта,
								|Подразделение,
								|СтатьяРасходов");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("НаправлениеДеятельности", Справочники.упНаправленияДеятельности.ПустаяСсылка());
	РеквизитыОбъекта.Вставить("СпособВводаРасходов",     Перечисления.упСпособыВводаФактическихРасходов.РасходыПоНесколькимРейсам);
	РеквизитыОбъекта.Вставить("Дата",                    ПериодРаспределенияЗатратОкончание);
	РеквизитыОбъекта.Вставить("АналитическийРазрез",     Неопределено);
	

	// Формируются фактические расходы
	упРаспределениеРасходов.СформироватьРасходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 