#Область Проверки

// Процедура проверки дат.
//
Процедура ПроверитьДаты(ДатаПрибытия, ДатаУбытия, ТекстОшибки, Отказ) Экспорт
	
	Если ДатаУбытия < ДатаПрибытия Тогда
		Отказ = Истина;
		ТекстОшибки = Нстр("ru = 'Дата убытия %1 раньше даты прибытия %2'");		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДатаУбытия, ДатаПрибытия);
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура проверки наличия служебных расследований.
//
Процедура ЕстьСлужебныеРасследованияПоШтрафу(ДокументСсылка, Штраф, Отказ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упСлужебноеРасследование.Ссылка
	               |ИЗ
	               |	Документ.упСлужебноеРасследование КАК упСлужебноеРасследование
	               |ГДЕ
	               |	упСлужебноеРасследование.Проведен
	               |	И упСлужебноеРасследование.ДокументОснование = &ДокументОснование
	               |	И упСлужебноеРасследование.Ссылка <> &Ссылка";
			   
	Запрос.УстановитьПараметр("ДокументОснование", 		Штраф);
	Запрос.УстановитьПараметр("Ссылка",  				ДокументСсылка);

	текВыборка = Запрос.Выполнить().Выбрать();
	Если текВыборка.Следующий() Тогда
		ТекстСообщения = Нстр("ru = 'По %1 уже существует служебное расследование %2'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Штраф, текВыборка.Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,текВыборка.Ссылка,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
