#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВысотаГруза = Параметры.ВысотаГруза;
	ДлинаГруза = Параметры.ДлинаГруза;
	ШиринаГруза = Параметры.ШиринаГруза;
	Масса = Параметры.Масса;
	Объем = Параметры.Объем;
	КоличествоМест = Параметры.КоличествоМест;
	КоличествоЗагрузочныхМетров = Параметры.КоличествоЗагрузочныхМетров;
	ГрузовоеМесто = Параметры.ГрузовоеМесто;
	ЗаданиеНаПеревозкуГруза = Параметры.ЗаданиеНаПеревозкуГруза;
	ИдентификаторРаботы = Параметры.ИдентификаторРаботы;
	Операция = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Операция");
	
	ЭтаФорма.УчитыватьМассу = ПолучитьФункциональнуюОпцию("упУчитыватьМассу");
	ЭтаФорма.УчитыватьОбъем = ПолучитьФункциональнуюОпцию("упУчитыватьОбъем");
	ЭтаФорма.УчитыватьКоличествоМест = ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест");
	ЭтаФорма.УчитыватьКоличествоЗагрузочныхМетров = ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоЗагрузочныхМетров");
	ЭтаФорма.УчитыватьЛинейныеРазмеры = ПолучитьФункциональнуюОпцию("упУчитыватьЛинейныеРазмеры");
	Элементы.Декорация1.Видимость = ЭтаФорма.УчитыватьЛинейныеРазмеры;
	Элементы.Декорация2.Видимость = ЭтаФорма.УчитыватьЛинейныеРазмеры;
	
	УстановитьЗаголовкиПоказателейЗагрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Отказ = Ложь;
	//ПроверитьДанные(Отказ);
	Если НЕ Отказ Тогда
		Закрыть(ВГХ());	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
	
#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ВГХ()
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Высота", ВысотаГруза);
	сткРезультат.Вставить("Длина", ДлинаГруза);
	сткРезультат.Вставить("Ширина", ШиринаГруза);
	сткРезультат.Вставить("Масса", Масса);
	сткРезультат.Вставить("Объем", Объем);
	сткРезультат.Вставить("КоличествоМест", КоличествоМест);
	сткРезультат.Вставить("КоличествоЗагрузочныхМетров", КоличествоЗагрузочныхМетров);
	сткРезультат.Вставить("ГрузовоеМесто", ГрузовоеМесто);
	сткРезультат.Вставить("Задание", ЗаданиеНаПеревозкуГруза);
	сткРезультат.Вставить("Операция", Операция);
	сткРезультат.Вставить("ИдентификаторРаботы", ИдентификаторРаботы);
	
	Возврат сткРезультат;
	
КонецФункции	

&НаСервере
Процедура УстановитьЗаголовкиПоказателейЗагрузки()
	
	сткПредставления = упСервисныеФункции.ПолучитьПредставлениеПоказателейЗагрузки(УчитыватьМассу, УчитыватьОбъем, УчитыватьКоличествоМест, УчитыватьЛинейныеРазмеры);
	
	Если УчитыватьМассу Тогда
		ЕИ_Масса = сткПредставления.Масса;
	КонецЕсли;
	
	Если УчитыватьОбъем Тогда
		ЕИ_Объем = сткПредставления.Объем;
	КонецЕсли;
	
	Если УчитыватьКоличествоМест Тогда
		ЕИ_Грузов = сткПредставления.КоличествоМест;
	КонецЕсли;
	
	Если УчитыватьЛинейныеРазмеры Тогда
		ЕИ_Длины = сткПредставления.КоличествоЗагрузочныхМетров;
	КонецЕсли;
		
КонецПроцедуры // УстановитьЗаголовкиПоказателейЗагрузки()

#КонецОбласти
