
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Ложь
		Или Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования") 
		Или Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов") Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокИсключений = Новый СписокЗначений;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования") Тогда
			СписокИсключений.Добавить(Перечисления.упТипыРемонтов.МонтажОборудования);
		КонецЕсли;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов") Тогда
			СписокИсключений.Добавить(Перечисления.упТипыРемонтов.ЗаменаШин);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упТипыРемонтов.Ссылка
		|ИЗ
		|	Перечисление.упТипыРемонтов КАК упТипыРемонтов
		|ГДЕ
		|	НЕ упТипыРемонтов.Ссылка В (&СписокИсключений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	упТипыРемонтов.Порядок";
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти