#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПорядокИсполненияЗаявки = ПорядокИсполненияЗаявки(ПараметрКоманды);
	
	Если ПорядокИсполненияЗаявки = ПредопределенноеЗначение("Перечисление.упПорядокИсполненияЗаявок.Рейсом") Тогда

	Отказ 		= Ложь;
	ТекстОшибки = "";
	мсвЗаявки = СформироватьЗаявкуНаВозвратТарыНаСервере(ПараметрКоманды, ТекстОшибки, Отказ);
	
	Если НЕ Отказ Тогда
		Для каждого ЗаявкаТекущая Из мсвЗаявки Цикл
			ОткрытьФорму("Документ.упЗаявкаНаПеревозкуГруза.ФормаОбъекта", Новый Структура("Ключ", ЗаявкаТекущая), ПараметрыВыполненияКоманды.Источник);
		КонецЦикла;
	Иначе
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;
Иначе	
		
		ОписаниеОшибки = Нстр("ru = 'Запрещено формировать заявку на возврат тары по заявке с порядком исполнения ""путевым листом""'");
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ОписаниеОшибки, Истина);	
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьЗаявкуНаВозвратТарыНаСервере(ЗаявкаНаПеревозкуГруза, ТекстОшибки, Отказ)
	
	Возврат Документы.упЗаявкаНаПеревозкуГруза.СформироватьЗаявкуНаВозвратТары(ЗаявкаНаПеревозкуГруза, ,ТекстОшибки, Отказ);
		
КонецФункции

&НаСервере
Функция ПорядокИсполненияЗаявки(Ссылка)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПорядокИсполненияЗаявки");	
КонецФункции

#КонецОбласти 
