#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получим данные параметров поиска.
//
// Возвращаемое значение:
//   Соответствие - Данные для сопоставления в форме.
//
Функция ПолучитьВидыДокументов() Экспорт
	
	Соответствие = Новый Соответствие;
	// Задание на перевозку груза
	Структура = Новый Структура;
	Структура.Вставить("Имя","упЗаданиеНаПеревозкуГруза");
	Структура.Вставить("ИмяФормы","Документ.упЗаданиеНаПеревозкуГруза.Форма.ФормаДокумента");
	
	// Элемент данных сопостовления.
	Соответствие.Вставить("Задание на перевозку груза",Структура);
	// Рейс
	Структура = Новый Структура;
	Структура.Вставить("Имя","упРейс");
	Структура.Вставить("ИмяФормы","Документ.упРейс.Форма.ФормаДокумента");
	
	// Элемент данных сопостовления.
	Соответствие.Вставить("Рейс",Структура);
	
	Возврат Соответствие;
	
КонецФункции // ПолучитьВидыДокументов()

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	Для каждого ТекущийРеквизит из Метаданные.Справочники.упШаблоныПакетовПечатныхФорм.Реквизиты цикл
		Если НЕ (ТекущийРеквизит.Имя = "Комментарий") тогда
			БлокируемыеРеквизиты.Добавить(ТекущийРеквизит.Имя);	
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ТекущийРеквизит из Метаданные.Справочники.упШаблоныПакетовПечатныхФорм.ТабличныеЧасти цикл
		БлокируемыеРеквизиты.Добавить(ТекущийРеквизит.Имя);	
	КонецЦикла;
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 

#КонецЕсли