
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ПустаяСтрока(ВидДокумента) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите Вид документа.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка,"ВидДокумента","Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ошибки = Неопределено;
	Сч = 0;
	Для каждого СтрокаМакетПФ Из МакетыПФ Цикл
		Если СтрокаМакетПФ.КоличествоВернуть > 0  Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаМакетПФ.ТипРегламентногоДокумента) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,"Объект.МакетыПФ[%1].ТипРегламентногоДокумента", НСтр("ru = 'Не указан тип регламентного документа'"),,,,Сч);
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		Сч = Сч + 1;
	КонецЦикла; 

	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
			
КонецПроцедуры

#КонецОбласти 

#КонецЕсли