

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("РежимыРаботы") Тогда
		МассивРежимовРаботы = Параметры.Отбор.РежимыРаботы.ВыгрузитьЗначения();
		ОтборСписка = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборСписка, "Ссылка", МассивРежимовРаботы, ВидСравненияКомпоновкиДанных.НеВСписке);	
	КонецЕсли;
	
	//Справочники.упТранспортныеСредства.УстановитьОтборПриВыбореПоПараметрам(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, Параметры);
	
	
	//Справочники.упТранспортныеСредства.ДобавитьУсловноеОформлениеКолонкиСостояниеТС(Список);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти 