
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяРазличныеВидыПеревозок") Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокИсключений = Новый СписокЗначений;
		Если Не ПолучитьФункциональнуюОпцию("упИспользуютсяРазличныеВидыПеревозок") Тогда
			СписокИсключений.Добавить(Перечисления.упВидыПрочихРасходов.ПоВидуПеревозки);
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упВидыПрочихРасходов.Ссылка
		|ИЗ
		|	Перечисление.упВидыПрочихРасходов КАК упВидыПрочихРасходов
		|ГДЕ
		|	НЕ упВидыПрочихРасходов.Ссылка В (&СписокИсключений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	упВидыПрочихРасходов.Порядок";
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти