
#Область ПрограммныйИнтерфейс

// Процедура производит первоначальное заполнение предопределенных элементов справочника.
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	Попытка
		ПроблемаОбъект = Справочники.упПроблемы.ДосрочноеПрохождение.ПолучитьОбъект();
		ПроблемаОбъект.Действие = Перечисления.упДействияПоРаботе.НетДействий;
		ПроблемаОбъект.Записать();
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда 
			ОписаниеОшибки = ОписаниеОшибки();
		КонецЕсли;
		Событие = Нстр("ru = 'Не удалось записать проблему ""Досрочное прохождение""'");
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки); 
	КонецПопытки;
	
	Попытка
		ПроблемаОбъект = Справочники.упПроблемы.НетДействий.ПолучитьОбъект();
		ПроблемаОбъект.Действие = Перечисления.упДействияПоРаботе.НетДействий;
		ПроблемаОбъект.Записать();
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда 
			ОписаниеОшибки = ОписаниеОшибки();
		КонецЕсли;
		Событие = Нстр("ru = 'Не удалось записать проблему ""Нет действий (служебная)"".'");
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки); 
	КонецПопытки;
	
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	Для каждого текРек из Метаданные.Справочники.упПроблемы.Реквизиты цикл
		Если НЕ текРек.Имя = "Комментарий" тогда
			БлокируемыеРеквизиты.Добавить(текРек.Имя);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти 
