
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзКлассификатора(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыПодбораИзКдассификатора", ЭтаФорма);
	ОткрытьФорму("Справочник.упЕдиницыИзмерения.Форма.КлассификаторЕдиницИзмерения",,ЭтаФорма,,,,ОповещениеОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
// Процедура после закрытия формы подбора.
//
Процедура ОбработатьЗакрытиеФормыПодбораИзКдассификатора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти