
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьКартинкуКомментария();
	ОбновитьДоступность(Истина);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОграничитьДоступныеТипТСПриИзменении(Элемент)
	
ОбновитьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	УстановитьКартинкуКомментария();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьКартинкуКомментария()
	
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступность(Открытие = Ложь)
	
	Элементы.ГруппаДоступныеТипыТС.Доступность = Объект.ОграничитьДоступныеТипТС;
	Если Открытие Тогда		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКомментарий;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 