#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		сткПараметры = Новый Структура("Отбор, СтрокаПоиска",Новый Структура(),"");
		ТипыОпераций = Перечисления.упТипыОперацийВводаНачальныхОстатков.ПолучитьДанныеВыбора(сткПараметры);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка);
		ОткрытьФорму("Документ.упВводНачальныхОстатков.Форма.ФормаДокумента", ПараметрыФормы, , УникальныйИдентификатор);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипыОперацийЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипыОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТипОперации = ТипыОпераций.Получить(ВыбраннаяСтрока).Значение;
	
	ВыбратьТипОперации(ТипОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьТипОперации(ТипОперации)
	
	ПараметрыФормы = Новый Структура();
	ЗначенияЗаполнения = Новый Структура("ТипОперацииВводаНачальныхОстатков", ТипОперации);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.упВводНачальныхОстатков.Форма.ФормаДокумента", ПараметрыФормы, , УникальныйИдентификатор);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьТипОперации(Элементы.ТипыОпераций.ТекущиеДанные.Значение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции
	
#КонецОбласти
