#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не ПолучитьФункциональнуюОпцию("упИспользуетсяПолучениеПередачаДокументовВТочкахРейса") Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокИсключений = Новый СписокЗначений;
		СписокИсключений.Добавить(Перечисления.упУчастникиДокументооборотаПеревозки.Грузоотправитель);
		СписокИсключений.Добавить(Перечисления.упУчастникиДокументооборотаПеревозки.Грузополучатель);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	упУчастникиДокументооборотаПеревозки.Ссылка
		|ИЗ
		|	Перечисление.упУчастникиДокументооборотаПеревозки КАК упУчастникиДокументооборотаПеревозки
		|ГДЕ
		|	НЕ упУчастникиДокументооборотаПеревозки.Ссылка В (&СписокИсключений)
		|
		|УПОРЯДОЧИТЬ ПО
		|	упУчастникиДокументооборотаПеревозки.Порядок";
		Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			ДанныеВыбора.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли


