#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Формируется или открывается существующий документ "Регистрация задолженности по документам рейса" на основании рейса 
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  ТекстОшибки  - Строка - Текстовое представлениеошибки.
//  Отказ  - Булево - Флаг что произошел отказ создания движения.
//
// Возвращаемое значение:
//   ДокументСсылка   - Ссылка на документ.
//
Функция СформироватьРегистрацияЗадолженностиПоДокументамРейса(Рейс, ТекстОшибки, Отказ) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упРегистрацияЗадолженностиПоДокументамРейса.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.упРегистрацияЗадолженностиПоДокументамРейса КАК упРегистрацияЗадолженностиПоДокументамРейса
	|ГДЕ
	|	упРегистрацияЗадолженностиПоДокументамРейса.Рейс = &Рейс
	|	И НЕ упРегистрацияЗадолженностиПоДокументамРейса.ПометкаУдаления";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе	
		НовыйДокумент = Документы.упРегистрацияЗадолженностиПоДокументамРейса.СоздатьДокумент();
		НовыйДокумент.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Рейс = Рейс;
		НовыйДокумент.Заполнить(Рейс);
		Попытка
			НовыйДокумент.Записать();
			Результат = НовыйДокумент.Ссылка;
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Рейс,,,Отказ);
			ЗаписьЖурналаРегистрации("РегистрацияЗадолженностиПоДокументамРейса.Добавление", УровеньЖурналаРегистрации.Ошибка, ,Рейс, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции // СформироватьРегистрацияЗадолженностиПоДокументамРейса()


#КонецОбласти

#КонецЕсли