
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючВарианта"                   , "АнализИзмененияМаршрутаРаботКонтекст");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии"        , Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	ПараметрыФормы.Вставить("Рейс", ПараметрКоманды);
	
	ОткрытьФорму("Отчет.упАнализИзмененияМаршрутаРабот.Форма.ФормаОтчета", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		"Рейс=" + ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры


#КонецОбласти