#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Адрес) Тогда
		текГруппаАдреса = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, "Адреса", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(текГруппаАдреса,"АдресОтправления",Параметры.Адрес,ВидСравненияКомпоновкиДанных.Равно);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(текГруппаАдреса,"АдресПолучения",Параметры.Адрес,ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	ЗначениеПараметраОтбора = Неопределено;
	Если Параметры.Отбор.Свойство("РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава", ЗначениеПараметраОтбора) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"ВидПеревозки.РазрешенаПогрузкаРазгрузкаСТочностьюДоТоварногоСостава",ЗначениеПараметраОтбора,ВидСравненияКомпоновкиДанных.Равно);	
	КонецЕсли;
			
	ЗначениеПараметраОтбора = Неопределено;
	Если Параметры.Отбор.Свойство("ПараметрыВводаИнформацииОГрузовыхМестах", ЗначениеПараметраОтбора) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,"ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах",ЗначениеПараметраОтбора,ВидСравненияКомпоновкиДанных.ВСписке);	
	КонецЕсли;
		          	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти