
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("МодельТС") Тогда
		мсвМоделейТС = ПолучитьДоступныеМоделиТС(Параметры.Отбор.МодельТС);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Тип.МодельТС", мсвМоделейТС, ВидСравненияКомпоновкиДанных.ВСписке);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДоступныеМоделиТС(Модель)
	
	мсвМоделейТС = Новый Массив;
	мсвМоделейТС.Добавить(Справочники.упМоделиТС.ПустаяСсылка());
	мсвМоделейТС.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Модель,"Модель"));
	Возврат мсвМоделейТС;
	
КонецФункции

#КонецОбласти 