#Область ПрограммныйИнтерфейс

// Заполняет наборы свойств объекта. Обычно требуется, если наборов более одного.
//
// Параметры:
//  Объект       - ЛюбаяСсылка      - Ссылка на объект со свойствами.
//               - УправляемаяФорма - Форма объекта, к которому подключены свойства.
//               - ДанныеФормыСтруктура - Описание объекта, к которому подключены свойства.
//
//  ТипСсылки    - Тип - тип ссылки владельца свойств.
//
//  НаборыСвойств - ТаблицаЗначений - с колонками:
//                    Набор - СправочникСсылка.НаборыДополнительныхРеквизитовИСведений.
//                    ОбщийНабор - Булево - Истина, если набор свойств содержит свойства,
//                     общие для всех объектов.
//                    // Далее свойства элемента формы типа ГруппаФормы вида обычная группа
//                    // или страница, которая создается, если наборов больше одного без учета
//                    // пустого набора, который описывает свойства группы удаленных реквизитов.
//                    
//                    // Если значение Неопределено, значит использовать значение по умолчанию.
//                    
//                    // Для любой группы управляемой формы.
//                    Высота                   - Число.
//                    Заголовок                - Строка.
//                    Подсказка                - Строка.
//                    РастягиватьПоВертикали   - Булево.
//                    РастягиватьПоГоризонтали - Булево.
//                    ТолькоПросмотр           - Булево.
//                    ЦветТекстаЗаголовка      - Цвет.
//                    Ширина                   - Число.
//                    ШрифтЗаголовка           - Шрифт.
//                    
//                    // Для обычной группы и страницы.
//                    Группировка              - ГруппировкаПодчиненныхЭлементовФормы.
//                    
//                    // Для обычной группы.
//                    Отображение              - ОтображениеОбычнойГруппы.
//                    
//                    // Для страницы.
//                    Картинка                 - Картинка.
//                    ОтображатьЗаголовок      - Булево.
//
//  СтандартнаяОбработка - Булево - начальное значение Истина. Указывает получать ли
//                         основной набор, когда НаборыСвойств.Количество() равно нулю.
//
//  КлючНазначения   - Неопределено - (начальное значение) - указывает вычислить
//                      ключ назначения автоматически и добавить к значениям свойств
//                      формы КлючНазначенияИспользования и КлючСохраненияПоложенияОкна,
//                      чтобы изменения формы (настройки, положение и размер) сохранялись
//                      отдельно для разного состава наборов.
//                      Например, для каждого вида номенклатуры - свой состав наборов.
//
//                    - Строка - (не более 32 символа) - использовать указанный ключ
//                      назначения для добавления к значениям свойств формы.
//                      Пустая строка - не изменять свойства ключей формы, т.к. они
//                      устанавливается в форме и уже учитывают различия состава наборов.
//
//                    Добавка имеет формат "КлючНаборовСвойств<КлючНазначения>",
//                    чтобы <КлючНазначения> можно было обновлять без повторной добавки.
//                    При автоматическом вычислении <КлючНазначения> содержит хэш
//                    идентификаторов ссылок упорядоченных наборов свойств.
//
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	Если ТипСсылки = Тип("СправочникСсылка.упНоменклатура") Тогда
		ЗаполнитьНаборСвойствПоВидуНоменклатуры(
		Объект, ТипСсылки, НаборыСвойств);
	КонецЕсли;
	
	Если ТипСсылки = Тип("СправочникСсылка.упГрузовыеМеста") Тогда
		ЗаполнитьНаборСвойствПоТипуГрузовогоМеста(
            Объект, ТипСсылки, НаборыСвойств);
    КонецЕсли;
	
КонецПроцедуры

// Устарела. Будет удалена в следующей редакции БСП.
// 
// Теперь вместо указания имени реквизита, содержащего вид владельца свойств,
// например, ВидНоменклатуры типа СправочникСсылка.ВидыНоменклатуры,
// у которого должен быть реквизит НаборСвойств типа.
// СправочникСсылка.НаборыДополнительныхРеквизитовИСведений
// следует заполнить набор свойств для объекта СправочникСсылка.Номенклатура
// в процедуре ЗаполнитьНаборыСвойствОбъекта, как и в случае нескольких
// наборов свойств. Отличие лишь в том, что набор будет получен из реквизита
// объекта вида владельца самостоятельно, что позволяет использовать несколько
// разных реквизитов с удобными именами для разных типов объектов у которых
// один вид объектов. Например, Справочник.Проекты это вид владельца свойств
// у Справочник.Ошибки и Справочник.Задачи, для которых в справочнике Проекты
// будут реквизиты НаборСвойствОшибок, НаборСвойствЗадач.
//
Функция ПолучитьИмяРеквизитаВидаОбъекта(Ссылка) Экспорт
	
	Возврат "";
	
КонецФункции

Процедура ЗаполнитьНаборСвойствПоВидуНоменклатуры(Номенклатура, ТипСсылки, НаборыСвойств)
	Если ТипЗнч(Номенклатура) = ТипСсылки Тогда
		Номенклатура = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Номенклатура, "ЭтоГруппа, ВидНоменклатуры");
	КонецЕсли;
	// Добавляются свойства характерные виду номенклатуры.
	Если Истина
		И Номенклатура.ЭтоГруппа=Ложь
		И ЗначениеЗаполнено(Номенклатура.ВидНоменклатуры)
	Тогда
		НаборВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура.ВидНоменклатуры, "НаборСвойств");
		Если ЗначениеЗаполнено(НаборВидНоменклатуры) Тогда
			Строка = НаборыСвойств.Добавить();
			Строка.Набор = НаборВидНоменклатуры;
		КонецЕсли;
	КонецЕсли;
		// Добавим общий для номенклатуры
	Строка = НаборыСвойств.Добавить();
        Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_упНоменклатура_Общий;
КонецПроцедуры

Процедура ЗаполнитьНаборСвойствПоТипуГрузовогоМеста(ГрузовоеМесто, ТипСсылки, НаборыСвойств)
    Если ТипЗнч(ГрузовоеМесто) = ТипСсылки Тогда
        ГрузовоеМесто = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
            ГрузовоеМесто, "ЭтоГруппа, ТипГруза");
    КонецЕсли;
	//Если ГрузовоеМесто.ЭтоГруппа = Ложь Тогда
        Строка = НаборыСвойств.Добавить();
        Строка.Набор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
            ГрузовоеМесто.ТипГруза, "НаборСвойств");
    //КонецЕсли;
		// Добавим общий для грузовго места
	Строка = НаборыСвойств.Добавить();
        Строка.Набор = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_упГрузовыеМеста_Общий;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти