#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти
	
#Область ПрограммныйИнтерфейс

// Получить разрешенное значение. К текущему значению применяются ограничения кодом.
//
Функция ПолучитьРазрешенноеЗначение() Экспорт 
	
	Порог = Неопределено;
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Порог = 10000;
	КонецЕсли; 
	Если Порог <> Неопределено И Порог < Значение Тогда
		Значение = Порог;
	КонецЕсли;
	Возврат Значение;
	
КонецФункции


#КонецОбласти

#КонецЕсли


