#Область ПрограммныйИнтерфейс

#Область ФормированиеДвижений

// Формирование движения по регистру "упИнкассацияДенежныхСредств".
//
Процедура СформироватьДвиженияИнкассацияДенежныхСредств(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт

	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
		
	ДвиженияИнкассация	= Движения.упИнкассацияДенежныхСредств;
	ДвиженияИнкассация.Записывать = Истина;
	
	ДвижениеИнкассация = ДвиженияИнкассация.Добавить();
	ДвижениеИнкассация.Период               	= Реквизиты.Дата;
	ДвижениеИнкассация.Регистратор          	= Ссылка;
	ДвижениеИнкассация.ЗаявкаНаПеревозкуГруза 	= Реквизиты.ЗаявкаНаПеревозкуГруза;
	ДвижениеИнкассация.Валюта 					= Реквизиты.Валюта;
	ДвижениеИнкассация.СуммаПлан				= 0;
	ДвижениеИнкассация.СуммаФакт				= Реквизиты.Сумма;
		
КонецПроцедуры

#КонецОбласти

Функция ИспользуетсяСпособУчетаИнкассируемыхЦенностейСТочностьюДоГрузовыхМест(ВидПеревозки) Экспорт
	
	Результат = Ложь;
	
	ИспользуютсяУслугиИнкассации 				= Ложь; 
	СпособУчетаИнкассируемыхЦенностей			= Перечисления.упСпособыУчетаИнкассируемыхЦенностей.ПустаяСсылка();
		
	Если ЗначениеЗаполнено(ВидПеревозки) Тогда
		сткЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидПеревозки, "ИспользуютсяУслугиИнкассации, СпособУчетаИнкассируемыхЦенностей");
		ИспользуютсяУслугиИнкассации 				= сткЗначенияРеквизитов.ИспользуютсяУслугиИнкассации;
		СпособУчетаИнкассируемыхЦенностей			= сткЗначенияРеквизитов.СпособУчетаИнкассируемыхЦенностей
	КонецЕсли;
	
	Результат = ПолучитьФункциональнуюОпцию("упИспользуютсяУслугиИнкассации") 
					И ИспользуютсяУслугиИнкассации 
					И СпособУчетаИнкассируемыхЦенностей = Перечисления.упСпособыУчетаИнкассируемыхЦенностей.СТочностьюДоГрузовыхМест;


	Возврат Результат;
	
КонецФункции

#КонецОбласти
