#Область ОбработчикиСобытийФормы
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Справочники.упАналитическиеРазрезыПоПартнерам.СформироватьНаименование(Объект.Организация, Объект.Партнер, Объект.Контрагент, Объект.Соглашение);
КонецПроцедуры
 	
#КонецОбласти

