
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьПризнакОбработки(Команда)
	
	СнятьПризнакОбработкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СнятьПризнакОбработкиНаСервере()

	Для Каждого текСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 
		Запись = РегистрыСведений.упЗаписанныеДокументы.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, текСтрока);
		Запись.Прочитать();
		Запись.Обработан = Ложь;
		Запись.Записать();
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти 