
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СпискиМассивов = ПолучитьСпискиМассивов(ПараметрКоманды);
	
	упРаботаСоСтатусамиКлиент.УстановитьСтатусДокументам(СпискиМассивов.МассивНаСогласование, ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.Согласована"));
	упРаботаСоСтатусамиКлиент.УстановитьСтатусДокументам(СпискиМассивов.МассивКВыполнению, ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.КВыполнению"));
	
КонецПроцедуры
	
&НаСервере
Функция ПолучитьСпискиМассивов(МассивДокументов)
	
	МассивНаСогласование = Новый Массив;
	МассивКВыполнению     = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упЗаявкаНаПеревозкуГруза.Ссылка КАК СылкаНаДокумент
	               |ИЗ
	               |	Документ.упЗаявкаНаПеревозкуГруза КАК упЗаявкаНаПеревозкуГруза
	               |ГДЕ
	               |	упЗаявкаНаПеревозкуГруза.Ссылка В(&МассивДокументов)
	               |	И упЗаявкаНаПеревозкуГруза.ВидПеревозки.АвтоматическиПередаватьСогласованныеЗаявкиКИсполнению = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	упЗаявкаНаПеревозкуГруза.Ссылка КАК СылкаНаДокумент
	               |ИЗ
	               |	Документ.упЗаявкаНаПеревозкуГруза КАК упЗаявкаНаПеревозкуГруза
	               |ГДЕ
	               |	упЗаявкаНаПеревозкуГруза.Ссылка В(&МассивДокументов)
	               |	И упЗаявкаНаПеревозкуГруза.ВидПеревозки.АвтоматическиПередаватьСогласованныеЗаявкиКИсполнению = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	Результат = Запрос.ВыполнитьПакет();
	МассивКВыполнению = Результат[0].Выгрузить().ВыгрузитьКолонку("СылкаНаДокумент");
	МассивНаСогласование = Результат[1].Выгрузить().ВыгрузитьКолонку("СылкаНаДокумент");
	
	Структура = Новый Структура;
	Структура.Вставить("МассивНаСогласование", МассивНаСогласование);
	Структура.Вставить("МассивКВыполнению", МассивКВыполнению);
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 

