#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Склад", Параметры.Склад, Истина);
КонецПроцедуры	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	мсвРезультатПодбора = Новый Массив;
	Для каждого Строка Из ВыбраннаяСтрока Цикл
		сткСтрока = Новый Структура("ГрузовоеМесто, Тара, СкладскаяЯчейка, Количество");
		ЗаполнитьЗначенияСвойств(сткСтрока, Элементы.Список.ДанныеСтроки(Строка));
		мсвРезультатПодбора.Добавить(сткСтрока);
	КонецЦикла;
	ОповеститьОВыборе(мсвРезультатПодбора); 
    СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	мсвРезультатПодбора = Новый Массив;
	Для каждого Строка Из Элементы.Список.ВыделенныеСтроки Цикл
		сткСтрока = Новый Структура("ГрузовоеМесто, Тара, СкладскаяЯчейка, Количество");
		ЗаполнитьЗначенияСвойств(сткСтрока, Элементы.Список.ДанныеСтроки(Строка));
		мсвРезультатПодбора.Добавить(сткСтрока);
	КонецЦикла;
	ОповеститьОВыборе(мсвРезультатПодбора); 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции
	
#КонецОбласти
