
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Процедура производит первоначальное заполнение справочника/
//
// Параметры:
//  Параметры  - Структура - Параметры.
//
Процедура ПервоначальноеЗаполнение(Параметры = Неопределено) Экспорт
	
	текЭлемент = Справочники.упСтилиМаркеров.Основной.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПоУмолчанию;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 40;
	текЭлемент.Высота             = 40;
	текЭлемент.ПоложениеПривязкиX = 19;
	текЭлемент.ПоложениеПривязкиY = 39;
	текЭлемент.ОсновнойЦвет       = "#1C7ED4";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.ПрибытиеВТочкуМаршрута.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПрибытиеВТочкуМаршрута;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#FAB4A3";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.НачалоРаботВТочкеМаршрута.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерНачалоРаботВТочкеМаршрута;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#FFDAB4";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.УбытиеСТочкиМаршрута.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерУбытиеСТочкиМаршрута;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#B4DFB2";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.СообщениеДиспетчеру.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерСообщениеДиспетчеру;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#FF4848";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.СообщениеОтДиспетчера.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерСообщениеОтДиспетчера;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#70D556";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.ВходящийЗвонок.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерВходящийЗвонок;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#70D556";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.ИсходящийЗвонок.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерИсходящийЗвонок;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#FF4848";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.ТочкаПропущена.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерТочкаПропущена;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#FFFF00";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.ТранспортноеСредство.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.ТранспортноеСредство;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#61411E";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.СобытиеМониторинга.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.СобытиеМониторинга;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#282B61";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.ИзменениеСледующейТочкиПоМаршруту.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерИзменениеСледующейТочкиПоМаршруту;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#059C0A";
	текЭлемент.Записать();	
	
	текЭлемент = Справочники.упСтилиМаркеров.ОтсутствиеЛицензииНаПодключение.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерОтсутствиеЛицензииНаПодключение;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 16;
	текЭлемент.Высота             = 16;
	текЭлемент.ПоложениеПривязкиX = 8;
	текЭлемент.ПоложениеПривязкиY = 8;
	текЭлемент.ОсновнойЦвет       = "#FF4025";
	текЭлемент.Записать();	
	
	// участники цепи поставок
	текЭлемент = Справочники.упСтилиМаркеров.Поставщик.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.Поставщик;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 24;
	текЭлемент.Высота             = 24;
	текЭлемент.ПоложениеПривязкиX = 12;
	текЭлемент.ПоложениеПривязкиY = 12;
	текЭлемент.ОсновнойЦвет       = "#61411e";
	текЭлемент.Записать();
	
	текЭлемент = Справочники.упСтилиМаркеров.КроссДокинг.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.КроссДокинг;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 24;
	текЭлемент.Высота             = 24;
	текЭлемент.ПоложениеПривязкиX = 12;
	текЭлемент.ПоложениеПривязкиY = 12;
	текЭлемент.ОсновнойЦвет       = "#61411e";
	текЭлемент.Записать();

	текЭлемент = Справочники.упСтилиМаркеров.Склад.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.Склад;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 24;
	текЭлемент.Высота             = 24;
	текЭлемент.ПоложениеПривязкиX = 12;
	текЭлемент.ПоложениеПривязкиY = 12;
	текЭлемент.ОсновнойЦвет       = "#61411e";
	текЭлемент.Записать();

	текЭлемент = Справочники.упСтилиМаркеров.Магазин.ПолучитьОбъект();
	текЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.Магазин;
	текЭлемент.Масштаб            = 100;
	текЭлемент.Ширина             = 24;
	текЭлемент.Высота             = 24;
	текЭлемент.ПоложениеПривязкиX = 12;
	текЭлемент.ПоложениеПривязкиY = 12;
	текЭлемент.ОсновнойЦвет       = "#61411e";
	текЭлемент.Записать();

КонецПроцедуры // ПервоначальноеЗаполнение()

// Формирует типовой набор маркеров по умолчанию.
//
Процедура СформироватьПростыеМаркеры() Экспорт
	
	// маркер простой синий	.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСиний).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой синий'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойСиний;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#0000FF";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой синий (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;		
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#0000FF";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой синий (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойСинийВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#0000FF";
		НовыйЭлемент.Записать();
	КонецЕсли;

	// маркер простой белый	.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелый).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой белый'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойБелый;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;	
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFFFFF";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой белый (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFFFFF";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой белый (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойБелыйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFFFFF";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	// маркер простой голубой	.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубой).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой голубой'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойГолубой;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#00FFFF";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой голубой (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#00FFFF";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой голубой (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойГолубойВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#00FFFF";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	// маркер простой желтый.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтый).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой желтый'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЖелтый;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFFF00";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой желтый (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFFF00";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой желтый (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЖелтыйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFFF00";
		НовыйЭлемент.Записать();
	КонецЕсли;           
	
	// маркер простой зеленый.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленый).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой зеленый'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЗеленый;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#00FF00";
		НовыйЭлемент.Записать();
	КонецЕсли;   
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой зеленый (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#00FF00";
		НовыйЭлемент.Записать();
	КонецЕсли;   
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой зеленый (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЗеленыйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#00FF00";
		НовыйЭлемент.Записать();
	КонецЕсли;   
	
	// маркер простой красный.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой красный'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойКрасный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FF0000";
		НовыйЭлемент.Записать();
	КонецЕсли;  
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой красный (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FF0000";
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой красный (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойКрасныйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FF0000";
		НовыйЭлемент.Записать();
	КонецЕсли;  
	
	// маркер простой оранжевый.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевый).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой оранжевый'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойОранжевый;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFA500";
		НовыйЭлемент.Записать();
	КонецЕсли;  
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой оранжевый (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFA500";
		НовыйЭлемент.Записать();
	КонецЕсли;  
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой оранжевый (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойОранжевыйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFA500";
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
	// маркер простой розовый.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовый).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой розовый'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойРозовый;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFC0CB";
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой розовый (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFC0CB";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой розовый (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойРозовыйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#FFC0CB";
		НовыйЭлемент.Записать();
	КонецЕсли;  
	
	// маркер простой серый.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерый).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой серый'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойСерый;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#BEBEBE";
		НовыйЭлемент.Записать();
	КонецЕсли;   
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой серый (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#BEBEBE";
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой серый (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойСерыйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#BEBEBE";
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
	// маркер простой фиолетовый.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовый).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой фиолетовый'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовый;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#EE82EE";
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой фиолетовый (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#EE82EE";
		НовыйЭлемент.Записать();
	КонецЕсли;  
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой фиолетовый (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойФиолетовыйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#EE82EE";
		НовыйЭлемент.Записать();
	КонецЕсли;   
	
	// маркер простой черный.
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой черный'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЧерный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#000000";
		НовыйЭлемент.Записать();
	КонецЕсли;
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыделенный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой черный (выделенный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыделенный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#000000";
		НовыйЭлемент.Записать();
	КонецЕсли; 
	
	Если Справочники.упСтилиМаркеров.НайтиПоРеквизиту("Картинка", Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыбранный).Пустая() Тогда
		НовыйЭлемент = Справочники.упСтилиМаркеров.СоздатьЭлемент();
		НовыйЭлемент.Наименование       = НСтр("ru = 'Маркер простой черный (выбранный)'");
		НовыйЭлемент.Картинка           = Перечисления.упКартинкиМаркеров.МаркерПростойЧерныйВыбранный;
		НовыйЭлемент.Масштаб            = 100;
		НовыйЭлемент.Ширина             = 10;
		НовыйЭлемент.Высота             = 10;
		НовыйЭлемент.ПоложениеПривязкиX = 5;
		НовыйЭлемент.ПоложениеПривязкиY = 5;
		НовыйЭлемент.ОсновнойЦвет       = "#000000";
		НовыйЭлемент.Записать();
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
	// Нет.
	
#КонецОбласти
	
#КонецЕсли
