
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ВыводитьНомерИсходногоДокумента") Тогда 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.упСпособыФормированияНомераРаботы.ЗаданиеНомер);
		ДанныеВыбора.Добавить(Перечисления.упСпособыФормированияНомераРаботы.ЗаданиеНомерКИС);
		ДанныеВыбора.Добавить(Перечисления.упСпособыФормированияНомераРаботы.ЗаявкаНомер);
		ДанныеВыбора.Добавить(Перечисления.упСпособыФормированияНомераРаботы.ЗаявкаНомерКИС);
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти