#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	ЦветГраницы = упСервисныеФункцииКлиентСервер.HexСтрВЦвет(Объект.ЦветГраницы);
	ЦветЗаливки = упСервисныеФункцииКлиентСервер.HexСтрВЦвет(Объект.ЦветЗаливки);		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЦветГраницы = упСервисныеФункцииКлиентСервер.ЦветВHexСтр(ЦветГраницы); 
	ТекущийОбъект.ЦветЗаливки = упСервисныеФункцииКлиентСервер.ЦветВHexСтр(ЦветЗаливки); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЦветГраницыПриИзменении(Элемент)
	
	Если ЦветГраницы.Вид <> ВидЦвета.Абсолютный Тогда 
		ЦветГраницы = ЦветГраницыПриИзмененииНаСервере(ЦветГраницы);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветЗаливкиПриИзменении(Элемент)
	
	Если ЦветЗаливки.Вид <> ВидЦвета.Абсолютный Тогда 
		ЦветЗаливки = ЦветЗаливкиПриИзмененииНаСервере(ЦветЗаливки);
	КонецЕсли;	
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы
	// Нет.
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ЦветЗаливкиПриИзмененииНаСервере(ЦветЗаливки)
	
	Возврат упСервисныеФункцииКлиентСервер.ПреобразоватьЦветВАбсолютный(ЦветЗаливки);
	
КонецФункции

&НаСервереБезКонтекста
Функция ЦветГраницыПриИзмененииНаСервере(ЦветГраницы)
	
	Возврат упСервисныеФункцииКлиентСервер.ПреобразоватьЦветВАбсолютный(ЦветГраницы);
	
КонецФункции

#КонецОбласти