
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыМониторинга = Параметры.ПараметрыМониторинга;
	Если ПараметрыМониторинга.СписокЗон.Количество() Тогда
		СписокЗон.ЗагрузитьЗначения(ПараметрыМониторинга.СписокЗон);
	КонецЕсли; 
	
	Если ПараметрыМониторинга.МестаИнтереса.Количество() Тогда
		МестаИнтереса.ЗагрузитьЗначения(ПараметрыМониторинга.МестаИнтереса);
	КонецЕсли;
	ЭтаФорма.ДопустимыйОбъемДанныхТрекера = ПараметрыМониторинга.ДопустимыйОбъемДанныхТрекера;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьНастроекПланирования();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("СписокЗон", СписокЗон.ВыгрузитьЗначения());
	
	МассивМестИнтереса = Новый Массив;
	// проверим каждое место интереса
	Для каждого текЭлемент Из МестаИнтереса Цикл
		ТекущееМесто = текЭлемент.Значение;
		Если ЗначениеЗаполнено(ТекущееМесто) И МассивМестИнтереса.Найти(ТекущееМесто) = Неопределено Тогда
			МассивМестИнтереса.Добавить(ТекущееМесто);
		КонецЕсли;
	КонецЦикла;
	
	сткПараметры.Вставить("МестаИнтереса", МассивМестИнтереса);
	сткПараметры.Вставить("ДопустимыйОбъемДанныхТрекера", ДопустимыйОбъемДанныхТрекера);
	
	Закрыть(сткПараметры);
	
КонецПроцедуры // ЗавершитьРедактирование()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры // Отмена()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьНастроекПланирования()
		
КонецПроцедуры // УстановитьДоступностьНастроекПланирования()

#КонецОбласти 
