
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НетПраваРедактировать = НЕ ПолучитьПравоКорректироватьАдрес();
	
	Индекс = 0;
	
	Для каждого ТекущийАдрес Из ПараметрКоманды Цикл		
		Если НетПраваРедактировать И ТекущийАдрес.Подтвержден Тогда
			ПараметрКоманды.Удалить(Индекс);
			ТекстОшибки = СтрШаблон("Адрес %1 утвержден, вносить изменения запрещено",ТекущийАдрес);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ТекущийАдрес);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;	
	
	#Если НЕ ВебКлиент Тогда
		КоличествоУспешноОбработанных = упГеокодированиеКлиентСервер.НайтиКоординатыАдресов(ПараметрКоманды);
	#Иначе	
		КоличествоУспешноОбработанных = упГеокодированиеСервер.НайтиКоординатыАдресов(ПараметрКоманды);
	#КонецЕсли	

	Если Не КоличествоУспешноОбработанных Тогда 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Геокодирование'"),, НСтр("ru = 'Не удалось определить координаты выделенных адресов'"), БиблиотекаКартинок.Ошибка32);
	Иначе 	
		ПоказатьОповещениеПользователя(НСтр("ru = 'Геокодирование'"),, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Удалось определить координаты %1 из %2 выделенных адресов'"), КоличествоУспешноОбработанных, ПараметрКоманды.Количество()), БиблиотекаКартинок.Информация32);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Выполним обращение для получения прав редактировать.
//
//
// Возвращаемое значение:
//   Булево - Разрешение на редактирование.
//
Функция ПолучитьПравоКорректироватьАдрес()

	Возврат Справочники.упАдреса.ВыполнитьПроверкуПраваПодтверждениеКорректностиГеографическихДанных();

КонецФункции // ПолучитьПравоКорректироватьАдрес() 

#КонецОбласти 