#Область ПрограммныйИнтерфейс

// Функция - Собрать данные тарифной сетки
//
// Параметры:
//  Ссылка - Ссылка	 - Ссылка
// 
// Возвращаемое значение:
//  ДанныеТарифнойСетки - данные.
//
Функция СобратьДанныеТарифнойСетки(Ссылка) Экспорт 

	ДанныеТарифнойСетки = Ссылка.ДанныеТарифнойСетки.Получить();
	Если ДанныеТарифнойСетки <> Неопределено Тогда
		Если ЗначениеЗаполнено(Ссылка.ПоказательТарифнойСеткиПоСтолбцам) Тогда
			СоотвествиеСсылок = Новый Соответствие;
			Для Каждого СтрокаИдентификатора Из Ссылка.ИдентификаторыСсылок Цикл
				СоотвествиеСсылок.Вставить(СтрокаИдентификатора.Идентификатор, СтрокаИдентификатора.Значение);
			КонецЦикла;
			СтрокаЗаголовков = ДанныеТарифнойСетки[0];
			Для Индекс = 0 По ДанныеТарифнойСетки.Колонки.Количество() - 1 Цикл
				НовоеЗначение = СоотвествиеСсылок[СтрокаЗаголовков[Индекс]];
				Если НовоеЗначение <> Неопределено Тогда
					СтрокаЗаголовков[Индекс] = НовоеЗначение;
				КонецЕсли; 
			КонецЦикла;
			КолонкаЗаголовков = ДанныеТарифнойСетки.Колонки[0];
			Для Индекс = 0 По ДанныеТарифнойСетки.Количество() - 1 Цикл
				НовоеЗначение = СоотвествиеСсылок[ДанныеТарифнойСетки[Индекс][0]];
				Если НовоеЗначение <> Неопределено Тогда
					ДанныеТарифнойСетки[Индекс][0] = НовоеЗначение;
				КонецЕсли; 
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли;
	Возврат ДанныеТарифнойСетки;
	
КонецФункции
	
#КонецОбласти 