
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьТаблицу(тбзТарифнаяСетка) Экспорт 
	Если Ложь Тогда // Для контекстной подсказки
	    тбзТарифнаяСетка = Новый ТаблицаЗначений;
	КонецЕсли;
	ЭтотОбъект.ИдентификаторыСсылок.Очистить();
	Для Каждого Колонка Из тбзТарифнаяСетка.Колонки Цикл
		ЗначениеПоказателя = ПреобразоватьЗначениеПоказателя(тбзТарифнаяСетка[0][Колонка.Имя]);
		тбзТарифнаяСетка[0][Колонка.Имя] = ЗначениеПоказателя;
	КонецЦикла;
	Для Каждого СтрокаТаблицы Из тбзТарифнаяСетка Цикл
		ЗначениеПоказателя = ПреобразоватьЗначениеПоказателя(СтрокаТаблицы[0]);
		СтрокаТаблицы[0] = ЗначениеПоказателя;
	КонецЦикла;
	ДанныеТарифнойСетки = Новый ХранилищеЗначения(тбзТарифнаяСетка);
	ЭтотОбъект.ДанныеТарифнойСетки = ДанныеТарифнойСетки;
КонецПроцедуры

Функция ПреобразоватьЗначениеПоказателя(ЗначениеПоказателя)
	
	Если упСервисныеФункции.ЛиТипСсылкиНаОбъектБД(ТипЗнч(ЗначениеПоказателя)) Тогда
		СтрокиТЧ = ЭтотОбъект.ИдентификаторыСсылок.НайтиСтроки(Новый Структура("Значение", ЗначениеПоказателя));
		Если СтрокиТЧ.Количество() > 0 Тогда
			СтрокаТЧ = СтрокиТЧ[0];
		Иначе
			СтрокаТЧ = ЭтотОбъект.ИдентификаторыСсылок.Добавить();
			СтрокаТЧ.Значение = ЗначениеПоказателя;
			СтрокаТЧ.Идентификатор = Новый УникальныйИдентификатор;
		КонецЕсли; 
		ЗначениеПоказателя = СтрокаТЧ.Идентификатор;
	КонецЕсли;
	Возврат ЗначениеПоказателя;

КонецФункции

#КонецОбласти

#КонецЕсли
