
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ОпределеноЗон = УстановитьЗону(ПараметрКоманды);
	Если ОпределеноЗон > 0 Тогда 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Зона установлена'"),, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Успешно определена зона в %1 из %2 адресах'"), ОпределеноЗон, ПараметрКоманды.Количество()), БиблиотекаКартинок.Информация32);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Зона не установлена'"),, НСтр("ru = 'Не удалось определить зону ни для одного из указанных адресов'"), БиблиотекаКартинок.Ошибка32);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Выполним обращение для получения прав редактировать.
//
//
// Возвращаемое значение:
//   Булево - Разрешение на редактирование.
//
Функция ПолучитьПравоКорректироватьАдрес()

	Возврат Справочники.упАдреса.ВыполнитьПроверкуПраваПодтверждениеКорректностиГеографическихДанных();

КонецФункции // ПолучитьПравоКорректироватьАдрес()

&НаСервере
Функция УстановитьЗону(мсвТочек)
	
	НетПраваРедактировать = НЕ ПолучитьПравоКорректироватьАдрес();
	
	Индекс = 0;
	
	Для каждого ТекущийАдрес Из мсвТочек Цикл		
		Если НетПраваРедактировать И ТекущийАдрес.Подтвержден Тогда
			мсвТочек.Удалить(Индекс);
			ТекстОшибки = СтрШаблон("Адрес %1 утвержден, вносить изменения запрещено",ТекущийАдрес);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ТекущийАдрес);
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Возврат Справочники.упГеографическиеЗоны.УстановитьГеографическуюЗонуАдресам(мсвТочек);
	
КонецФункции

#КонецОбласти 