#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если Не ЭтотОбъект.Значение Тогда
			ИспользуетсяУправлениеТранспортом = упСервисныеФункции.ПолучитьЗначениеКонстанты("упИспользуетсяГлобальнаяПодсистемаУправлениеТранспортом");
			Если Не ИспользуетсяУправлениеТранспортом Тогда
				Константы.упУказываютсяФактическиеРасходыПоРейсу.Установить(Ложь);
				Константы.упВестиУчетРасчетовСЗаказчиками.Установить(Ложь);
				Константы.упВедетсяУчетВходящихПретензий.Установить(Ложь);
				Константы.упВедетсяУчетИсходящихПретензий.Установить(Ложь);
				Константы.упИспользуетсяЗагрузкаДанныхИзСистемыПлатон.Установить(Ложь);
				Константы.упВедетсяВалютныйУчет.Установить(Ложь);
				Константы.упИспользоватьВиртуальныеТранспортныеСредства.Установить(Ложь);
				Константы.упИспользуютсяДополнительныеСотрудникиВРейсе.Установить(Ложь);
				Константы.упКонтролироватьДоступностьГеографическихЗон.Установить(Ложь);
				Константы.упИспользуетсяУчетДорожныхПроисшествий.Установить(Ложь);
				Константы.упИспользуетсяУчетШтрафов.Установить(Ложь);
				Константы.упИспользуетсяЗагрузкаДанныхИзФайловТахографа.Установить(Ложь);
				Константы.упИспользуетсяЗагрузкаДанныхОтТопливныхКомпаний.Установить(Ложь);
				Константы.упИспользуетсяУчетПодразделений.Установить(Ложь);
				Константы.упИспользуетсяУчетДополнительногоОборудования.Установить(Ложь);
				Константы.упВестиОтдельныйУчетПоказанийОдометровТранспортныхСредств.Установить(Ложь);
				Константы.упИспользуетсяУчетРасходовНаТС.Установить(Ложь);
				Константы.упИспользуютсяИндивидуальныеГрафикиРаботыСотрудников.Установить(Ложь);
			КонецЕсли;
			Константы.упРазрешитьВыпискуОдногоПутевогоЛистаНаНесколькоРейсов.Установить(Ложь);
			Константы.упУчитыватьКоличествоЗагрузочныхМетров.Установить(Ложь);
			Константы.упУчитыватьКоличествоМест.Установить(Ложь);
			Константы.упУказываютсяФактическиОказанныеУслуги.Установить(Ложь);
			Константы.упИспользуютсяУсловияПеревозок.Установить(Ложь);
			Константы.упИспользуютсяДополнительныеОперации.Установить(Ложь);
			Константы.упИспользуютсяМультимодальныеПеревозки.Установить(Ложь);
			Константы.упИспользоватьДопАналитическийРазрезПриРаспределенииРасходов.Установить(Ложь);
			Константы.упУчитыватьКлассыОпасностиГрузов.Установить(Ложь);
			Константы.упИспользуетсяКоличественныйУчетГрузов.Установить(Ложь);
			Константы.упКонтролироватьТемпературныеРежимы.Установить(Ложь);
			Константы.упКонтролироватьСовместимостьТовара.Установить(Ложь);
			Константы.упКонтролироватьТипыКузововДляПогрузкиРазгрузки.Установить(Ложь);
			Константы.упКонтролироватьДоступностьРесурсовПартнеру.Установить(Ложь);
			Константы.упИспользуетсяПолучениеПередачаДокументовВТочкахРейса.Установить(Ложь);
			Константы.упИспользуетсяВозвратДокументовПослеИсполненияРейса.Установить(Ложь);
			Константы.упИспользуютсяИтерацииОформленияЗаявокНаТС.Установить(Ложь);
			Константы.упИспользуетсяСтрахованиеГруза.Установить(Ложь);
			Константы.упИспользуютсяУслугиИнкассации.Установить(Ложь);
			Константы.упИспользуетсяУчетМестоположенийТранспортныхСредств.Установить(Ложь);
			Константы.упВедетсяУчетТары.Установить(Ложь);
			Константы.упИспользуетсяСкладскойУчетНаХабах.Установить(Ложь);
			Константы.упИспользуетсяИнтеграцияСPacker3D.Установить(Ложь);
			Константы.упВедетсяРаботаВРазныхЧасовыхПоясах.Установить(Ложь);
			Константы.упИспользуетсяУчетПоНаправлениямДеятельности.Установить(Ложь);
			Константы.упВедетсяРозничнаяПродажаВРейсе.Установить(Ложь);
			Константы.упИспользуютсяЗаявкиНаСпецтехнику.Установить(Ложь);
			Константы.упИспользуютсяЗаявкиНаПассажирскиеПеревозки.Установить(Ложь);
			Константы.упВедетсяРаботаЧерезТорговыхПредставителей.Установить(Ложь);
			Константы.упИспользуютсяКонтейнерныеПеревозки.Установить(Ложь);
		КонецЕсли;
	КонецЕсли; 
	Константы.упНеИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками.Установить(Не ЭтотОбъект.Значение);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
