
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упМобильныеУстройстваИТрекеры.Ссылка
		|ИЗ
		|	Справочник.упМобильныеУстройстваИТрекеры КАК упМобильныеУстройстваИТрекеры
		|ГДЕ
		|	упМобильныеУстройстваИТрекеры.ИдентификаторУстройства = &ИдентификаторУстройства
		|	И упМобильныеУстройстваИТрекеры.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ИдентификаторУстройства", ИдентификаторУстройства);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Запись невозможна: идентификатор устройства не уникален.";
		Сообщение.Поле = "ИдентификаторУстройства";  
		Сообщение.УстановитьДанные(ЭтотОбъект); 
		Сообщение.Сообщить();  
		Отказ = Истина;
	КонецЕсли; 
	
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли