
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Значение") Тогда // Возврат при неизвестном источнике.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.ПрограммноеОткрытие Тогда
		ВызватьИсключение
			НСтр("ru = 'Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
	
	ПропуститьПерезапуск = Параметры.ПропуститьПерезапуск;
	
	Соответствие = Обработки.упЛегальностьИспользованияСервиса.ПолучитьСоответствиеСервисаЛегальности();
	Структура = Соответствие.Получить(Параметры.Значение);
	
	Если Структура = Неопределено Тогда
		ВызватьИсключение
		НСтр("ru = 'Выбрканный сервис не найден, обратитесь к администратору.'");
	КонецЕсли;
	
	МакетДокумента = Обработки.упЛегальностьИспользованияСервиса.ПолучитьМакет(Структура.Макет);
	ТекущийСервис = Структура.Имя;
	
	ТекстПредупреждения = МакетДокумента.ПолучитьТекст();
	ПодтверждениеВыбора = 0; // Пользователю требуется явно выбрать один из вариантов.
	Элементы.Примечание.Видимость = Параметры.ПоказыватьПредупреждениеОПерезапуске;
	
	Заголовок = "Легальность использования сервиса " + ТекущийСервис;		
	Для каждого ТекущийВариант Из Элементы.ПодтверждениеВыбора.СписокВыбора Цикл
		ТекущийВариант.Представление = СтрШаблон(ТекущийВариант.Представление,ТекущийСервис);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОсновныеДействияФормыПродолжить(Команда)
	
	Результат = ПодтверждениеВыбора = 1;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("упЛегальностьИспользованияСервисаЯндекс", Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
