
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

//// Заполняет список команд создания на основании.
//// 
//// Параметры:
////   КомандыСоздатьНаОсновании - ТаблицаЗначений - состав полей см. в функции ВводНаОсновании.СоздатьКоллекциюКомандСоздатьНаОсновании
////
//Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт
//	
//	ВводНаОснованииПереопределяемый.ДобавитьКомандуСоздатьНаОснованииБизнесПроцессЗадание(КомандыСоздатьНаОсновании);
//	
//КонецПроцедуры

//Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт
//	
//	Если ПравоДоступа("Добавление", Метаданные.Документы.упКорректировкаРегистров) Тогда
//		КомандаСоздатьНаОсновании = КомандыСоздатьНаОсновании.Добавить();
//		КомандаСоздатьНаОсновании.Идентификатор = Метаданные.Документы.упКорректировкаРегистров.ПолноеИмя();
//		КомандаСоздатьНаОсновании.Представление = ВводНаОсновании.ПредставлениеОбъекта(Метаданные.Документы.упКорректировкаРегистров);
//		КомандаСоздатьНаОсновании.ПроверкаПроведенияПередСозданиемНаОсновании = Истина;
//		
//		Возврат КомандаСоздатьНаОсновании;
//	КонецЕсли;
//	
//	Возврат Неопределено;
//КонецФункции

//// Заполняет список команд отчетов.
//// 
//// Параметры:
////   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов
////
//Процедура ДобавитьКомандыОтчетов(КомандыОтчетов) Экспорт

//	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);

//КонецПроцедуры

//// Заполняет список команд печати.
//// 
//// Параметры:
////   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
////
//Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Функция ДополнительныеИсточникиДанныхДляДвижений(ИмяРегистра) Экспорт

	ИсточникиДанных = Новый Соответствие;

	Возврат ИсточникиДанных; 

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли