
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза = ТекущийОбъект.СхемаЗаявкаНаПеревозкуГруза.Получить();
	Если СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза <> Неопределено Тогда
		АдресСхемыЗаявкаНаПеревозкуГруза = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза, УникальныйИдентификатор);
	КонецЕсли;
	
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
		
	Если Не ЗначениеЗаполнено(АдресСхемыЗаявкаНаПеревозкуГруза) Тогда 
		СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза = Справочники.упВидыПеревозок.ПолучитьМакет("ЗаявкаНаПеревозкуГруза");
		АдресСхемыЗаявкаНаПеревозкуГруза = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза, УникальныйИдентификатор);
	Иначе	
		СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза = ПолучитьИзВременногоХранилища(АдресСхемыЗаявкаНаПеревозкуГруза);
	КонецЕсли;	
	Попытка
		КомпоновщикНастроекЗаявкаНаПеревозкуГруза.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыЗаявкаНаПеревозкуГруза));
		КомпоновщикНастроекЗаявкаНаПеревозкуГруза.ЗагрузитьНастройки(СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза.НастройкиПоУмолчанию);
		КомпоновщикНастроекЗаявкаНаПеревозкуГруза.Восстановить();
	Исключение
		СхемаКомпоновкиДанныхАктуальная = Справочники.упВидыПеревозок.ПолучитьМакет("ЗаявкаНаПеревозкуГруза");
		Если СхемаКомпоновкиДанныхАктуальная = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		упСервисныеФункцииВызовСервера.СкопироватьЭлементы(СхемаКомпоновкиДанныхАктуальная.НастройкиПоУмолчанию.Отбор,   СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза.НастройкиПоУмолчанию.Отбор);
		АдресСхемыЗаявкаНаПеревозкуГруза = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанныхАктуальная, УникальныйИдентификатор);
		
		КомпоновщикНастроекЗаявкаНаПеревозкуГруза.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыЗаявкаНаПеревозкуГруза));
		КомпоновщикНастроекЗаявкаНаПеревозкуГруза.ЗагрузитьНастройки(СхемаКомпоновкиДанныхАктуальная.НастройкиПоУмолчанию);
		КомпоновщикНастроекЗаявкаНаПеревозкуГруза.Восстановить();
		
		Модифицированность = Истина;
	КонецПопытки;
		
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
			
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаПрочее, Объект.Комментарий);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	упСервисныеФункции.УстановитьЗаголовкиПолейДляПоиска(ЭтаФорма);
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЗначениеЗаполнено(АдресСхемыЗаявкаНаПеревозкуГруза) Тогда 
		СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза = ПолучитьИзВременногоХранилища(АдресСхемыЗаявкаНаПеревозкуГруза);
		упСервисныеФункцииВызовСервера.ОчиститьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза.НастройкиПоУмолчанию);
		упСервисныеФункцииВызовСервера.СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза.НастройкиПоУмолчанию, КомпоновщикНастроекЗаявкаНаПеревозкуГруза.ПолучитьНастройки());
		ТекущийОбъект.СхемаЗаявкаНаПеревозкуГруза = Новый ХранилищеЗначения(СхемаКомпоновкиДанныхЗаявкаНаПеревозкуГруза);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаПрочее, Объект.Комментарий);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти
