#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - Сформировать наименование
//
// Параметры:
//  Организация - СправочникСсылка.Организации 	 - организация.
//  Партнер	 - СправочникСсылка.упПартнеры 	 - партнер.
//  Контрагент	 - СправочникСсылка.упКонтрагенты 	 - контрагент.
//  Соглашение	 - СправочникСсылка.упСоглашенияСКлиентами 	 - соглашение.
// 
// Возвращаемое значение:
//  Строка - наименование.
//
Функция СформироватьНаименование(Организация, Партнер, Контрагент, Соглашение) Экспорт
	мсвНаименование = Новый Массив;
	Если ЗначениеЗаполнено(Организация) Тогда
		мсвНаименование.Добавить(Организация);
	КонецЕсли;
	Если ЗначениеЗаполнено(Партнер) Тогда
		мсвНаименование.Добавить(Партнер);
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент) Тогда
		мсвНаименование.Добавить(Контрагент);
	КонецЕсли;
	Если ЗначениеЗаполнено(Соглашение) Тогда
		мсвНаименование.Добавить(Соглашение);
	КонецЕсли;
	Возврат СтрСоединить(мсвНаименование, ";");
КонецФункции

#КонецОбласти

#КонецЕсли
