#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Нет.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упАналитическиеРазрезыПоПартнерам.Партнер,
	               |	упАналитическиеРазрезыПоПартнерам.Организация,
	               |	упАналитическиеРазрезыПоПартнерам.Соглашение,
	               |	упАналитическиеРазрезыПоПартнерам.Контрагент,
	               |	упАналитическиеРазрезыПоПартнерам.АналитическийРазрезПоПартнерам
	               |ИЗ
	               |	РегистрСведений.упАналитическиеРазрезыПоПартнерам КАК упАналитическиеРазрезыПоПартнерам
	               |ГДЕ
	               |	упАналитическиеРазрезыПоПартнерам.АналитическийРазрезПоПартнерам = &АналитическийРазрезПоПартнерам";
	Запрос.УстановитьПараметр("АналитическийРазрезПоПартнерам", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		упУправленияЗаявками.СформироватьАналитическиеРазрезыПоПартнерам(Партнер,,Организация,,Соглашение,,Контрагент,,Ссылка,Отказ);
	Иначе
		Выборка	= Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			упУправленияЗаявками.СформироватьАналитическиеРазрезыПоПартнерам(Партнер,Выборка.Партнер,Организация, Выборка.Организация,Соглашение,Выборка.Соглашение, Контрагент,Выборка.Контрагент,Ссылка,Отказ);		
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли



