#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура - формирует типовые структуры для корректной работы обработки.
//
// Параметры:
//  сткРеквизитыЗаполнения	 - Структура	 - передаются реквизиты для инициализации.
//
Процедура Инициализация(сткРеквизитыЗаполнения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задания.Очистить();
	Маршрут.Очистить();
	Работы.Очистить();
	
	// Строки маршрута
	сткЗначенияСтрокиМаршрутаДоРедактирования = Новый Структура;
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("Адрес", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("Идентификатор", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ПлановоеПрибытие", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ПлановоеУбытие", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ВремяРабот", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ТипТочки", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ВременноеОкноНачало", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ВременноеОкноОкончание", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("РасстояниеОтПредыдущейТочки", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("РасстояниеОтПредыдущейТочкиФакт",Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ВремяОтПредыдущейТочки", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ВремяОтдыхаВПутиОтПредыдущейТочки", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ВремяОжиданияВТочке", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ВремяОжиданияВТочкеПослеРабот", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ПроездНеРассчитан", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("Гараж", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("Предшественники", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("ПрибытиеФакт", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("УбытиеФакт", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("Пройдена", Неопределено);
	сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить("Отложена", Неопределено);
	
	// Строки работы
	сткЗначенияСтрокиРаботДоРедактирования = Новый Структура;
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("Идентификатор", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ИдентификаторРаботы", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("Задание", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("Операция", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ДополнительнаяОперация", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ВремяРабот", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ВременноеОкноНачало", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ВременноеОкноОкончание", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ГрузовоеМесто", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("Тара", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ВремяОжидания", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ПлановоеВремяНачалаРабот", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("СтрокаНомер", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("КоличествоДопОпераций", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("КоличествоГрузов", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ТипРегламентногоДокумента", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("КоличествоЭкземпляровДокумента", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("АдресРазгрузки", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("Проблема", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ГрузРазделен", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("СкладскаяЯчейка", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ВидГруза", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ТипГруза", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("Отложена", Неопределено);
	сткЗначенияСтрокиРаботДоРедактирования.Вставить("ЗапрещеноСозданиеНовойТочкиМаршрута", Неопределено);
	

	
	// Строки заданий
	сткЗначенияСтрокиЗаданийДоРедактирования = Новый Структура;
	сткЗначенияСтрокиЗаданийДоРедактирования.Вставить("Задание", Неопределено);
	сткЗначенияСтрокиЗаданийДоРедактирования.Вставить("ГрузовоеМесто", Неопределено);
	сткЗначенияСтрокиЗаданийДоРедактирования.Вставить("Тара", Неопределено);
	сткЗначенияСтрокиЗаданийДоРедактирования.Вставить("КоличествоГрузов", Неопределено);
	
	ЗаполнитьВспомогательныеПоляЗаданий = Истина;
	ЗаполнитьПредставлениеМаршрута = Истина;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.упРейс") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, сткРеквизитыЗаполнения);
		
		Запрос = Новый Запрос;
		Запрос.Текст ="
		|//{Запрос: 0 ////////////////////////////////////////
		|// РЕКОМЕНДУЕТСЯ ИСПОЛЬЗОВАТЬ КОНСТРУКТОР ЗАПРОСА ИР ВМЕСТО СТАНДАРТНОГО
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упРаботыПоРейсу.ИдентификаторРаботы КАК ИдентификаторРаботы
		|ПОМЕСТИТЬ втРаботыПоРейсу
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу КАК упРаботыПоРейсу
		|ГДЕ упРаботыПоРейсу.Регистратор = &Рейс
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упМаршрутПоРейсу.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втМаршрутПоРейсу
		|ИЗ
		|	РегистрСведений.упМаршрутПоРейсу КАК упМаршрутПоРейсу
		|ГДЕ упМаршрутПоРейсу.Регистратор = &Рейс
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбРаботы.*,
		|	тбРаботы.Операция.Порядок КАК ТипОперации,
		|	ВЫБОР
		|		КОГДА тбРаботы.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И тбРаботы.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		КОГДА тбРаботы.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяРабот * 3600 + тбРаботы.ВремяОжидания * 3600 - 60) <= тбРаботы.ВременноеОкноОкончание
		|			ТОГДА 1
		|		КОГДА тбРаботы.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяОжидания * 3600 + 60) >= тбРаботы.ВременноеОкноНачало
		|			ТОГДА 1
		|		КОГДА ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяРабот * 3600 + тбРаботы.ВремяОжидания * 3600 - 60) <= тбРаботы.ВременноеОкноОкончание
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяОжидания * 3600 + 60) >= тбРаботы.ВременноеОкноНачало
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	ВЫБОР
		|		КОГДА втРаботыПоРейсу.ИдентификаторРаботы ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК СтрокаДокумента,
		|	упГрузовыеМеста.Валюта КАК Валюта,
		|	упГрузовыеМеста.ТипГруза КАК ТипГруза,
		|	упГрузовыеМеста.Контейнер КАК ЭтоКонтейнер
		|ПОМЕСТИТЬ втРаботы
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(
		|		,
		|		Рейс = &Рейс) КАК тбРаботы
		|	ЛЕВОЕ СОЕДИНЕНИЕ втРаботыПоРейсу КАК втРаботыПоРейсу
		|	ПО тбРаботы.ИдентификаторРаботы = втРаботыПоРейсу.ИдентификаторРаботы
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упГрузовыеМеста КАК упГрузовыеМеста
		|	ПО тбРаботы.ГрузовоеМесто = упГрузовыеМеста.Ссылка
		|;
		|//{Запрос: 3 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботы.Идентификатор КАК Идентификатор,
		|	СУММА(втРаботы.ПопадаетВоВременноеОкно) КАК ПопадаетВоВременноеОкно
		|ПОМЕСТИТЬ втРаботыПопадаютВоВременноеОкно
		|ИЗ
		|	втРаботы КАК втРаботы
		|СГРУППИРОВАТЬ ПО
		|	втРаботы.Идентификатор
		|;
		|//{Запрос: 4 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упРаботыПоРейсу.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ втРегистраторы
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу КАК упРаботыПоРейсу
		|ГДЕ ИСТИНА
		|	И упРаботыПоРейсу.Рейс = &Рейс
		|	И упРаботыПоРейсу.Регистратор ССЫЛКА Документ.упКорректировкаРейса
		|;
		|//{Запрос: 5 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботы.Задание КАК Задание,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.ГрузовоеМесто
		|	КОНЕЦ КАК ГрузовоеМесто,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.Тара
		|	КОНЕЦ КАК Тара,
		|	СУММА(ВЫБОР
		|		КОГДА втРаботы.Отменена
		|				И НЕ втРаботы.ГрузРазделен
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоОтменена,
		|	СУММА(1) КАК КоличествоОпераций
		|ПОМЕСТИТЬ втОтмененныеЗадания
		|ИЗ
		|	втРаботы КАК втРаботы
		|ГДЕ ЛОЖЬ
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ВыемкаЦенностей)
		|СГРУППИРОВАТЬ ПО
		|	втРаботы.Задание,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.ГрузовоеМесто
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.Тара
		|	КОНЕЦ
		|;
		|//{Запрос: 6 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбМаршрут.*,
		|	ВЫБОР
		|		КОГДА тбМаршрут.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И тбМаршрут.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		КОГДА тбМаршрут.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеУбытие, СЕКУНДА, - 60) <= тбМаршрут.ВременноеОкноОкончание
		|			ТОГДА 1
		|		КОГДА тбМаршрут.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеПрибытие, СЕКУНДА, тбМаршрут.ВремяОжиданияВТочке * 3600 + 60) >= тбМаршрут.ВременноеОкноНачало
		|			ТОГДА 1
		|		КОГДА ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеУбытие, СЕКУНДА, - 60) <= тбМаршрут.ВременноеОкноОкончание
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеПрибытие, СЕКУНДА, тбМаршрут.ВремяОжиданияВТочке * 3600 + 60) >= тбМаршрут.ВременноеОкноНачало
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	тбМаршрут.ТипТочки.Порядок КАК ИндексКартинки,
		|	ВЫБОР
		|		КОГДА втМаршрутПоРейсу.Идентификатор ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК СтрокаДокумента,
		|	ЛОЖЬ КАК ПересчитатьВременноеОкно,
		|	ЛОЖЬ КАК ПересчитатьПрибытиеУбытие
		|ПОМЕСТИТЬ втМаршрут
		|ИЗ
		|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
		|		,
		|		Рейс = &Рейс) КАК тбМаршрут
		|	ЛЕВОЕ СОЕДИНЕНИЕ втМаршрутПоРейсу КАК втМаршрутПоРейсу
		|	ПО тбМаршрут.Идентификатор = втМаршрутПоРейсу.Идентификатор
		|;
		|//{Запрос: 7 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|		КОГДА втМаршрут.ПопадаетВоВременноеОкно = 0
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ПопадаетВоВременноеОкно,
		|	втРаботы.Задание КАК Задание,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.ГрузовоеМесто
		|	КОНЕЦ КАК ГрузовоеМесто
		|ПОМЕСТИТЬ втЗаданиеПопадаетВоВременныеОкна
		|ИЗ
		|	втМаршрут КАК втМаршрут
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРаботы КАК втРаботы
		|	ПО втМаршрут.Идентификатор = втРаботы.Идентификатор
		|СГРУППИРОВАТЬ ПО
		|	втРаботы.Задание,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.ГрузовоеМесто
		|	КОНЕЦ
		|;
		|//{Запрос: 8 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМаршрут.*,
		|	ВЫБОР
		|		КОГДА втМаршрут.ПопадаетВоВременноеОкно = 0
		|				ИЛИ ЕСТЬNULL(втРаботыПопадаютВоВременноеОкно.ПопадаетВоВременноеОкно, 1) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно
		|ИЗ
		|	втМаршрут КАК втМаршрут
		|	ЛЕВОЕ СОЕДИНЕНИЕ втРаботыПопадаютВоВременноеОкно КАК втРаботыПопадаютВоВременноеОкно
		|	ПО втМаршрут.Идентификатор = втРаботыПопадаютВоВременноеОкно.Идентификатор
		|УПОРЯДОЧИТЬ ПО
		|	СтрокаНомер
		|;
		|//{Запрос: 9 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	втРаботы КАК втРаботы
		|УПОРЯДОЧИТЬ ПО
		|	СтрокаНомер,
		|	втРаботы.ПлановоеВремяНачалаРабот
		|;
		|//{Запрос: 10 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упРейсЗадания.Задание КАК Задание,
		|	упРейсЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	упРейсЗадания.Тара КАК Тара,
		|	упРейсЗадания.КоличествоГрузов КАК КоличествоГрузов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втОтмененныеЗадания.КоличествоОтменена, 0) = ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0)
		|				И ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Отменено,
		|	ИСТИНА КАК СтрокаДокумента,
		|	1 КАК Порядок,
		|	упРейсЗадания.НомерСтроки КАК НомерСтроки,
		|	ЛОЖЬ КАК ФлагРаспределения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втЗаданиеПопадаетВоВременныеОкна.ПопадаетВоВременноеОкно, 0) > 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	Документ.упРейс.Задания КАК упРейсЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ втОтмененныеЗадания КАК втОтмененныеЗадания
		|	ПО ИСТИНА
		|		И упРейсЗадания.Задание = втОтмененныеЗадания.Задание
		|		И упРейсЗадания.ГрузовоеМесто = втОтмененныеЗадания.ГрузовоеМесто
		|	ЛЕВОЕ СОЕДИНЕНИЕ втЗаданиеПопадаетВоВременныеОкна КАК втЗаданиеПопадаетВоВременныеОкна
		|	ПО ИСТИНА
		|		И упРейсЗадания.Задание = втЗаданиеПопадаетВоВременныеОкна.Задание
		|		И упРейсЗадания.ГрузовоеМесто = втЗаданиеПопадаетВоВременныеОкна.ГрузовоеМесто
		|ГДЕ упРейсЗадания.Ссылка = &Рейс
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	упКорректировкаРейсаЗадания.Задание КАК Задание,
		|	упКорректировкаРейсаЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	упКорректировкаРейсаЗадания.Тара КАК Тара,
		|	упКорректировкаРейсаЗадания.КоличествоГрузов КАК КоличествоГрузов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втОтмененныеЗадания.КоличествоОтменена, 0) = ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0)
		|				И ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Отменено,
		|	ЛОЖЬ КАК СтрокаДокумента,
		|	2 КАК Порядок,
		|	упКорректировкаРейсаЗадания.НомерСтроки КАК НомерСтроки,
		|	ЛОЖЬ КАК ФлагРаспределения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втЗаданиеПопадаетВоВременныеОкна.ПопадаетВоВременноеОкно, 0) > 0
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно
		|ИЗ
		|	Документ.упКорректировкаРейса.Задания КАК упКорректировкаРейсаЗадания
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегистраторы КАК втРегистраторы
		|	ПО упКорректировкаРейсаЗадания.Ссылка = втРегистраторы.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ втОтмененныеЗадания КАК втОтмененныеЗадания
		|	ПО ИСТИНА
		|		И упКорректировкаРейсаЗадания.Задание = втОтмененныеЗадания.Задание
		|		И упКорректировкаРейсаЗадания.ГрузовоеМесто = втОтмененныеЗадания.ГрузовоеМесто
		|	ЛЕВОЕ СОЕДИНЕНИЕ втЗаданиеПопадаетВоВременныеОкна КАК втЗаданиеПопадаетВоВременныеОкна
		|	ПО ИСТИНА
		|		И упКорректировкаРейсаЗадания.Задание = втЗаданиеПопадаетВоВременныеОкна.Задание
		|		И упКорректировкаРейсаЗадания.ГрузовоеМесто = втЗаданиеПопадаетВоВременныеОкна.ГрузовоеМесто
		|;
		|//{Запрос: 11 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Задание КАК Задание,
		|	втЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	втЗадания.Тара КАК Тара,
		|	СУММА(втЗадания.КоличествоГрузов) КАК КоличествоГрузов,
		|	втЗадания.Отменено КАК Отменено,
		|	втЗадания.СтрокаДокумента КАК СтрокаДокумента,
		|	МАКСИМУМ(втЗадания.Порядок) КАК Порядок,
		|	МАКСИМУМ(втЗадания.НомерСтроки) КАК НомерСтроки,
		|	втЗадания.ФлагРаспределения КАК ФлагРаспределения,
		|	втЗадания.ПопадаетВоВременноеОкно КАК ПопадаетВоВременноеОкно,
		|	ВЫБОР
		|		КОГДА ВидыТочекОтправленияАдресОтправления.ВидТочкиОтправления Есть Null
		|				И ВидыТочекОтправленияАдресПолучения.ВидТочкиОтправления Есть Null
		|			ТОГДА 3
		|		КОГДА  НЕ ВидыТочекОтправленияАдресОтправления.ВидТочкиОтправления Есть Null
		|				И НЕ ВидыТочекОтправленияАдресПолучения.ВидТочкиОтправления Есть Null
		|			ТОГДА 5
		|		КОГДА ВидыТочекОтправленияАдресОтправления.ВидТочкиОтправления Есть Null
		|				И НЕ ВидыТочекОтправленияАдресПолучения.ВидТочкиОтправления Есть Null
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ИндексСостоянияАдресов
		|ИЗ
		|	втЗадания КАК втЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упВидыПеревозок.ВидыТочекОтправления КАК ВидыТочекОтправленияАдресПолучения
		|	ПО ИСТИНА
		|		И ВидыТочекОтправленияАдресПолучения.Ссылка = ВЫРАЗИТЬ(&Рейс КАК Документ.упРейс).ВидПеревозки
		|		И втЗадания.Задание.АдресПолучения.ВидАдреса = ВидыТочекОтправленияАдресПолучения.ВидТочкиОтправления
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упВидыПеревозок.ВидыТочекОтправления КАК ВидыТочекОтправленияАдресОтправления
		|	ПО ИСТИНА
		|		И ВидыТочекОтправленияАдресОтправления.Ссылка = ВЫРАЗИТЬ(&Рейс КАК Документ.упРейс).ВидПеревозки
		|		И втЗадания.Задание.АдресОтправления.ВидАдреса = ВидыТочекОтправленияАдресОтправления.ВидТочкиОтправления
		|
		|СГРУППИРОВАТЬ ПО
		|	втЗадания.Задание,
		|	втЗадания.ГрузовоеМесто,
		|	втЗадания.Тара,
		|	втЗадания.Отменено,
		|	втЗадания.СтрокаДокумента,
		|	втЗадания.ФлагРаспределения,
		|	втЗадания.ПопадаетВоВременноеОкно,
		|	ВЫБОР
		|		КОГДА ВидыТочекОтправленияАдресОтправления.ВидТочкиОтправления Есть Null
		|				И ВидыТочекОтправленияАдресПолучения.ВидТочкиОтправления Есть Null
		|			ТОГДА 3
		|		КОГДА  НЕ ВидыТочекОтправленияАдресОтправления.ВидТочкиОтправления Есть Null
		|				И НЕ ВидыТочекОтправленияАдресПолучения.ВидТочкиОтправления Есть Null
		|			ТОГДА 5
		|		КОГДА ВидыТочекОтправленияАдресОтправления.ВидТочкиОтправления Есть Null
		|				И НЕ ВидыТочекОтправленияАдресПолучения.ВидТочкиОтправления Есть Null
		|			ТОГДА 2
		|		ИНАЧЕ 0
		|	КОНЕЦ 
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|//{Запрос: 12 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМаршрут.Адрес КАК Адрес,
		|	втРаботы.Задание КАК Задание,
		|	втРаботы.ГрузовоеМесто КАК ГрузовоеМесто,
		|	втРаботы.Тара КАК Тара
		|ИЗ
		|	втМаршрут КАК втМаршрут
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРаботы КАК втРаботы
		|	ПО втМаршрут.Идентификатор = втРаботы.Идентификатор
		|ГДЕ ЛОЖЬ
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ВыемкаЦенностей)
		|";
		
		ПустыеГрузовыеМеста = ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса;					   
		Запрос.УстановитьПараметр("Рейс", Рейс);					   					   
		Запрос.УстановитьПараметр("ПустыеГрузовыеМеста", ПустыеГрузовыеМеста);					   					   
		
		мсвРезультат = Запрос.ВыполнитьПакет();
		
		ИндексЗапросаМаршрут = 8;
		ИндексЗапросаРаботы = 9;
		ИндексЗапросаЗадания = 11;
		ИндексЗапросаАдресаПогрузки = 12;
				
		тбзМаршрут = мсвРезультат[ИндексЗапросаМаршрут].Выгрузить();
		Маршрут.Загрузить(тбзМаршрут);
		МаршрутДоКорректировки.Загрузить(тбзМаршрут);
		
		Задания.Загрузить(мсвРезультат[ИндексЗапросаЗадания].Выгрузить());
		АдресаПогрузкиПоРейсу.Загрузить(мсвРезультат[ИндексЗапросаАдресаПогрузки].Выгрузить());
		
		ЕстьОтложенныеРаботы = Ложь;
		
		Для каждого ТочкаМаршрута Из Маршрут Цикл
			ЗаполнитьПоляПредставленийСтрокиМаршрута(ТочкаМаршрута);
			ЕстьОтложенныеРаботы = ЕстьОтложенныеРаботы Или ТочкаМаршрута.Отложена; 
		КонецЦикла;
		
		тбзРаботы	= мсвРезультат[ИндексЗапросаРаботы].Выгрузить();
		Работы.Загрузить(тбзРаботы);
		РаботыДоКорректировки.Загрузить(тбзРаботы);
		
		Для каждого Работа Из Работы Цикл
			ЗаполнитьПоляПредставленийСтрокиРабот(Работа);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.упРегистрацияОтложенныхРаботПоРейсу") Тогда	
		
		ЗаполнитьВспомогательныеПоляЗаданий = Ложь;
		ЗаполнитьПредставлениеМаршрута = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбРаботы.*
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(
		|		&ПериодИсключая,
		|		Рейс = &Рейс) КАК тбРаботы
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбРаботы.*
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(
		|		&ПериодВключая,
		|		Рейс = &Рейс) КАК тбРаботы
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбМаршрут.*
		|ИЗ
		|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
		|		&ПериодИсключая,
		|		Рейс = &Рейс) КАК тбМаршрут
		|;
		|//{Запрос: 3 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбМаршрут.*
		|ИЗ
		|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
		|		&ПериодВключая,
		|		Рейс = &Рейс) КАК тбМаршрут
		|;
		|//{Запрос: 4 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упПеревозчикПоРейсуСрезПоследних.*
		|ИЗ
		|	РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(
		|		&ПериодИсключая,
		|		Рейс = &Рейс) КАК упПеревозчикПоРейсуСрезПоследних
		|;
		|//{Запрос: 5 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упВидыПеревозокТ.ВариантФормированияМаршрута КАК ВариантФормированияМаршрута,
		|	упВидыПеревозокТ.Ссылка КАК ВидПеревозки,
		|	упВидыПеревозокТ.РазрешеноОтложенноеВыполнениеЧастиРаботПоРейсу КАК РазрешеноОтложенноеВыполнениеЧастиРаботПоРейсу,
		|	упВидыПеревозокТ.ВидЗоныДляФормированияПредставленияРейса КАК ВидЗоныДляФормированияПредставленияРейса
		|ИЗ
		|	Документ.упРейс КАК упРейсТ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упВидыПеревозок КАК упВидыПеревозокТ
		|	ПО ИСТИНА
		|		И упВидыПеревозокТ.ВидТранспортнойУслуги = упРейсТ.ВидТранспортнойУслуги
		|		И упВидыПеревозокТ.Ссылка = упРейсТ.ВидПеревозки
		|ГДЕ 
		|	ИСТИНА
		|	И &ПолнаяИнициализация
		|	И упРейсТ.Ссылка = &Рейс
		|;
		|//{Запрос: 6 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упПрохождениеТочкиТ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.упПрохождениеТочки КАК упПрохождениеТочкиТ
		|ГДЕ ИСТИНА
		|	И &ПолнаяИнициализация
		|	И НЕ (упПрохождениеТочкиТ.Проведен)
		|	И НЕ (упПрохождениеТочкиТ.ПометкаУдаления)
		|	И упПрохождениеТочкиТ.ИсточникСозданияОбъекта = ЗНАЧЕНИЕ(Перечисление.упИсточникиСозданияОбъекта.МобильныйКлиент)
		|	И упПрохождениеТочкиТ.Рейс = &Рейс
		|";


		ЧастичнаяИнициализация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(сткРеквизитыЗаполнения, "ЧастичнаяИнициализация", Ложь);
		
		текПериодВключая = Новый Граница(Новый МоментВремени(Период, Ссылка), ВидГраницы.Включая);
		текПериодИсключая = Новый Граница(Новый МоментВремени(Период, Ссылка), ВидГраницы.Исключая);
		
		Запрос.УстановитьПараметр("ПериодВключая",  текПериодВключая);
		Запрос.УстановитьПараметр("ПериодИсключая", текПериодИсключая);
		Запрос.УстановитьПараметр("Рейс", Рейс);			
		Запрос.УстановитьПараметр("ПолнаяИнициализация", Не ЧастичнаяИнициализация);
				
		мсвРезультат = Запрос.ВыполнитьПакет();
		ИндексЗапросаМаршрутДоКорректировки = 2;
		ИндексЗапросаРаботыДоКорректировки = 0;
		ИндексЗапросаМаршрут = 3;
		ИндексЗапросаРаботы = 1;
		ИндексЗапросаПеревозчик = 4;
		ИндексЗапросаВидПеревозки = 5;
		ИндексЗапросаЕстьПрохождениеНаМК = 6;
			
		МаршрутДоКорректировки.Загрузить(мсвРезультат[ИндексЗапросаМаршрутДоКорректировки].Выгрузить());
		Маршрут.Загрузить(мсвРезультат[ИндексЗапросаМаршрут].Выгрузить());
		РаботыДоКорректировки.Загрузить(мсвРезультат[ИндексЗапросаРаботыДоКорректировки].Выгрузить());
		Работы.Загрузить(мсвРезультат[ИндексЗапросаРаботы].Выгрузить());
		
		сткПеревозчикПоРейсу = Новый Структура();
		ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, мсвРезультат[ИндексЗапросаПеревозчик], сткПеревозчикПоРейсу);
		ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, мсвРезультат[ИндексЗапросаВидПеревозки]);
		
		РезультатЗапроса = мсвРезультат[ИндексЗапросаЕстьПрохождениеНаМК];
		ПрохождениеТочки = Документы.упПрохождениеТочки.ПустаяСсылка();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаПрохождение = РезультатЗапроса.Выбрать();
			Если ВыборкаПрохождение.Следующий() Тогда
				ПрохождениеТочки = ВыборкаПрохождение.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		ЕстьОтложенныеРаботы = Истина; 
							
	Иначе
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, сткРеквизитыЗаполнения);
		сткРеквизиты = Новый Структура();
		сткРеквизиты.Вставить("ПараметрыВводаИнформацииОГрузовыхМестах", "ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах");
		сткРеквизиты.Вставить("ВидЗоныДляФормированияПредставленияРейса", "ВидПеревозки.ВидЗоныДляФормированияПредставленияРейса");
		сткРеквизиты.Вставить("ДопустимыйПериодРассогласованностиСФактическимиДанными", "ВидПеревозки.ДопустимыйПериодРассогласованностиСФактическимиДанными");
		сткРеквизиты.Вставить("ПересчитыватьПлановоеВремяПосещенияТочекМаршрута", "ВидПеревозки.ПересчитыватьПлановоеВремяПосещенияТочекМаршрута");
		сткРеквизиты.Вставить("ВариантФормированияМаршрута", "ВидПеревозки.ВариантФормированияМаршрута");
		сткРеквизиты.Вставить("СпособУчетаВозвращенныхДокументов", "ВидПеревозки.СпособУчетаВозвращенныхДокументов");
		сткРеквизиты.Вставить("Организация", "Организация");
		сткРеквизиты.Вставить("ВидПеревозки", "ВидПеревозки");
		сткРеквизиты.Вставить("ЧасовойПояс", "ЧасовойПояс");
		сткРеквизиты.Вставить("ВидТранспортнойУслуги", "ВидТранспортнойУслуги");
				
		сткДанныеВидаПеревозки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Рейс, сткРеквизиты);
		
		ПараметрыВводаИнформацииОГрузовыхМестах = сткДанныеВидаПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах; 
		ФормироватьПоГрузовымМестам = Ложь
		                              Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку 
		                              Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса;
		
		ВидЗоныДляФормированияПредставленияРейса = сткДанныеВидаПеревозки.ВидЗоныДляФормированияПредставленияРейса; 
		
		ИспользуютсяДополнительныеОперации = ПолучитьФункциональнуюОпцию("упИспользуютсяДополнительныеОперации");
		Организация = сткДанныеВидаПеревозки.Организация;
		ВидПеревозки = сткДанныеВидаПеревозки.ВидПеревозки;
		ВидТранспортнойУслуги = сткДанныеВидаПеревозки.ВидТранспортнойУслуги;
		ЧасовойПояс = сткДанныеВидаПеревозки.ЧасовойПояс;
		ВариантФормированияМаршрута = сткДанныеВидаПеревозки.ВариантФормированияМаршрута;
		СпособУчетаВозвращенныхДокументов = сткДанныеВидаПеревозки.СпособУчетаВозвращенныхДокументов;										
		
		ПересчитыватьПлановоеВремяПосещенияТочекМаршрута = сткДанныеВидаПеревозки.ПересчитыватьПлановоеВремяПосещенияТочекМаршрута;
		ДопустимыйПериодРассогласованностиСФактическимиДанными	= сткДанныеВидаПеревозки.ДопустимыйПериодРассогласованностиСФактическимиДанными;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|// РЕКОМЕНДУЕТСЯ ИСПОЛЬЗОВАТЬ КОНСТРУКТОР ЗАПРОСА ИР ВМЕСТО СТАНДАРТНОГО
		|ВЫБРАТЬ
		|	тбРаботы.*,
		|	ВЫБОР
		|		КОГДА тбРаботы.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И тбРаботы.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		КОГДА тбРаботы.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяРабот * 3600 + тбРаботы.ВремяОжидания * 3600 - 60) <= тбРаботы.ВременноеОкноОкончание
		|			ТОГДА 1
		|		КОГДА тбРаботы.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяОжидания * 3600 + 60) >= тбРаботы.ВременноеОкноНачало
		|			ТОГДА 1
		|		КОГДА ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяРабот * 3600 + тбРаботы.ВремяОжидания * 3600 - 60) <= тбРаботы.ВременноеОкноОкончание
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяОжидания * 3600 + 60) >= тбРаботы.ВременноеОкноНачало
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	тбРаботы.Сумма КАК Сумма,
		|	упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
		|	упГрузовыеМеста.Валюта КАК Валюта,
		|	упГрузовыеМеста.ТипГруза КАК ТипГруза,
		|	упГрузовыеМеста.Контейнер КАК ЭтоКонтейнер
		|ПОМЕСТИТЬ втРаботыДоКорректировки
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(
		|		&ПериодИсключая,
		|		Рейс = &Рейс) КАК тбРаботы
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГруза
		|	ПО тбРаботы.Задание = упЗаданиеНаПеревозкуГруза.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упГрузовыеМеста КАК упГрузовыеМеста
		|	ПО тбРаботы.ГрузовоеМесто = упГрузовыеМеста.Ссылка
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботыДоКорректировки.Идентификатор КАК Идентификатор,
		|	СУММА(втРаботыДоКорректировки.ПопадаетВоВременноеОкно) КАК ПопадаетВоВременноеОкно
		|ПОМЕСТИТЬ втРаботыДоКорректировкиПопадаетВоВременноеОкно
		|ИЗ
		|	втРаботыДоКорректировки КАК втРаботыДоКорректировки
		|СГРУППИРОВАТЬ ПО
		|	втРаботыДоКорректировки.Идентификатор
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбРаботы.*,
		|	тбРаботы.Операция.Порядок КАК ТипОперации,
		|	ВЫБОР
		|		КОГДА тбРаботы.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И тбРаботы.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		КОГДА тбРаботы.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяРабот * 3600 + тбРаботы.ВремяОжидания * 3600 - 60) <= тбРаботы.ВременноеОкноОкончание
		|			ТОГДА 1
		|		КОГДА тбРаботы.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяОжидания * 3600 + 60) >= тбРаботы.ВременноеОкноНачало
		|			ТОГДА 1
		|		КОГДА ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяРабот * 3600 + тбРаботы.ВремяОжидания * 3600 - 60) <= тбРаботы.ВременноеОкноОкончание
		|				И ДОБАВИТЬКДАТЕ(тбРаботы.ПлановоеВремяНачалаРабот, СЕКУНДА, тбРаботы.ВремяОжидания * 3600 + 60) >= тбРаботы.ВременноеОкноНачало
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	тбРаботы.Сумма КАК Сумма,
		|	упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
		|	упГрузовыеМеста.Валюта КАК Валюта,
		|	упГрузовыеМеста.ТипГруза КАК ТипГруза,
		|	упГрузовыеМеста.Контейнер КАК ЭтоКонтейнер
		|ПОМЕСТИТЬ втРаботыПослеКорректировки
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(
		|		&ПериодВключая,
		|		Рейс = &Рейс) КАК тбРаботы
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГруза
		|	ПО тбРаботы.Задание = упЗаданиеНаПеревозкуГруза.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упГрузовыеМеста КАК упГрузовыеМеста
		|	ПО тбРаботы.ГрузовоеМесто = упГрузовыеМеста.Ссылка
		|;
		|//{Запрос: 3 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботыПослеКорректировки.Идентификатор КАК Идентификатор,
		|	СУММА(втРаботыПослеКорректировки.ПопадаетВоВременноеОкно) КАК ПопадаетВоВременноеОкно
		|ПОМЕСТИТЬ втРаботыПослеКорректировкиПопадаетВоВременноеОкно
		|ИЗ
		|	втРаботыПослеКорректировки КАК втРаботыПослеКорректировки
		|СГРУППИРОВАТЬ ПО
		|	втРаботыПослеКорректировки.Идентификатор
		|;
		|//{Запрос: 4 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упРаботыПоРейсу.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ втРегистраторы
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу КАК упРаботыПоРейсу
		|ГДЕ ИСТИНА
		|	И упРаботыПоРейсу.Рейс = &Рейс
		|	И упРаботыПоРейсу.Регистратор ССЫЛКА Документ.упКорректировкаРейса
		|;
		|//{Запрос: 5 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботы.Задание КАК Задание,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.ГрузовоеМесто
		|	КОНЕЦ КАК ГрузовоеМесто,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.Тара
		|	КОНЕЦ КАК Тара,
		|	СУММА(ВЫБОР
		|		КОГДА втРаботы.Отменена
		|				И НЕ втРаботы.ГрузРазделен
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК КоличествоОтменена,
		|	СУММА(1) КАК КоличествоОпераций,
		|	МАКСИМУМ(втРаботы.Проблема) КАК Проблема
		|ПОМЕСТИТЬ втОтмененныеЗадания
		|ИЗ
		|	втРаботыПослеКорректировки КАК втРаботы
		|ГДЕ ЛОЖЬ
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ВыемкаЦенностей)
		|СГРУППИРОВАТЬ ПО
		|	втРаботы.Задание,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.ГрузовоеМесто
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ втРаботы.Тара
		|	КОНЕЦ
		|;
		|//{Запрос: 6 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втРаботыДоКорректировки.ИдентификаторРаботы КАК ИдентификаторРаботы
		|ПОМЕСТИТЬ втИдентификаторыРаботДоКорректировки
		|ИЗ
		|	втРаботыДоКорректировки КАК втРаботыДоКорректировки
		|;
		|//{Запрос: 7 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбМаршрут.*,
		|	ВЫБОР
		|		КОГДА тбМаршрут.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И тбМаршрут.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		КОГДА тбМаршрут.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеУбытие, СЕКУНДА, - 60) <= тбМаршрут.ВременноеОкноОкончание
		|			ТОГДА 1
		|		КОГДА тбМаршрут.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеПрибытие, СЕКУНДА, тбМаршрут.ВремяОжиданияВТочке * 3600 + 60) >= тбМаршрут.ВременноеОкноНачало
		|			ТОГДА 1
		|		КОГДА ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеУбытие, СЕКУНДА, - 60) <= тбМаршрут.ВременноеОкноОкончание
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеПрибытие, СЕКУНДА, тбМаршрут.ВремяОжиданияВТочке * 3600 + 60) >= тбМаршрут.ВременноеОкноНачало
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	тбМаршрут.ТипТочки.Порядок КАК ИндексКартинки
		|ПОМЕСТИТЬ втМаршрутДоКорректировки
		|ИЗ
		|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
		|		&ПериодИсключая,
		|		Рейс = &Рейс) КАК тбМаршрут
		|;
		|//{Запрос: 8 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втМаршрутДоКорректировки.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втИдентификаторыТочекДоКорректировки
		|ИЗ
		|	втМаршрутДоКорректировки КАК втМаршрутДоКорректировки
		|;
		|//{Запрос: 9 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втРаботыДоКорректировкиТ.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втИдентификаторыТочекДоКорректировкиСозданныхПриОтменеРазгрузки
		|ИЗ
		|	втРаботыДоКорректировки КАК втРаботыДоКорректировкиТ
		|ГДЕ ИСТИНА
		|	И втРаботыДоКорректировкиТ.ПроблемаПричинаВозникновенияЭтойРаботы <> ЗНАЧЕНИЕ(Справочник.упПроблемы.ПустаяСсылка)
		|	И втРаботыДоКорректировкиТ.ПроблемаПричинаВозникновенияЭтойРаботы <> ЗНАЧЕНИЕ(Справочник.упПроблемы.ДосрочноеПрохождение)
		|;
		|//{Запрос: 10 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМаршрутДоКорректировки.*,
		|	ВЫБОР
		|		КОГДА втМаршрутДоКорректировки.ПопадаетВоВременноеОкно = 0
		|				ИЛИ ЕСТЬNULL(втРаботыДоКорректировкиПопадаетВоВременноеОкно.ПопадаетВоВременноеОкно, 1) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	втМаршрутДоКорректировки.ИндексКартинки КАК ИндексКартинки,
		|	ВЫБОР
		|		КОГДА НЕ ВидыТочекОтправления.Ссылка ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА НЕ втИдентификаторыТочекДоКорректировкиСозданныхПриОтменеРазгрузки.Идентификатор ЕСТЬ NULL
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	втМаршрутДоКорректировки КАК втМаршрутДоКорректировки
		|	ЛЕВОЕ СОЕДИНЕНИЕ втРаботыДоКорректировкиПопадаетВоВременноеОкно КАК втРаботыДоКорректировкиПопадаетВоВременноеОкно
		|	ПО втМаршрутДоКорректировки.Идентификатор = втРаботыДоКорректировкиПопадаетВоВременноеОкно.Идентификатор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упВидыПеревозок.ВидыТочекОтправления КАК ВидыТочекОтправления
		|	ПО ИСТИНА
		|		И втМаршрутДоКорректировки.Адрес.ВидАдреса = ВидыТочекОтправления.ВидТочкиОтправления
		|		И &ВидПеревозки = ВидыТочекОтправления.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ втИдентификаторыТочекДоКорректировкиСозданныхПриОтменеРазгрузки КАК втИдентификаторыТочекДоКорректировкиСозданныхПриОтменеРазгрузки
		|	ПО втМаршрутДоКорректировки.Идентификатор = втИдентификаторыТочекДоКорректировкиСозданныхПриОтменеРазгрузки.Идентификатор
		|УПОРЯДОЧИТЬ ПО
		|	втМаршрутДоКорректировки.СтрокаНомер
		|;
		|//{Запрос: 11 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботыДоКорректировки.*,
		|	втМаршрутДоКорректировки.СтрокаНомер КАК ПорядокТочки
		|ИЗ
		|	втРаботыДоКорректировки КАК втРаботыДоКорректировки
		|	ЛЕВОЕ СОЕДИНЕНИЕ втМаршрутДоКорректировки КАК втМаршрутДоКорректировки
		|	ПО втРаботыДоКорректировки.Идентификатор = втМаршрутДоКорректировки.Идентификатор
		|УПОРЯДОЧИТЬ ПО
		|	втРаботыДоКорректировки.СтрокаНомер,
		|	ПорядокТочки,
		|	втРаботыДоКорректировки.ПлановоеВремяНачалаРабот
		|;
		|//{Запрос: 12 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втРаботыПослеКорректировкиТ.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ втИдентификаторыТочекСозданныхПриОтменеРазгрузки
		|ИЗ
		|	втРаботыПослеКорректировки КАК втРаботыПослеКорректировкиТ
		|ГДЕ ИСТИНА
		|	И втРаботыПослеКорректировкиТ.ПроблемаПричинаВозникновенияЭтойРаботы <> ЗНАЧЕНИЕ(Справочник.упПроблемы.ПустаяСсылка)
		|	И втРаботыПослеКорректировкиТ.ПроблемаПричинаВозникновенияЭтойРаботы <> ЗНАЧЕНИЕ(Справочник.упПроблемы.ДосрочноеПрохождение)
		|;
		|//{Запрос: 13 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбМаршрут.*,
		|	ВЫБОР
		|		КОГДА тбМаршрут.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И тбМаршрут.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 1
		|		КОГДА тбМаршрут.ВременноеОкноНачало = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеУбытие, СЕКУНДА, - 60) <= тбМаршрут.ВременноеОкноОкончание
		|			ТОГДА 1
		|		КОГДА тбМаршрут.ВременноеОкноОкончание = ДАТАВРЕМЯ(1, 1, 1)
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеПрибытие, СЕКУНДА, тбМаршрут.ВремяОжиданияВТочке * 3600 + 60) >= тбМаршрут.ВременноеОкноНачало
		|			ТОГДА 1
		|		КОГДА ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеУбытие, СЕКУНДА, - 60) <= тбМаршрут.ВременноеОкноОкончание
		|				И ДОБАВИТЬКДАТЕ(тбМаршрут.ПлановоеПрибытие, СЕКУНДА, тбМаршрут.ВремяОжиданияВТочке * 3600 + 60) >= тбМаршрут.ВременноеОкноНачало
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	тбМаршрут.ТипТочки.Порядок КАК ИндексКартинки,
		|	ВЫБОР
		|		КОГДА втИдентификаторыТочекДоКорректировки.Идентификатор ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтрокаДокумента
		|ПОМЕСТИТЬ втМаршрутПослеКорректировки
		|ИЗ
		|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
		|		&ПериодВключая,
		|		Рейс = &Рейс) КАК тбМаршрут
		|	ЛЕВОЕ СОЕДИНЕНИЕ втИдентификаторыТочекДоКорректировки КАК втИдентификаторыТочекДоКорректировки
		|	ПО тбМаршрут.Идентификатор = втИдентификаторыТочекДоКорректировки.Идентификатор
		|;
		|//{Запрос: 14 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМаршрутПослеКорректировки.*,
		|	ВЫБОР
		|		КОГДА втМаршрутПослеКорректировки.ПопадаетВоВременноеОкно = 0
		|				ИЛИ ЕСТЬNULL(втРаботыПослеКорректировкиПопадаетВоВременноеОкно.ПопадаетВоВременноеОкно, 1) = 0
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПопадаетВоВременноеОкно,
		|	втМаршрутПослеКорректировки.ИндексКартинки КАК ИндексКартинки,
		|	втМаршрутПослеКорректировки.СтрокаДокумента КАК СтрокаДокумента,
		|	ВЫБОР
		|		КОГДА НЕ ВидыТочекОтправления.Ссылка ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА НЕ втИдентификаторыТочекСозданныхПриОтменеРазгрузки.Идентификатор ЕСТЬ NULL
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	втМаршрутПослеКорректировки КАК втМаршрутПослеКорректировки
		|	ЛЕВОЕ СОЕДИНЕНИЕ втРаботыПослеКорректировкиПопадаетВоВременноеОкно КАК втРаботыПослеКорректировкиПопадаетВоВременноеОкно
		|	ПО втМаршрутПослеКорректировки.Идентификатор = втРаботыПослеКорректировкиПопадаетВоВременноеОкно.Идентификатор
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упВидыПеревозок.ВидыТочекОтправления КАК ВидыТочекОтправления
		|	ПО ИСТИНА
		|		И втМаршрутПослеКорректировки.Адрес.ВидАдреса = ВидыТочекОтправления.ВидТочкиОтправления
		|		И &ВидПеревозки = ВидыТочекОтправления.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ втИдентификаторыТочекСозданныхПриОтменеРазгрузки КАК втИдентификаторыТочекСозданныхПриОтменеРазгрузки
		|	ПО втМаршрутПослеКорректировки.Идентификатор = втИдентификаторыТочекСозданныхПриОтменеРазгрузки.Идентификатор
		|УПОРЯДОЧИТЬ ПО
		|	СтрокаНомер
		|;
		|//{Запрос: 15 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботыПослеКорректировки.*,
		|	ВЫБОР
		|		КОГДА втИдентификаторыРаботДоКорректировки.ИдентификаторРаботы ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтрокаДокумента,
		|	втМаршрутПослеКорректировки.СтрокаНомер КАК ПорядокТочки,
		|	втРаботыПослеКорректировки.ПопадаетВоВременноеОкно КАК ПопадаетВоВременноеОкно,
		|	втРаботыПослеКорректировки.Сумма КАК Сумма,
		|	втРаботыПослеКорректировки.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
		|	втРаботыПослеКорректировки.Валюта КАК Валюта
		|ИЗ
		|	втРаботыПослеКорректировки КАК втРаботыПослеКорректировки
		|	ЛЕВОЕ СОЕДИНЕНИЕ втИдентификаторыРаботДоКорректировки КАК втИдентификаторыРаботДоКорректировки
		|	ПО втРаботыПослеКорректировки.ИдентификаторРаботы = втИдентификаторыРаботДоКорректировки.ИдентификаторРаботы
		|	ЛЕВОЕ СОЕДИНЕНИЕ втМаршрутПослеКорректировки КАК втМаршрутПослеКорректировки
		|	ПО втРаботыПослеКорректировки.Идентификатор = втМаршрутПослеКорректировки.Идентификатор
		|УПОРЯДОЧИТЬ ПО
		|	втРаботыПослеКорректировки.СтрокаНомер,
		|	ПорядокТочки,
		|	втРаботыПослеКорректировки.ПлановоеВремяНачалаРабот
		|;
		|//{Запрос: 16 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упРейсЗадания.Задание КАК Задание,
		|	упРейсЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
		|	упРейсЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	упРейсЗадания.Тара КАК Тара,
		|	упРейсЗадания.КоличествоГрузов КАК КоличествоГрузов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втОтмененныеЗадания.КоличествоОтменена, 0) = ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0)
		|				И ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Отменено,
		|	ЛОЖЬ КАК СтрокаДокумента,
		|	1 КАК Порядок,
		|	упРейсЗадания.НомерСтроки КАК НомерСтроки,
		|	ЛОЖЬ КАК ФлагРаспределения,
		|	втОтмененныеЗадания.Проблема КАК Проблема
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	Документ.упРейс.Задания КАК упРейсЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ втОтмененныеЗадания КАК втОтмененныеЗадания
		|	ПО ИСТИНА
		|		И упРейсЗадания.Задание = втОтмененныеЗадания.Задание
		|		И упРейсЗадания.ГрузовоеМесто = втОтмененныеЗадания.ГрузовоеМесто
		|ГДЕ упРейсЗадания.Ссылка = &Рейс
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	упКорректировкаРейсаЗадания.Задание КАК Задание,
		|	упКорректировкаРейсаЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
		|	упКорректировкаРейсаЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	упКорректировкаРейсаЗадания.Тара КАК Тара,
		|	упКорректировкаРейсаЗадания.КоличествоГрузов КАК КоличествоГрузов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втОтмененныеЗадания.КоличествоОтменена, 0) = ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0)
		|				И ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Отменено,
		|	ВЫБОР
		|		КОГДА упКорректировкаРейсаЗадания.Ссылка = &Ссылка
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК СтрокаДокумента,
		|	2 КАК Порядок,
		|	упКорректировкаРейсаЗадания.НомерСтроки КАК НомерСтроки,
		|	ЛОЖЬ КАК ФлагРаспределения,
		|	втОтмененныеЗадания.Проблема КАК Проблема
		|ИЗ
		|	Документ.упКорректировкаРейса.Задания КАК упКорректировкаРейсаЗадания
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРегистраторы КАК втРегистраторы
		|	ПО упКорректировкаРейсаЗадания.Ссылка = втРегистраторы.Регистратор
		|	ЛЕВОЕ СОЕДИНЕНИЕ втОтмененныеЗадания КАК втОтмененныеЗадания
		|	ПО ИСТИНА
		|		И упКорректировкаРейсаЗадания.Задание = втОтмененныеЗадания.Задание
		|		И упКорректировкаРейсаЗадания.ГрузовоеМесто = втОтмененныеЗадания.ГрузовоеМесто
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	упКорректировкаРейсаЗадания.Задание КАК Задание,
		|	упКорректировкаРейсаЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
		|	упКорректировкаРейсаЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	упКорректировкаРейсаЗадания.Тара КАК Тара,
		|	упКорректировкаРейсаЗадания.КоличествоГрузов КАК КоличествоГрузов,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(втОтмененныеЗадания.КоличествоОтменена, 0) = ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0)
		|				И ЕСТЬNULL(втОтмененныеЗадания.КоличествоОпераций, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Отменено,
		|	ИСТИНА КАК СтрокаДокумента,
		|	3 КАК Порядок,
		|	упКорректировкаРейсаЗадания.НомерСтроки КАК НомерСтроки,
		|	ИСТИНА КАК ФлагРаспределения,
		|	втОтмененныеЗадания.Проблема КАК Проблема
		|ИЗ
		|	Документ.упКорректировкаРейса.Задания КАК упКорректировкаРейсаЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ втОтмененныеЗадания КАК втОтмененныеЗадания
		|	ПО ИСТИНА
		|		И упКорректировкаРейсаЗадания.Задание = втОтмененныеЗадания.Задание
		|		И упКорректировкаРейсаЗадания.ГрузовоеМесто = втОтмененныеЗадания.ГрузовоеМесто
		|ГДЕ ИСТИНА
		|	И упКорректировкаРейсаЗадания.Ссылка = &Ссылка
		|	И НЕ (упКорректировкаРейсаЗадания.Ссылка.Проведен)
		|;
		|//{Запрос: 17 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	упЗаявкиКВыполнению.Заявка КАК ЗаявкаНаПеревозкуГруза,
		|	упЗаявкиКВыполнению.НомерВЦепиПоставок КАК НомерВЦепиПоставок,
		|	упЗаявкиКВыполнению.НомерВЦепиПоставокКонец КАК НомерВЦепиПоставокКонец,
		|	1 КАК КоличествоЗвеньев
		|ПОМЕСТИТЬ втЗвеньяПоставок
		|ИЗ
		|	втЗадания КАК втЗадания
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.упЗаявкиКВыполнению КАК упЗаявкиКВыполнению
		|	ПО втЗадания.ЗаявкаНаПеревозкуГруза = упЗаявкиКВыполнению.Заявка
		|;
		|//{Запрос: 18 ////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	втЗадания.Задание КАК Задание,
		|	ВЫБОР
		|		КОГДА втЗвеньяПоставокПервоеЗвено.ЗаявкаНаПеревозкуГруза ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПервоеЗвено,
		|	ВЫБОР
		|		КОГДА втЗвеньяПоставокКоличествоЗвеньев.КоличествоЗвеньев > 1
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоМультимодальнаяПеревозка,
		|	ВЫБОР
		|		КОГДА втЗвеньяПоставокПоследнееЗвено.ЗаявкаНаПеревозкуГруза ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоПоследнееЗвено
		|ПОМЕСТИТЬ втПризнакиМультимодальнойПеревозки
		|ИЗ
		|	втЗадания КАК втЗадания
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГруза
		|	ПО втЗадания.Задание = упЗаданиеНаПеревозкуГруза.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ втЗвеньяПоставок КАК втЗвеньяПоставокПервоеЗвено
		|	ПО ИСТИНА
		|		И упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза = втЗвеньяПоставокПервоеЗвено.ЗаявкаНаПеревозкуГруза
		|		И упЗаданиеНаПеревозкуГруза.НомерВЦепиПоставок = втЗвеньяПоставокПервоеЗвено.НомерВЦепиПоставокКонец
		|	ЛЕВОЕ СОЕДИНЕНИЕ втЗвеньяПоставок КАК втЗвеньяПоставокПоследнееЗвено
		|	ПО ИСТИНА
		|		И упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза = втЗвеньяПоставокПоследнееЗвено.ЗаявкаНаПеревозкуГруза
		|		И упЗаданиеНаПеревозкуГруза.НомерВЦепиПоставокКонец = втЗвеньяПоставокПоследнееЗвено.НомерВЦепиПоставок
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		втЗвеньяПоставок.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза,
		|		СУММА(втЗвеньяПоставок.КоличествоЗвеньев) КАК КоличествоЗвеньев
		|	ИЗ
		|		втЗвеньяПоставок КАК втЗвеньяПоставок
		|	СГРУППИРОВАТЬ ПО
		|		втЗвеньяПоставок.ЗаявкаНаПеревозкуГруза) КАК втЗвеньяПоставокКоличествоЗвеньев
		|	ПО упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза = втЗвеньяПоставокКоличествоЗвеньев.ЗаявкаНаПеревозкуГруза
		|
		|;
		|//{Запрос: 19 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Задание КАК Задание,
		|	втЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	втЗадания.Тара КАК Тара,
		|	СУММА(втЗадания.КоличествоГрузов) КАК КоличествоГрузов,
		|	втЗадания.Отменено КАК Отменено,
		|	втЗадания.СтрокаДокумента КАК СтрокаДокумента,
		|	МАКСИМУМ(втЗадания.Порядок) КАК Порядок,
		|	МАКСИМУМ(втЗадания.НомерСтроки) КАК НомерСтроки,
		|	втЗадания.ФлагРаспределения КАК ФлагРаспределения,
		|	втЗадания.Проблема КАК Проблема,
		|	ЕСТЬNULL(втПризнакиМультимодальнойПеревозки.ЭтоПервоеЗвено, ЛОЖЬ) КАК ЭтоПервоеЗвено,
		|	ЕСТЬNULL(втПризнакиМультимодальнойПеревозки.ЭтоМультимодальнаяПеревозка, ЛОЖЬ) КАК ЭтоМультимодальнаяПеревозка,
		|	ЕСТЬNULL(втПризнакиМультимодальнойПеревозки.ЭтоПоследнееЗвено, ЛОЖЬ) КАК ЭтоПоследнееЗвено
		|ИЗ
		|	втЗадания КАК втЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ втПризнакиМультимодальнойПеревозки КАК втПризнакиМультимодальнойПеревозки
		|	ПО втЗадания.Задание = втПризнакиМультимодальнойПеревозки.Задание
		|СГРУППИРОВАТЬ ПО
		|	втЗадания.Задание,
		|	втЗадания.ГрузовоеМесто,
		|	втЗадания.Тара,
		|	втЗадания.Отменено,
		|	втЗадания.СтрокаДокумента,
		|	втЗадания.ФлагРаспределения,
		|	втЗадания.Проблема,
		|	ЕСТЬNULL(втПризнакиМультимодальнойПеревозки.ЭтоПервоеЗвено, ЛОЖЬ),
		|	ЕСТЬNULL(втПризнакиМультимодальнойПеревозки.ЭтоМультимодальнаяПеревозка, ЛОЖЬ),
		|	ЕСТЬNULL(втПризнакиМультимодальнойПеревозки.ЭтоПоследнееЗвено, ЛОЖЬ)
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	НомерСтроки
		|;
		|//{Запрос: 20 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упПлановыеПараметрыРейса.ПлановоеНачалоВыполнения КАК ПлановоеНачалоВыполнения,
		|	упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполнения КАК ПлановоеОкончаниеВыполнения,
		|	упПлановыеПараметрыРейса.ЗонаПогрузки КАК ЗонаПогрузки,
		|	упПлановыеПараметрыРейса.ЗонаРазгрузки КАК ЗонаРазгрузки,
		|	упПлановыеПараметрыРейса.ПлановоеОкончаниеВыполненияИсходное КАК ПлановоеОкончаниеВыполненияИсходное
		|ИЗ
		|	РегистрСведений.упПлановыеПараметрыРейса КАК упПлановыеПараметрыРейса
		|ГДЕ упПлановыеПараметрыРейса.Рейс = &Рейс
		|;
		|//{Запрос: 21 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМаршрутПослеКорректировки.Адрес КАК Адрес,
		|	втРаботыПослеКорректировки.Задание КАК Задание,
		|	втРаботыПослеКорректировки.ГрузовоеМесто КАК ГрузовоеМесто,
		|	втРаботыПослеКорректировки.Тара КАК Тара
		|ИЗ
		|	втМаршрутПослеКорректировки КАК втМаршрутПослеКорректировки
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРаботыПослеКорректировки КАК втРаботыПослеКорректировки
		|	ПО втМаршрутПослеКорректировки.Идентификатор = втРаботыПослеКорректировки.Идентификатор
		|ГДЕ ЛОЖЬ
		|	ИЛИ втРаботыПослеКорректировки.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
		|	ИЛИ втРаботыПослеКорректировки.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ВыемкаЦенностей)
		|;
		|//{Запрос: 22 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упПеревозчикПоРейсуСрезПоследних.Период КАК Период,
		|	упПеревозчикПоРейсуСрезПоследних.Регистратор КАК Регистратор,
		|	упПеревозчикПоРейсуСрезПоследних.Рейс КАК Рейс,
		|	упПеревозчикПоРейсуСрезПоследних.Перевозчик КАК Перевозчик,
		|	упПеревозчикПоРейсуСрезПоследних.Соглашение КАК Соглашение,
		|	упПеревозчикПоРейсуСрезПоследних.КонтрагентПеревозчика КАК КонтрагентПеревозчика,
		|	упПеревозчикПоРейсуСрезПоследних.ТипТС КАК ТипТС,
		|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	упПеревозчикПоРейсуСрезПоследних.Водитель1 КАК Водитель1,
		|	упПеревозчикПоРейсуСрезПоследних.Водитель2 КАК Водитель2,
		|	упПеревозчикПоРейсуСрезПоследних.Экспедитор КАК Экспедитор
		|ИЗ
		|	РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(
		|		&ПериодИсключая,
		|		Рейс = &Рейс) КАК упПеревозчикПоРейсуСрезПоследних
		|;
		|//{Запрос: 23 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упПеревозчикПоРейсуСрезПоследних.Период КАК Период,
		|	упПеревозчикПоРейсуСрезПоследних.Регистратор КАК Регистратор,
		|	упПеревозчикПоРейсуСрезПоследних.Рейс КАК Рейс,
		|	упПеревозчикПоРейсуСрезПоследних.Перевозчик КАК Перевозчик,
		|	упПеревозчикПоРейсуСрезПоследних.Соглашение КАК Соглашение,
		|	упПеревозчикПоРейсуСрезПоследних.КонтрагентПеревозчика КАК КонтрагентПеревозчика,
		|	упПеревозчикПоРейсуСрезПоследних.ТипТС КАК ТипТС,
		|	упПеревозчикПоРейсуСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство,
		|	упПеревозчикПоРейсуСрезПоследних.Водитель1 КАК Водитель1,
		|	упПеревозчикПоРейсуСрезПоследних.Водитель2 КАК Водитель2,
		|	упПеревозчикПоРейсуСрезПоследних.Экспедитор КАК Экспедитор
		|ИЗ
		|	РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(
		|		&ПериодВключая,
		|		Рейс = &Рейс) КАК упПеревозчикПоРейсуСрезПоследних
		|;
		|//{Запрос: 24 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упПланПоЗаданиямСрезПоследних.Задание КАК Задание,
		|	упПланПоЗаданиямСрезПоследних.ГрузовоеМесто КАК ГрузовоеМесто,
		|	упПланПоЗаданиямСрезПоследних.Местоположение КАК Местоположение,
		|	упПланПоЗаданиямСрезПоследних.Выполнено КАК Выполнено,
		|	упПланПоЗаданиямСрезПоследних.Количество КАК Количество,
		|	упПланПоЗаданиямСрезПоследних.Отменено КАК Отменено,
		|	упПланПоЗаданиямСрезПоследних.ПричинаОтмены КАК ПричинаОтмены
		|ИЗ
		|	РегистрСведений.упПланПоЗаданиям.СрезПоследних(
		|		&ПериодИсключая,
		|		(Задание, ВЫБОР
		|				КОГДА &ПустыеГрузовыеМеста
		|					ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|				ИНАЧЕ ГрузовоеМесто
		|			КОНЕЦ) В (
		|				ВЫБРАТЬ
		|				втЗадания.Задание КАК Задание,
		|				втЗадания.ГрузовоеМесто КАК ГрузовоеМесто
		|			ИЗ
		|				втЗадания КАК втЗадания)) КАК упПланПоЗаданиямСрезПоследних
		|;
		|//{Запрос: 25 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упСтатусыРейсовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.упСтатусыРейсов.СрезПоследних(
		|		&ПериодИсключая,
		|		Документ = &Рейс) КАК упСтатусыРейсовСрезПоследних
		|";

				
		текПериодВключая = Новый Граница(Новый МоментВремени(Период, Ссылка), ВидГраницы.Включая);
		текПериодИсключая = Новый Граница(Новый МоментВремени(Период, Ссылка), ВидГраницы.Исключая);
				
		ПустыеГрузовыеМеста = ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса;					   
		Запрос.УстановитьПараметр("ПериодВключая", текПериодВключая);
		Запрос.УстановитьПараметр("ПериодИсключая", текПериодИсключая);
		Запрос.УстановитьПараметр("Рейс", Рейс);			
		Запрос.УстановитьПараметр("ПустыеГрузовыеМеста", ПустыеГрузовыеМеста);					   					   
		Запрос.УстановитьПараметр("Ссылка", Ссылка);			
		Запрос.УстановитьПараметр("ВидПеревозки", ВидПеревозки);
				
		мсвРезультат = Запрос.ВыполнитьПакет();
		ИндексЗапросаМаршрутДоКорректировки = 10;
		ИндексЗапросаРаботыДоКорректировки = 11;
		ИндексЗапросаМаршрут = 14;
		ИндексЗапросаРаботы = 15;
		ИндексЗапросаЗадания = 19;
		ИндексЗапросаПлановыеПараметры = 20;
		ИндексЗапросаАдресаПогрузки = 21;
		ИндексЗапросаПеревозчикДоКорректировки = 22;
		ИндексЗапросаПеревозчик = 23;
		ИндексЗапросаПланПоЗаданиям = 24;
		ИндексЗапросаСтатусРейсаДоКорректировки	= 25;
			
		МаршрутДоКорректировки.Загрузить(мсвРезультат[ИндексЗапросаМаршрутДоКорректировки].Выгрузить());
		
		Маршрут.Загрузить(мсвРезультат[ИндексЗапросаМаршрут].Выгрузить());
		Задания.Загрузить(мсвРезультат[ИндексЗапросаЗадания].Выгрузить());
		АдресаПогрузкиПоРейсу.Загрузить(мсвРезультат[ИндексЗапросаАдресаПогрузки].Выгрузить());
		ЕстьОтложенныеРаботы = Ложь;
		Для каждого ТочкаМаршрута Из Маршрут Цикл
			ЕстьОтложенныеРаботы = ЕстьОтложенныеРаботы Или ТочкаМаршрута.Отложена; 
			ЗаполнитьПоляПредставленийСтрокиМаршрута(ТочкаМаршрута);
		КонецЦикла;
		РаботыДоКорректировки.Загрузить(мсвРезультат[ИндексЗапросаРаботыДоКорректировки].Выгрузить());
		Работы.Загрузить(мсвРезультат[ИндексЗапросаРаботы].Выгрузить());
		Для каждого Работа Из Работы Цикл
			ЗаполнитьПоляПредставленийСтрокиРабот(Работа);
		КонецЦикла;
		ВыборкаПлановыеПараметры = мсвРезультат[ИндексЗапросаПлановыеПараметры].Выбрать();
		Если ВыборкаПлановыеПараметры.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаПлановыеПараметры);
		КонецЕсли;
		УчитыватьМассу = ПолучитьФункциональнуюОпцию("упУчитыватьМассу");
		УчитыватьОбъем = ПолучитьФункциональнуюОпцию("упУчитыватьОбъем");
		УчитыватьКоличествоМест = ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоМест");
		УчитыватьКоличествоЗагрузочныхМетров = ПолучитьФункциональнуюОпцию("упУчитыватьКоличествоЗагрузочныхМетров");
		
		сткПеревозчикПоРейсуДоКорректировки = Новый Структура();
		ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, мсвРезультат[ИндексЗапросаПеревозчикДоКорректировки], сткПеревозчикПоРейсуДоКорректировки);
		
		сткПеревозчикПоРейсу = Новый Структура();
		ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, мсвРезультат[ИндексЗапросаПеревозчик], сткПеревозчикПоРейсу);
		
		ПланПоЗаданиямДоКорректировки.Загрузить(мсвРезультат[ИндексЗапросаПланПоЗаданиям].Выгрузить());
		
		ВыборкаСтатусРейсаДоКорректировки = мсвРезультат[ИндексЗапросаСтатусРейсаДоКорректировки].Выбрать();
		Если ВыборкаСтатусРейсаДоКорректировки.Следующий() Тогда
			СтатусРейсаДоКорректировки = ВыборкаСтатусРейсаДоКорректировки.Статус;
		КонецЕсли;
			
	КонецЕсли;
	
	Если ЗаполнитьВспомогательныеПоляЗаданий Тогда
		ЗаполнитьВспомогательныеПоляЗаданийНаСервере();
	КонецЕсли;
	
	Если ЗаполнитьПредставлениеМаршрута Тогда
		УстановитьПредставлениеМаршурта();
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗаполнитьРеквизитыОбъекта(ОбъектТекущий, РезультатЗапроса, сткЗначенияРеквизитов = Неопределено)
	
	Если сткЗначенияРеквизитов = Неопределено Тогда
		сткЗначенияРеквизитов = Новый Структура();	
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			сткЗначенияРеквизитов.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(ОбъектТекущий, сткЗначенияРеквизитов);

КонецПроцедуры

// Процедура - обновляет реквизиты текущего объекта.
//
// Параметры:
//  сткРеквизитыЗаполнения	 - Структура	 - значения реквизитов объекта
//
Процедура ОбновитьДанныеКорректировки(сткРеквизитыЗаполнения) Экспорт
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, сткРеквизитыЗаполнения);		
КонецПроцедуры

// Процедура - распределят выбранные задания по точкам.
//
// Параметры:
//  Отказ	 - Булево	 - Истина, если произошла ошибка.
//
Процедура РаспределитьЗаданияПоТочкам(Отказ) Экспорт
	Для каждого Строка Из Задания Цикл
		Если НЕ Строка.ФлагРаспределения Тогда
			Продолжить;
		КонецЕсли;
		Если ФормироватьПоГрузовымМестам И НЕ ЗначениеЗаполнено(Строка.ГрузовоеМесто) Тогда
			ТекстСообщения = Нстр("ru = 'В строке %1 не заполнено грузовое место. Распределение по ней не выполнено'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Задания", Задания.Индекс(Строка) + 1, "ГрузовоеМесто"));	
			Продолжить;
		КонецЕсли;
		РаспределитьСтрокуЗадания(Строка.НомерСтроки,Отказ);
	КонецЦикла;		
КонецПроцедуры

// Процедура - распределят выбранные задания по непройденным точкам.
//
// Параметры:
//  Отказ	 - Булево	 - Истина, если произошла ошибка.
//
Процедура РаспределитьЗаданияПоНепройденнымТочкам(Отказ) Экспорт
	Для каждого Строка Из Задания Цикл
		Если НЕ Строка.ФлагРаспределения Тогда
			Продолжить;
		КонецЕсли;
		Если ФормироватьПоГрузовымМестам И НЕ ЗначениеЗаполнено(Строка.ГрузовоеМесто) Тогда
			ТекстСообщения = Нстр("ru = 'В строке %1 не заполнено грузовое место. Распределение по ней не выполнено'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Задания", Задания.Индекс(Строка) + 1, "ГрузовоеМесто"));	
			Продолжить;
		КонецЕсли;
		РаспределитьСтрокуЗадания(Строка.НомерСтроки,Отказ, Истина);
	КонецЦикла;		
КонецПроцедуры

// Процедура - Добавляет в список еще не обработанные задания.
//
// Параметры:
//  мсвЗаданияНаПеревозкуГруза - Массив	 - массив заданий.
//
Процедура ДобавитьЗадания(мсвЗаданияНаПеревозкуГруза) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тбЗадания.ГрузовоеМесто,
	|	тбЗадания.Тара,
	|	тбЗадания.КоличествоГрузов,
	|	тбЗадания.Задание
	|ПОМЕСТИТЬ втЗадания
	|ИЗ
	|	&тчЗадания КАК тбЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тбЗадания.Задание,
	|	тбЗадания.ГрузовоеМесто,
	|	тбЗадания.Тара,
	|	СУММА(тбЗадания.КоличествоГрузов) КАК КоличествоГрузов
	|ИЗ
	|	(ВЫБРАТЬ
	|		упЗаданияКПланированиюОстатки.Задание КАК Задание,
	|		упЗаданияКПланированиюОстатки.ГрузовоеМесто КАК ГрузовоеМесто,
	|		упЗаданияКПланированиюОстатки.Тара КАК Тара,
	|		упЗаданияКПланированиюОстатки.КоличествоКПланированиюОстаток КАК КоличествоГрузов
	|	ИЗ
	|		РегистрНакопления.упЗаданияКПланированию.Остатки(, Задание В (&Задания)) КАК упЗаданияКПланированиюОстатки
	|	ГДЕ
	|		упЗаданияКПланированиюОстатки.КоличествоКПланированиюОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		втЗадания.Задание,
	|		втЗадания.ГрузовоеМесто,
	|		втЗадания.Тара,
	|		-втЗадания.КоличествоГрузов
	|	ИЗ
	|		втЗадания КАК втЗадания) КАК тбЗадания
	|
	|СГРУППИРОВАТЬ ПО
	|	тбЗадания.Задание,
	|	тбЗадания.ГрузовоеМесто,
	|	тбЗадания.Тара
	|
	|ИМЕЮЩИЕ
	|	СУММА(тбЗадания.КоличествоГрузов) > 0";
	
	Запрос.УстановитьПараметр("Задания", мсвЗаданияНаПеревозкуГруза);
	Запрос.УстановитьПараметр("тчЗадания", Задания.Выгрузить());
	текВыборка	= Запрос.Выполнить().Выбрать();
	Пока текВыборка.Следующий() Цикл
		НоваяСтрока = Задания.Добавить();
		НоваяСтрока.СтрокаДокумента		= Истина;
		НоваяСтрока.ФлагРаспределения	= Истина;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, текВыборка);
	КонецЦикла;
	
	ЗаполнитьВспомогательныеПоляЗаданийНаСервере();
	
КонецПроцедуры

// Процедура - Очищает списки заданий и связанные с ним точки маршрута и работы.
//
Процедура ОчиститьЗаданияВРейсе() Экспорт
	
	// Удаляются точки по заданиям. Просто очищать маршрут нельзя, 
	// потому что там могут быть точки без работ.
	// Например, выезд из гаража или возвращение.
	мсвТочкиМаршрута = Маршрут.НайтиСтроки(Новый Структура("ТипТочки", Перечисления.упТипыТочекМаршрута.ТочкаПоЗаданию));
	Для каждого ТочкаМаршрута Из мсвТочкиМаршрута Цикл
		Маршрут.Удалить(ТочкаМаршрута);
	КонецЦикла;
	
	//МаршрутДоКорректировки.Загрузить(Маршрут.Выгрузить());
	Задания.Очистить();
	Работы.Очистить();
	//РаботыДоКорректировки.Очистить();
	АдресаПогрузкиПоРейсу.Очистить();
	ПланПоЗаданиям.Очистить();
	//ПланПоЗаданиямДоКорректировки.Очистить();
	
КонецПроцедуры

// Функция - Вид перевозки заданий
// 
// Возвращаемое значение:
//  СправочникСсылка.упВидыПеревозок -  вид перевозки.
//
Функция ВидПеревозкиПоЗаданиям() Экспорт
	
	Результат = Справочники.упВидыПеревозок.ПустаяСсылка();
	
	Если Задания.Количество() > 0 Тогда
		Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задания[0].Задание, "ВидПеревозки");
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

// Функция - Необходимо добавить зависимые грузовые места
// 
// Возвращаемое значение:
//  Булево 
//
Процедура ЗаполнитьНедобавленныеСвязанныеГрузовыеМеста() Экспорт
	тбзЗадания	= Задания.Выгрузить(Новый Структура("ФлагРаспределения", Истина),"Задание, ГрузовоеМесто, КоличествоГрузов");
	тбзЗадания.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.упРейс"));
	тбзЗадания.ЗаполнитьЗначения(Рейс, "Ссылка");
	
	тбзЗависимыеГрузовыеМеста = упРейс.СписокНедостающихСвязанныхГрузовыхМестПоЗаданиямВРейсе(тбзЗадания, Рейс); 
	Если Ложь
		Или ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса 
		Или ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится
	Тогда
		тбзЗависимыеГрузовыеМеста.ЗаполнитьЗначения(Неопределено, "ГрузовоеМесто");
		тбзЗависимыеГрузовыеМеста.Свернуть("Задание, ГрузовоеМесто", "КоличествоГрузов");
		тбзЗависимыеГрузовыеМеста.ЗаполнитьЗначения(1, "КоличествоГрузов");
	КонецЕсли; 
	НеДобавленныеСвязанныеГрузовыеМеста.Загрузить(тбзЗависимыеГрузовыеМеста);	
КонецПроцедуры

// Функция - Заполнить корректировку заданиями
//
// Параметры:
//  ВыбранныеЗадания		 - Массив	 - задания.
//  ЛучшаяПозицияПогрузки	 - Число	 - позиция погрузки.
//  ЛучшаяПозицияРазгрузки	 - Число	 - позиция разгрузки.
// 
// Возвращаемое значение:
//  Массив - массив строк.
//
Функция ЗаполнитьКорректировкуЗаданиями(Знач ВыбранныеЗадания, Знач ЛучшаяПозицияПогрузки, Знач ЛучшаяПозицияРазгрузки) Экспорт 
	
	ДобавитьЗадания(ВыбранныеЗадания);
	Отказ = Ложь;
	РаспределитьЗаданияПоНепройденнымТочкам(Отказ);
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли; 
	Для Каждого ВыбранноеЗадание Из ВыбранныеЗадания Цикл
		СтрокиРабот = Работы.НайтиСтроки(Новый Структура("Задание", ВыбранноеЗадание));
		СтрокаПогрузки = Неопределено;
		Для Каждого СтрокаРабот Из СтрокиРабот Цикл
			Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(СтрокаРабот.Операция) Тогда
				СтрокаПогрузки = Маршрут.Найти(СтрокаРабот.Идентификатор, "Идентификатор");
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		СдвинутьСтрокуМаршрута(ЛучшаяПозицияПогрузки, Отказ, СтрокаПогрузки);
	КонецЦикла;
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Каждого ВыбранноеЗадание Из ВыбранныеЗадания Цикл
		СтрокиРабот = Работы.НайтиСтроки(Новый Структура("Задание", ВыбранноеЗадание));
		СтрокаРазгрузки = Неопределено;
		Для Каждого СтрокаРабот Из СтрокиРабот Цикл
			Если упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(СтрокаРабот.Операция) Тогда
				СтрокаРазгрузки = Маршрут.Найти(СтрокаРабот.Идентификатор, "Идентификатор");
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		СдвинутьСтрокуМаршрута(ЛучшаяПозицияРазгрузки, Отказ, СтрокаРазгрузки, 1);
	КонецЦикла;
	Если Отказ Тогда
		Возврат Ложь;
	КонецЕсли; 
	Результат = Маршрут.НайтиСтроки(Новый Структура("ПопадаетВоВременноеОкно", Ложь)).Количество() <= МаршрутДоКорректировки.НайтиСтроки(Новый Структура("ПопадаетВоВременноеОкно", Ложь)).Количество();
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область Документ_Корректировка_ФормированиеДвижений

// Процедура - подготавливает таблицу движений корректировок.
//
Процедура СформироватьТаблицыДвиженийДляКорректировки(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Перезаполняются табличные части "маршрут" и "работы". 
	ИнициализацияМаршрутаИРаботПоРейсу(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
	
	ЭтоКорректировка = (ТипЗнч(Ссылка) = Тип("ДокументСсылка.упКорректировкаРейса"));
	
	тбзПрерыванияГрузовыхПотоков = ПолучитьСтруктуруТаблицыПрерыванияГрузовыхПотоков();
	ДополнительныеСвойства.Вставить("ПрерыванияГрузовыхПотоков", тбзПрерыванияГрузовыхПотоков);
	
	ДополнительныеСвойства.Вставить("СпособУчетаВозвращенныхДокументов", СпособУчетаВозвращенныхДокументов);
	ДополнительныеСвойства.Вставить("ФормироватьПоГрузовымМестам", ФормироватьПоГрузовымМестам);
	
	ЭтоРаботаСКонтейнером = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоРаботаСКонтейнером", Ложь);
	
	Если Не ЭтоРаботаСКонтейнером Тогда
		ЗаполнитьПараметрыПеревозки(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
		ФормированиеГрузовыхМестИДвиженийПриРазделенииГрузовыхМест(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
	КонецЕсли;
		
	ЗаполнениеМаршрутаИРаботПоРейсу(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
	
	сткКонтролируемыеПоля = ПолучитьСпискиПолейДляСравнения();
	
	тбзМаршрут = МаршрутДоКорректировки.ВыгрузитьКолонки();
	мсвКонтролируемыеПоляМассива = сткКонтролируемыеПоля.Маршрут;
	мсвСостояниеПоЗаданиям = сткКонтролируемыеПоля.СостояниеПоЗаданиям;
	мсвНепереданныеДокументы = сткКонтролируемыеПоля.СостояниеПоЗаданиям;
	
	ВариантМаршрутаСамовывоз = ВариантФормированияМаршрута = ПредопределенноеЗначение("Перечисление.упВариантыФормированияМаршрута.Самовывоз"); 

	стрСписокПолей = СтрСоединить(мсвКонтролируемыеПоляМассива, ",");
	
	ИдентификаторТочки = Неопределено;
	
	соотАдресаТочек = Новый Соответствие;
	
	Если ЭтоКорректировка Тогда
		// Корректировкой могли изменить данные о транспортном средстве, 
		// что могло повлечь за собой изменение точек отправления и/или получения.
		Если МаршрутДоКорректировки.Количество() И Маршрут.Количество() Тогда
			ПерваяТочкаМаршрутаДоКорректировки = МаршрутДоКорректировки[0];
			ПерваяТочкаМаршрута = Маршрут[0];
			Если ПерваяТочкаМаршрутаДоКорректировки.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаОтправления Тогда
				Если ПерваяТочкаМаршрута.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаОтправления Тогда
					Если ПерваяТочкаМаршрута.Идентификатор <> ПерваяТочкаМаршрутаДоКорректировки.Идентификатор Тогда // изменили выезд из гаража
						ПерваяТочкаМаршрута.Идентификатор = ПерваяТочкаМаршрутаДоКорректировки.Идентификатор;
					КонецЕсли; 
				Иначе // выезд из гаража удален
					НоваяТочка = Маршрут.Вставить(0);
					ЗаполнитьЗначенияСвойств(НоваяТочка, ПерваяТочкаМаршрутаДоКорректировки);
					НоваяТочка.Отменена = Истина;
				КонецЕсли; 
			КонецЕсли;
			
			ПоследняяТочкаМаршрутаДоКорректировки = МаршрутДоКорректировки[МаршрутДоКорректировки.Количество() - 1];
			ПоследняяТочкаМаршрута = Маршрут[Маршрут.Количество() - 1];
			Если ПоследняяТочкаМаршрутаДоКорректировки.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаЗавершения Тогда
				Если ПоследняяТочкаМаршрута.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаЗавершения Тогда
					Если ПоследняяТочкаМаршрута.Идентификатор <> ПоследняяТочкаМаршрутаДоКорректировки.Идентификатор Тогда // изменили выезд из гаража
						ПоследняяТочкаМаршрута.Идентификатор = ПоследняяТочкаМаршрутаДоКорректировки.Идентификатор;
					КонецЕсли; 
				Иначе // возвращение в гараж удалено
					НоваяТочка = Маршрут.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяТочка, ПоследняяТочкаМаршрутаДоКорректировки);
					НоваяТочка.Отменена = Истина;
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Формируется таблица изменений для маршрута
	Для каждого Строка Из Маршрут Цикл
		
		соотАдресаТочек.Вставить(Строка.Идентификатор, Новый Структура("Адрес, СтрокаНомер",Строка.Адрес, Строка.СтрокаНомер));
		
		ЕстьИзменения = Ложь;
		
		НоваяСтрока = Неопределено;
		
		мсвСтрокиМаршрутаДоКорректировки = МаршрутДоКорректировки.НайтиСтроки(Новый Структура("Идентификатор", Строка.Идентификатор));
		
		Если мсвСтрокиМаршрутаДоКорректировки.Количество() = 0 Тогда
			НоваяСтрока = тбзМаршрут.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Иначе
			
			СтрокаДоКорректировки = мсвСтрокиМаршрутаДоКорректировки[0];
			
			Для каждого Поле Из мсвКонтролируемыеПоляМассива Цикл
				Если Поле = "Предшественники" Тогда
					ЕстьИзменения = НЕ ПредшественникиСовпадают(Строка[Поле],СтрокаДоКорректировки[Поле]);
				Иначе	
					ЕстьИзменения = НЕ Строка[Поле] = СтрокаДоКорректировки[Поле];	
				КонецЕсли;
				Если ЕстьИзменения Тогда
					НоваяСтрока = тбзМаршрут.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоКорректировки);	
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, стрСписокПолей);	
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если НЕ НоваяСтрока = Неопределено Тогда
			мсвСтрокиРаботПоТочке = Работы.НайтиСтроки(Новый Структура("Идентификатор",НоваяСтрока.Идентификатор));
			Если мсвСтрокиРаботПоТочке.Количество() > 0 Тогда
				текПлановоеВремяНачалаРабот =  мсвСтрокиРаботПоТочке[0].ПлановоеВремяНачалаРабот;	
				Для каждого текРабота Из мсвСтрокиРаботПоТочке Цикл
					Если текРабота.ПлановоеВремяНачалаРабот < текПлановоеВремяНачалаРабот Тогда
						текПлановоеВремяНачалаРабот = текРабота.ПлановоеВремяНачалаРабот;
					КонецЕсли;
				КонецЦикла;
			Иначе
				текПлановоеВремяНачалаРабот = НоваяСтрока.ПлановоеПрибытие;
			КонецЕсли;
			НоваяСтрока.НачалоРаботПлан = текПлановоеВремяНачалаРабот;
		КонецЕсли;
		
		ИдентификаторТочки = Строка.Идентификатор;
		
	КонецЦикла; 	
	
	ДополнительныеСвойства.Вставить("ИдентификаторТочки", ИдентификаторТочки);
	ДополнительныеСвойства.Вставить("Маршрут", тбзМаршрут);
	ДополнительныеСвойства.Вставить("МаршрутПолный", Маршрут.Выгрузить());
	
	сткСтатусыСтроки = СтатусыСтрок();
	
	тбзЗадания = Неопределено;
	Если НЕ ДополнительныеСвойства.Свойство("Задания", тбзЗадания) Тогда
		тбзЗадания = ПолучитьСтруктуруТаблицыЗадания();	
	КонецЕсли;
	
	тбзЗаявки = ПолучитьСтруктуруТаблицыЗаявки();
	тбзОтмененныеЗадания = ПолучитьСтруктуруТаблицыОтмененныеЗадания();
	тбзСостояниеЗаданий = ПолучитьСтруктуруТаблицыСостоянияЗаданиям();
	тбзОстаткиГрузовыхМест = ПолучитьСтруктуруТаблицыОстаткиГрузовыхМест();
	тбзНепереданныеДокументы = ПолучитьСтруктуруТаблицыНепереданныеДокументы();
	тбзИнкассацияДенежныхСредств = ПолучитьСтруктуруТаблицыИнкассацияДенежныхСредств();  
	тбзСтатистикаПоРаботам = Неопределено;
	мсвЗаданияПоРегистратору	= Неопределено;
	Если Ложь
		Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса 
		Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса
	Тогда
		тбзСтатистикаПоРаботам = ПолучитьСтруктуруТаблицыСтатистикаПоРаботам();
		Если Реквизиты.Свойство("Работы") Тогда
			Если ТипЗнч(Реквизиты.Работы) <> Тип("ТаблицаЗначений") Тогда
				мсвЗаданияПоРегистратору = Новый Массив;
				Для каждого Строка Из Реквизиты.Работы Цикл
					мсвЗаданияПоРегистратору.Добавить(Строка.Задание);	
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	КорректироватьРегистрНепереданныеДокумменты = ПолучитьФункциональнуюОпцию("упИспользуетсяВозвратДокументовПослеИсполненияРейса");
	ПланПоЗаданиям.Очистить();
	
	тбзРаботы = РаботыДоКорректировки.ВыгрузитьКолонки();
	мсвКонтролируемыеПоляМассива = сткКонтролируемыеПоля.Работы;
	
	стрСписокПолей = СтрСоединить(мсвКонтролируемыеПоляМассива, ",");
	
	Если ЭтоКорректировка Тогда
		Для каждого текСтрока Из Задания Цикл 
			Если текСтрока.СтрокаДокумента Тогда // Движения по РН "упЗаданияКПалнированию" для новых грузов, добавленных в рейс корректировкой
				ДобавитьСтрокуВТаблицу(тбзЗадания, текСтрока.Задание, текСтрока.ГрузовоеМесто, текСтрока.Тара, текСтрока.КоличествоГрузов, текСтрока.КоличествоГрузов, текСтрока.КоличествоГрузов, 0, ВидДвиженияНакопления.Расход);						
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;
	мсвЗаданийВернутьВПланирование = Новый Массив; // накапливаем задания, которые вернули в планирование целиком при вводе груза до начала выполнения рейса
	мсвОтмененныеГрузовыеМеста = Новый Массив; 
	КонтролироватьОстаткиГрузовыхМест = Ложь;
	
	Для каждого Строка Из Работы Цикл
		ЕстьИзменения = Ложь;
		ЕстьИзмененияВСостоянииПоЗаданиям = Ложь;
		СтрокаДоКорректировки = Неопределено;
		СтатусСтрокиПослеИзменения = СтатусСтроки(Строка, сткСтатусыСтроки); 
		СтатусСтрокиДоИзменения = Неопределено;
		ПроблемаПриОтменеДо = Неопределено;
		ПроблемаПриОтменеПосле = Строка.Проблема;
		
		// Формируется таблица работ
		Задание = Строка.Задание;
		ЗаявкаНаПеревозкуГруза = Строка.ЗаявкаНаПеревозкуГруза;
		Валюта = Строка.Валюта;
		Сумма = Строка.Сумма;
		ГрузовоеМесто = Строка.ГрузовоеМесто;
		Тара = Строка.Тара;
		СкладскаяЯчейка = Строка.СкладскаяЯчейка;
		Если Истина
			И НЕ КонтролироватьОстаткиГрузовыхМест
			И ЗначениеЗаполнено(СкладскаяЯчейка) 
		Тогда
			КонтролироватьОстаткиГрузовыхМест = Истина;
		КонецЕсли;
		
		сткДанныеПоТочке = соотАдресаТочек.Получить(Строка.Идентификатор);
		
		АдресТочки = сткДанныеПоТочке.Адрес;
		СтрокаНомер = сткДанныеПоТочке.СтрокаНомер;
		АдресТочкиДоКорректировки = Неопределено;
		КоличествоГрузов = Строка.КоличествоГрузов;
		
		ДобавитьСтрокуВТаблицуСтатистикаПоРаботам(тбзСтатистикаПоРаботам, Строка, мсвЗаданияПоРегистратору);
		
		мсвСтрокиРаботыДоКорректировки = РаботыДоКорректировки.НайтиСтроки(Новый Структура("ИдентификаторРаботы", Строка.ИдентификаторРаботы));
		Если мсвСтрокиРаботыДоКорректировки.Количество() = 0 Тогда
			ЕстьИзменения = Истина;
			ЕстьИзмененияВСостоянииПоЗаданиям = Истина;
			НоваяСтрока = тбзРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.КоличествоГрузов = КоличествоГрузов;
			
		Иначе
			СтрокаДоКорректировки = мсвСтрокиРаботыДоКорректировки[0];
			сткДанныеПоТочке = соотАдресаТочек.Получить(СтрокаДоКорректировки.Идентификатор);
			АдресТочкиДоКорректировки = сткДанныеПоТочке.Адрес;
			СтатусСтрокиДоИзменения = СтатусСтроки(СтрокаДоКорректировки, сткСтатусыСтроки);
			ПроблемаПриОтменеДо = СтрокаДоКорректировки.Проблема;
			
			Если (Строка.Выполнена И СтрокаДоКорректировки.Выполнена)
					Или (Строка.Отменена И СтрокаДоКорректировки.Отменена) Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого Поле Из мсвКонтролируемыеПоляМассива Цикл
				ЕстьИзменения 	= Строка(Строка[Поле]) <> Строка(СтрокаДоКорректировки[Поле]);
				Если ЕстьИзменения Тогда
					НоваяСтрока = тбзРаботы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоКорректировки);	
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, стрСписокПолей);	
					НоваяСтрока.КоличествоГрузов = КоличествоГрузов;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Для каждого Поле Из мсвСостояниеПоЗаданиям Цикл
				ЕстьИзмененияВСостоянииПоЗаданиям = Строка[Поле] <> СтрокаДоКорректировки[Поле];
				Если ЕстьИзмененияВСостоянииПоЗаданиям Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЕстьИзменения Тогда
			Продолжить;
		КонецЕсли; 
		
		АдресПогрузкиПоЗаданию = Неопределено;
		АдресРазгрузкиПоЗаданию = Неопределено;
		АдресПогрузкиПоЗаданиюДоКорректировки = Неопределено;
		АдресРазгрузкиПоЗаданиюДоКорректировки = Неопределено;
		НовыйАдресРазгрузкиПоЗаданию	= Неопределено; // Заполняется в случае отмены разгрузки
		
		// Учитываются только работы погрузки/разгрузки
		Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(Строка.Операция) Тогда
			
			АдресПогрузкиПоЗаданию = АдресТочки;
					
			мсвСтрокиАдресаРазгрузки = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Операция", Строка.Задание, Строка.ГрузовоеМесто, упПрохождениеТочкиКлиентСервер.ОбратнаяОперация(Строка.Операция)));
			
			Если мсвСтрокиАдресаРазгрузки.Количество() > 0 Тогда
				ИдентификаторТочкиРазгрузки = мсвСтрокиАдресаРазгрузки[0].Идентификатор;
				мсвТочкиРазгрузки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочкиРазгрузки));
				Если мсвТочкиРазгрузки.Количество() > 0 Тогда
					АдресРазгрузкиПоЗаданию = мсвТочкиРазгрузки[0].Адрес;	
				КонецЕсли;
			КонецЕсли;
			          
			Если НЕ СтрокаДоКорректировки = Неопределено Тогда
				АдресПогрузкиПоЗаданиюДоКорректировки = АдресТочкиДоКорректировки;
				
				мсвСтрокиАдресаРазгрузкиДоКорректировик = РаботыДоКорректировки.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Операция", СтрокаДоКорректировки.Задание, СтрокаДоКорректировки.ГрузовоеМесто, упПрохождениеТочкиКлиентСервер.ОбратнаяОперация(Строка.Операция)));
				
				Если мсвСтрокиАдресаРазгрузкиДоКорректировик.Количество() > 0 Тогда
					ИдентификаторТочкиРазгрузки = мсвСтрокиАдресаРазгрузкиДоКорректировик[0].Идентификатор;
					мсвТочкиРазгрузки = МаршрутДоКорректировки.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочкиРазгрузки));
					Если мсвТочкиРазгрузки.Количество() > 0 Тогда
						АдресРазгрузкиПоЗаданиюДоКорректировки = мсвТочкиРазгрузки[0].Адрес;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		
			Если СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Отменена Тогда
				
				Если Строка.ГрузРазделен Тогда
					ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);						
				Иначе
					Действие = Неопределено;
					Если ЗначениеЗаполнено(Строка.Проблема)  Тогда
						Действие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Проблема, "Действие");
						Если Действие = Перечисления.упДействияПоРаботе.ВернутьВПланирование Тогда
							Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
								мсвЗаданийВернутьВПланирование.Добавить(Задание);
							Иначе
								ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, КоличествоГрузов, КоличествоГрузов, КоличествоГрузов, 0, ВидДвиженияНакопления.Приход);						
							КонецЕсли; 
							
						ИначеЕсли упПрохождениеТочкиКлиентСервер.ДействиеОтменяющееЗадание(Действие) Тогда
							ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);						
							
							Если Действие = Перечисления.упДействияПоРаботе.ОтменитьЗадание Тогда
								ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Истина);
								ДобавитьСтрокуВТаблицуЗаявок(тбзЗаявки, Задание, ГрузовоеМесто, КоличествоГрузов);
							КонецЕсли;
						ИначеЕсли Действие = Перечисления.упДействияПоРаботе.НетДействий Тогда
							Если Строка.Проблема <> Справочники.упПроблемы.ДосрочноеПрохождение Тогда
								ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);		
							КонецЕсли;
						КонецЕсли; 						
					КонецЕсли; 
					
					Если Строка.Проблема <> Справочники.упПроблемы.ДосрочноеПрохождение Тогда
						
						Если ЗначениеЗаполнено(АдресРазгрузкиПоЗаданию) Тогда
							ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, АдресРазгрузкиПоЗаданию, Ложь, 0, Истина, Строка.Проблема, СтрокаНомер);
						КонецЕсли;
						
						ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, КоличествоГрузов, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
						Если Действие <> Перечисления.упДействияПоРаботе.ВернутьВПланирование Тогда
							ДобавитьСтрокуВТаблицуПрерыванияГрузовыхПотоков(тбзПрерыванияГрузовыхПотоков, Задание, ГрузовоеМесто, КоличествоГрузов);
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			Иначе
				ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, 0, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
				ДобавитьСтрокуВТаблицуОстаткиГрузовыхМест(тбзОстаткиГрузовыхМест, Строка.Операция, Задание, ГрузовоеМесто, Тара, СкладскаяЯчейка, КоличествоГрузов);
				
				Если Истина
					И ВариантМаршрутаСамовывоз 
					И СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Выполнена 
				Тогда
					ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
					ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, АдресТочки, Истина, КоличествоГрузов, Ложь, Справочники.упПроблемы.ПустаяСсылка(), СтрокаНомер);
					
					Если Строка.Операция = Перечисления.упТипыОпераций.ВыемкаЦенностей Тогда
						ДобавитьСтрокуВТаблицуИнкассацияДенежныхСредств(тбзИнкассацияДенежныхСредств, ЗаявкаНаПеревозкуГруза, ГрузовоеМесто, Валюта, Сумма);	
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли; 

		ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(Строка.Операция) Тогда
			
			АдресРазгрузкиПоЗаданию	= АдресТочки;
			Если НЕ СтрокаДоКорректировки = Неопределено Тогда
				АдресРазгрузкиПоЗаданиюДоКорректировки = АдресТочкиДоКорректировки;
			КонецЕсли;
			
			Если СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Выполнена Тогда	
				Если ЗначениеЗаполнено(Строка.ПроблемаПричинаВозникновенияЭтойРаботы) Тогда
					Действие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ПроблемаПричинаВозникновенияЭтойРаботы, "Действие");
					Если Действие = Перечисления.упДействияПоРаботе.ВернутьВПланирование Тогда
						Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
							мсвЗаданийВернутьВПланирование.Добавить(Задание);
						Иначе	
							ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, КоличествоГрузов, КоличествоГрузов, КоличествоГрузов, 0, ВидДвиженияНакопления.Приход);
							ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Ложь);
						КонецЕсли; 
						ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, КоличествоГрузов, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
					ИначеЕсли упПрохождениеТочкиКлиентСервер.ДействиеОтменяющееЗадание(Действие) Тогда	
						ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);
						Если Действие = Перечисления.упДействияПоРаботе.ОтменитьЗадание Тогда	
							ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Истина);
							ДобавитьСтрокуВТаблицуЗаявок(тбзЗаявки, Задание, ГрузовоеМесто, КоличествоГрузов);		
						КонецЕсли;	
						ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, КоличествоГрузов, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
					ИначеЕсли Действие = Перечисления.упДействияПоРаботе.НетДействий Тогда		
						ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
					КонецЕсли;
				Иначе
					ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
					ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Ложь);
				КонецЕсли;
				
				ПланПоЗаданиюВыполнен = Истина;
				ПланПоЗаданиюОтменен = Ложь;
				ПланПоЗаданиюПроблема = Строка.ПроблемаПричинаВозникновенияЭтойРаботы;
				Если Истина
					И ЗначениеЗаполнено(Действие) 
					И Действие <> Перечисления.упДействияПоРаботе.НетДействий
				Тогда
					ПланПоЗаданиюВыполнен = Ложь;
					ПланПоЗаданиюОтменен = Истина;
				КонецЕсли;
				ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, АдресТочки, ПланПоЗаданиюВыполнен, КоличествоГрузов, ПланПоЗаданиюОтменен, ПланПоЗаданиюПроблема, СтрокаНомер);
				
				Если Строка.Операция = Перечисления.упТипыОпераций.ПередачаЦенностей Тогда
					ДобавитьСтрокуВТаблицуИнкассацияДенежныхСредств(тбзИнкассацияДенежныхСредств, ЗаявкаНаПеревозкуГруза, ГрузовоеМесто, Валюта, Сумма);	
				КонецЕсли;
				
				ДобавитьСтрокуВТаблицуОстаткиГрузовыхМест(тбзОстаткиГрузовыхМест, Строка.Операция, Задание, ГрузовоеМесто, Тара, СкладскаяЯчейка, КоличествоГрузов);
				
			ИначеЕсли СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Отменена Тогда		
				
				Если Строка.ГрузРазделен Тогда
					мсвРаботыПогрузки = Работы.НайтиСтроки(Новый Структура("ГрузовоеМесто, Операция, Отменена", ГрузовоеМесто, Перечисления.упТипыОпераций.Погрузка, Истина));
					Если мсвРаботыПогрузки.Количество() = 0 Тогда
						ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);						
					КонецЕсли;
				Иначе	
					
					Если Строка.Проблема <> Справочники.упПроблемы.ДосрочноеПрохождение Тогда
						НовыйАдресРазгрузкиПоЗаданию = Строка.АдресРазгрузки;
						
						// Отменяется плановая разгрузка
						ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, АдресРазгрузкиПоЗаданию, Ложь, 0, Истина, Строка.Проблема, СтрокаНомер);
						
						Если ЗначениеЗаполнено(НовыйАдресРазгрузкиПоЗаданию) Тогда
							// Планируется разгрузка по новому адресу
							ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, НовыйАдресРазгрузкиПоЗаданию, Ложь, КоличествоГрузов, Ложь, Справочники.упПроблемы.ПустаяСсылка(), СтрокаНомер);	
						КонецЕсли;
						
						Действие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Проблема, "Действие");
						Если Действие <> Перечисления.упДействияПоРаботе.ВернутьВПланирование Тогда
							ДобавитьСтрокуВТаблицуПрерыванияГрузовыхПотоков(тбзПрерыванияГрузовыхПотоков, Задание, ГрузовоеМесто, КоличествоГрузов);
						КонецЕсли;	
						
						// Если не заполнен адрес разгрузки, значит работу можно просто отменять без новой работы на разгрузку,
						// иначе такая строка бы не прошла проверку.
						Если Истина
							И Не ЗначениеЗаполнено(Строка.АдресРазгрузки)
							И Строка.ЗапрещеноСозданиеНовойТочкиМаршрута
						Тогда
							Действие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Проблема, "Действие");
							Если Действие = Перечисления.упДействияПоРаботе.ВернутьВПланирование Тогда
								Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
									мсвЗаданийВернутьВПланирование.Добавить(Задание);
								Иначе	
									ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, КоличествоГрузов, КоличествоГрузов, КоличествоГрузов, 0, ВидДвиженияНакопления.Приход);
									ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Ложь);
								КонецЕсли; 
								ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, КоличествоГрузов, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
							ИначеЕсли упПрохождениеТочкиКлиентСервер.ДействиеОтменяющееЗадание(Действие) Тогда	
								ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);
								Если Действие = Перечисления.упДействияПоРаботе.ОтменитьЗадание Тогда	
									ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Истина);
									ДобавитьСтрокуВТаблицуЗаявок(тбзЗаявки, Задание, ГрузовоеМесто, КоличествоГрузов);		
								КонецЕсли;	
								ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, КоличествоГрузов, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
							ИначеЕсли Действие = Перечисления.упДействияПоРаботе.НетДействий Тогда		
								ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
												
			Иначе	
				ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Ложь);
			КонецЕсли;
			
		КонецЕсли;
			
		// Если это не новая работа в корректировке
		Если СтрокаДоКорректировки <> Неопределено Тогда
			
			Если ЕстьИзмененияВСостоянииПоЗаданиям Тогда
				// Создается обратное движение, что бы анулировать движения старой работы
				ДобавитьРаботуВТаблицуСостояниеЗаданий(тбзСостояниеЗаданий, 
														СтрокаДоКорректировки.Задание, 
														СтрокаДоКорректировки.ГрузовоеМесто, 
														ТранспортноеСредство, 
														СтрокаДоКорректировки.КоличествоГрузов, 
														СтатусСтрокиДоИзменения, 
														СтрокаДоКорректировки.Операция,
														АдресПогрузкиПоЗаданию, 
														АдресРазгрузкиПоЗаданию, 
														СтрокаДоКорректировки.АдресРазгрузки,
														СтрокаДоКорректировки.Проблема,
														сткСтатусыСтроки,
														Истина,
														СтрокаДоКорректировки.ГрузРазделен);
			КонецЕсли;
															
		КонецЕсли;
		Если ЕстьИзмененияВСостоянииПоЗаданиям Тогда

			// Для корректировки, если отменяется задание, то не надо делать расход по заданию по транспортному средству.
			// Операция отмены задания в корректировке, аналогична отмене разгрузки при прохождении, для тех операций 
			// где создавать новую точку разгрузки не надо. Поэтому для корректировки передается пустое ТС.
			// 
			ТранспортноеСредствоТекущее = ?(ЭтоКорректировка, Справочники.упТранспортныеСредства.ПустаяСсылка(), ТранспортноеСредство);

			// Создается новое движение
			ДобавитьРаботуВТаблицуСостояниеЗаданий(тбзСостояниеЗаданий, 
													Строка.Задание, 
													Строка.ГрузовоеМесто, 
													ТранспортноеСредствоТекущее, 
													Строка.КоличествоГрузов, 
													СтатусСтрокиПослеИзменения, 
													Строка.Операция,                        
													АдресПогрузкиПоЗаданию, 
													АдресРазгрузкиПоЗаданию, 
													Строка.АдресРазгрузки,
													Строка.Проблема,
													сткСтатусыСтроки,
													,
													Строка.ГрузРазделен);
		КонецЕсли;															
	КонецЦикла;
	
	Отказ = СуществуютЗаданияЧастичноОтмененныеВозвращенныеВПланирование(тбзСтатистикаПоРаботам);
	Если Отказ Тогда
		Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
			ТекстСообщения = НСтр("ru = 'Запрещено частично отменять и возвращать в планирование работы, если информация о грузовых местах вводится до начала выполнения рейса'");
		Иначе	
			ТекстСообщения = НСтр("ru = 'Запрещено частично отменять и возвращать в планирование работы, если информация о грузовых местах вводится в задании до начала планирования рейса'");	
		КонецЕсли;
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе	
		//Если ЭтоКорректировка И мсвЗаданийВернутьВПланирование.Количество() Тогда
		Если мсвЗаданийВернутьВПланирование.Количество() Тогда
			мсвЗаданийВернутьВПланирование = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвЗаданийВернутьВПланирование);
			Для каждого текЗадание Из мсвЗаданийВернутьВПланирование Цикл
				ДобавитьСтрокуВТаблицу(тбзЗадания, текЗадание, Справочники.упГрузовыеМеста.ПустаяСсылка(), Справочники.упГрузовыеМеста.ПустаяСсылка(), 1, 1, 1, 0, ВидДвиженияНакопления.Приход);
			КонецЦикла; 
		КонецЕсли; 
		
		тбзПлан = Неопределено;
		Если НЕ ДополнительныеСвойства.Свойство("ПланПоЗаданиям", тбзПлан) Тогда
			тбзПлан  = ПланПоЗаданиям.ВыгрузитьКолонки();
		КонецЕсли;
				
		мсвКонтролируемыеПоляПланПоЗаданиям = сткКонтролируемыеПоля.ПланПоЗаданиям;
		Для каждого СтрокаПлан Из ПланПоЗаданиям Цикл
			ЕстьИзменения = Ложь;
			СтрокаДоКорректировки = Неопределено;
			
			мсвСтрокиПланаДоКорректировки = ПланПоЗаданиямДоКорректировки.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Местоположение", СтрокаПлан.Задание, СтрокаПлан.ГрузовоеМесто, СтрокаПлан.Местоположение));
			Если мсвСтрокиПланаДоКорректировки.Количество() = 0 Тогда
				ЕстьИзменения = Истина;
				НоваяСтрока = тбзПлан.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлан);
			Иначе
				СтрокаДоКорректировки = мсвСтрокиПланаДоКорректировки[0];
				Для каждого Поле Из мсвКонтролируемыеПоляПланПоЗаданиям Цикл
					ЕстьИзменения = СтрокаПлан[Поле] <> СтрокаДоКорректировки[Поле];
					Если ЕстьИзменения Тогда
						НоваяСтрока = тбзПлан.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлан);	
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если Ложь
			Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса
			Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса
		Тогда
			// Для определенных параметров ввода информации о грузовых местах(ВводитсяВЗаданииДоПланированияРейса, ВводитсяВЗаданииДоНачалаВыполненияРейса)
			// формируется таблица заявок, которые требуется вернуть в статус "КВыполнению".
			тбзОтмененныеЗадания.Свернуть("Задание", "КоличествоГрузовыхМест, КоличествоОтмененныхГрузовыхМест");
			Для каждого Строка Из тбзОтмененныеЗадания Цикл
				Если Строка.КоличествоГрузовыхМест = Строка.КоличествоОтмененныхГрузовыхМест Тогда
					ДобавитьСтрокуВТаблицуЗаявокБезПроверки(тбзЗаявки, Строка.Задание, Справочники.упГрузовыеМеста.ПустаяСсылка(), 1);			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 

		ДополнительныеСвойства.Вставить("Работы", тбзРаботы);
		ДополнительныеСвойства.Вставить("РаботыПоРейсу", Работы.Выгрузить());
		ДополнительныеСвойства.Вставить("МаршрутПоРейсу", Маршрут.Выгрузить());
		ДополнительныеСвойства.Вставить("Задания", тбзЗадания);
		ДополнительныеСвойства.Вставить("Заявки", тбзЗаявки);
		ДополнительныеСвойства.Вставить("ОстаткиГрузовыхМест",	тбзОстаткиГрузовыхМест);
		ДополнительныеСвойства.Вставить("КонтролироватьОстаткиГрузовыхМест", КонтролироватьОстаткиГрузовыхМест);
		Если Задания.Количество() Тогда
			ДополнительныеСвойства.Вставить("мсвЗадания", ОбщегоНазначенияКлиентСервер.СвернутьМассив(Задания.ВыгрузитьКолонку("Задание")));
		КонецЕсли;
		ДополнительныеСвойства.Вставить("ПланПоЗаданиям", тбзПлан);
		//ДополнительныеСвойства.Вставить("СостояниеЗаданийПоАдресам", 	тбзСостояниеЗаданийПоАдресам);
		тбзСостояниеЗаданий.Свернуть("Задание, ГрузовоеМесто, Местоположение", "Количество");
		
		тбзСостояниеЗаданийРаботПриРазделенииГруза = Неопределено;
		Если ДополнительныеСвойства.Свойство("СостояниеЗаданий", тбзСостояниеЗаданийРаботПриРазделенииГруза) Тогда
			Для каждого Строка Из тбзСостояниеЗаданийРаботПриРазделенииГруза Цикл
				НоваяСтрока = тбзСостояниеЗаданий.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
		КонецЕсли;	
		
		ДополнительныеСвойства.Вставить("СостояниеПоЗаданиям", тбзСостояниеЗаданий);
		ДополнительныеСвойства.Вставить("НепереданныеДокументы", тбзНепереданныеДокументы);
		ДополнительныеСвойства.Вставить("ИнкассацияДенежныхСредств", тбзИнкассацияДенежныхСредств);
				
		текПлановоеОкончаниеВыполнения = Неопределено;
		Если Маршрут.Количество() > 0 Тогда
			ПоследняяТочка = Маршрут[Маршрут.Количество()-1];
			Если ПоследняяТочка.Отменена И Маршрут.Количество() > 1 Тогда // отменили возвращение в гараж
			    ПоследняяТочка =  Маршрут[Маршрут.Количество()-2];
			КонецЕсли; 
			текПлановоеОкончаниеВыполнения = ПоследняяТочка.ПлановоеУбытие;	
		КонецЕсли;
		Если НЕ ПлановоеОкончаниеВыполнения = текПлановоеОкончаниеВыполнения Тогда
			ДополнительныеСвойства.Вставить("ПлановоеОкончаниеВыполнения", текПлановоеОкончаниеВыполнения);	
		Иначе	
			ДополнительныеСвойства.Вставить("ПлановоеОкончаниеВыполнения", Неопределено);	
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(сткПеревозчикПоРейсу, ЭтотОбъект);
		
		мсвКонтролируемыеПоляПеревозчик = сткКонтролируемыеПоля.Перевозчик;
		
		Если Истина
			И сткПеревозчикПоРейсу.Количество() <> 0 
			И сткПеревозчикПоРейсуДоКорректировки.Количество() <> 0 
		Тогда
			Для каждого Поле Из мсвКонтролируемыеПоляПеревозчик Цикл
				ЕстьИзменения = сткПеревозчикПоРейсу[Поле] <> сткПеревозчикПоРейсуДоКорректировки[Поле];
				
				Если ЕстьИзменения Тогда
					ДополнительныеСвойства.Вставить("ИзмененЭкипаж", сткПеревозчикПоРейсу);
					ДополнительныеСвойства.Вставить("СтарыйЭкипаж", сткПеревозчикПоРейсуДоКорректировки);
					Прервать;
				КонецЕсли;
						
			КонецЦикла;
			Если сткПеревозчикПоРейсу.ТранспортноеСредство <> сткПеревозчикПоРейсуДоКорректировки.ТранспортноеСредство Тогда
				ДополнительныеСвойства.Вставить("ИзмененоТранспортноеСредство");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьТаблицыДвижениямиПоОперациямСКонтейнерами(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ) Экспорт
	
	тбзГрузовыеМестаКонтейнеры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ГрузовыеМестаКонтейнеры", Неопределено);
	
	Если Истина
		И тбзГрузовыеМестаКонтейнеры <> Неопределено 
		И тбзГрузовыеМестаКонтейнеры.Количество() > 0
	Тогда
	
	    ИмяСобытия = Нстр("ru = 'Ошибка при проведении прохождения точки'");
	
	    ПроблемаНетДействий = Справочники.упПроблемы.НетДействий;
	    
	    Если Не Отказ Тогда
		    // Получить документы "Операции с контейнером", с адресами отличными от текущего
		    
		    Запрос = Новый Запрос;
		    Запрос.Текст = 
		    "
		    |//{Запрос: 0 ////////////////////////////////////////
		    |// Грузовые места, являющиеся контейнерами.
		    |ВЫБРАТЬ
		    |	ГрузовыеМестаКонтейнеры.ГрузовоеМесто КАК ГрузовоеМесто,
		    |	ГрузовыеМестаКонтейнеры.Задание КАК Задание
		    |ПОМЕСТИТЬ втГрузовыеМестаКонтейнеры
		    |ИЗ
		    |	&ГрузовыеМестаКонтейнеры КАК ГрузовыеМестаКонтейнеры
		    |;
		    |//{Запрос: 1 ////////////////////////////////////////
		    |// Грузовые места при прохождении последнего плеча по заявке
		    |// на перевозку груза по операции с контейнером
		    |ВЫБРАТЬ
		    |	втГрузовыеМестаКонтейнерыТ.ГрузовоеМесто КАК ГрузовоеМесто,
		    |	УпПеревозчикПоРейсу_СрезПоследнихТ.ТранспортноеСредство КАК Контейнер,
		    |	упРейсТ.Ссылка КАК ОперацииСКонтейнером
		    |ПОМЕСТИТЬ втРейсыПоКонтейнерам
		    |ИЗ
		    |	втГрузовыеМестаКонтейнеры КАК втГрузовыеМестаКонтейнерыТ
		    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГрузаТ
		    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.упЗаявкиКВыполнению КАК упЗаявкиКВыполнению
		    |		ПО ИСТИНА
		    |			И упЗаданиеНаПеревозкуГрузаТ.ЗаявкаНаПеревозкуГруза = упЗаявкиКВыполнению.Заявка
		    |			И упЗаданиеНаПеревозкуГрузаТ.НомерВЦепиПоставокКонец = упЗаявкиКВыполнению.НомерВЦепиПоставок
		    |	ПО втГрузовыеМестаКонтейнерыТ.Задание = упЗаданиеНаПеревозкуГрузаТ.Ссылка
		    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаявкаНаПеревозкуГруза КАК упЗаявкаНаПеревозкуГрузаТ
		    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упРейс КАК упРейсТ
		    |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упПеревозчикПоРейсу.СрезПоследних(
		    |				,
		    |				) КАК УпПеревозчикПоРейсу_СрезПоследнихТ
		    |			ПО УпПеревозчикПоРейсу_СрезПоследнихТ.Рейс = упРейсТ.Ссылка
		    |		ПО упРейсТ.Ссылка = упЗаявкаНаПеревозкуГрузаТ.ДокументОснование
		    |	ПО упЗаданиеНаПеревозкуГрузаТ.ЗаявкаНаПеревозкуГруза = упЗаявкаНаПеревозкуГрузаТ.Ссылка
		    |ГДЕ ИСТИНА
		    |	И упЗаявкиКВыполнению.Заявка ЕСТЬ NULL
		    |	И упРейсТ.ВидТранспортнойУслуги = ЗНАЧЕНИЕ(Перечисление.упВидыТранспортныхУслуг.ОперацииСКонтейнерами)
		    |;
		    |//{Запрос: 2 ////////////////////////////////////////
		    |// Определения точки разгрузки контейнера по операции с контейнером.
		    |ВЫБРАТЬ РАЗЛИЧНЫЕ
		    |	УпМаршрутПоРейсу_СрезПоследнихТ.Адрес КАК Адрес,
		    |	УпМаршрутПоРейсу_СрезПоследнихТ.Идентификатор КАК ИдентификаторТочки,
		    |	УпМаршрутПоРейсу_СрезПоследнихТ.Рейс КАК ОперацииСКонтейнером
		    |ПОМЕСТИТЬ втТочкиРасформированияКонтейнера
		    |ИЗ
		    |	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
		    |		,
		    |		Рейс В (
		    |			ВЫБРАТЬ
		    |				втРейсыПоКонтейнерам.ОперацииСКонтейнером КАК ОперацииСКонтейнером
		    |			ИЗ
		    |				втРейсыПоКонтейнерам КАК втРейсыПоКонтейнерам)) КАК УпМаршрутПоРейсу_СрезПоследнихТ
		    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упРаботыПоРейсу.СрезПоследних(
		    |		,
		    |		Рейс В (
		    |			ВЫБРАТЬ
		    |				втРейсыПоКонтейнерам.ОперацииСКонтейнером КАК ОперацииСКонтейнером
		    |			ИЗ
		    |				втРейсыПоКонтейнерам КАК втРейсыПоКонтейнерам)) КАК УпРаботыПоРейсу_СрезПоследнихТ
		    |	ПО УпРаботыПоРейсу_СрезПоследнихТ.Идентификатор = УпМаршрутПоРейсу_СрезПоследнихТ.Идентификатор
		    |ГДЕ ИСТИНА
		    |	И НЕ (УпМаршрутПоРейсу_СрезПоследнихТ.Отменена)
		    |	И НЕ (УпРаботыПоРейсу_СрезПоследнихТ.Отменена)
		    |	И УпРаботыПоРейсу_СрезПоследнихТ.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
		    |;
		    |//{Запрос: 3 ////////////////////////////////////////
		    |// Точки расформирования контейнера, с адресами отличающимися от фактического адреса разгрузки
		    |// грузового места - контейнера
		    |ВЫБРАТЬ РАЗЛИЧНЫЕ
		    |	втТочкиРасформированияКонтейнераТ.ИдентификаторТочки КАК ИдентификаторТочки,
		    |	втТочкиРасформированияКонтейнераТ.ОперацииСКонтейнером КАК ОперацииСКонтейнером
		    |ИЗ
		    |	втРейсыПоКонтейнерам КАК втРейсыПоКонтейнерамТ
		    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТочкиРасформированияКонтейнера КАК втТочкиРасформированияКонтейнераТ
		    |	ПО втРейсыПоКонтейнерамТ.ОперацииСКонтейнером = втТочкиРасформированияКонтейнераТ.ОперацииСКонтейнером
		    |	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упГрузовыеМестаКонтейнеров КАК упГрузовыеМестаКонтейнеровТ
		    |	ПО ИСТИНА
		    |		И упГрузовыеМестаКонтейнеровТ.Контейнер = втРейсыПоКонтейнерамТ.Контейнер
		    |		И упГрузовыеМестаКонтейнеровТ.Документ = втРейсыПоКонтейнерамТ.ОперацииСКонтейнером
		    |ГДЕ ИСТИНА
		    |	И упГрузовыеМестаКонтейнеровТ.ГрузовоеМесто = втРейсыПоКонтейнерамТ.ГрузовоеМесто
		    |	И &Адрес <> ЕСТЬNULL(втТочкиРасформированияКонтейнераТ.Адрес, ЗНАЧЕНИЕ(Справочник.упАдреса.ПустаяСсылка))
		    |";

		    Запрос.УстановитьПараметр("Адрес", Реквизиты.АдресТочки);
		    Запрос.УстановитьПараметр("ГрузовыеМестаКонтейнеры", тбзГрузовыеМестаКонтейнеры);
		    
		    Выборка = Запрос.Выполнить().Выбрать();
		        
		    ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками = ПолучитьФункциональнуюОпцию("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками");
		    // для каждого документа "Операции с контейнером"
		    Пока Выборка.Следующий() Цикл
		          ИдентификаторТочки = Выборка.ИдентификаторТочки;
				ОперацииСКонтейнером = Выборка.ОперацииСКонтейнером;


		    
		          // Инициализировать обработку по рейсу - операции с контейнером
				упКорректировкаРейсаОбъект = Обработки.упКорректировкаРейса.Создать();	
				упКорректировкаРейсаОбъект.Рейс = ОперацииСКонтейнером;
				упКорректировкаРейсаОбъект.Ссылка = Ссылка;
				упКорректировкаРейсаОбъект.Период = Период;
			
				сткПараметрыЗаполнения = Новый Структура();
				сткПараметрыЗаполнения.Вставить("ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками", ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками);
				упКорректировкаРейсаОбъект.Инициализация(сткПараметрыЗаполнения);
		    
		    		// Отменить работы в точке расформирования контейнера.
				тбзРаботыТекущие = упКорректировкаРейсаОбъект.Работы.Выгрузить();
				мсвРаботыПоТочке = тбзРаботыТекущие.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочки));
				Для каждого РаботаТекущая Из мсвРаботыПоТочке Цикл
					Если РаботаТекущая.Операция = Перечисления.упТипыОпераций.Разгрузка Тогда
						РаботаТекущая.АдресРазгрузки = Реквизиты.АдресТочки;
					КонецЕсли;
					РаботаТекущая.Проблема = ПроблемаНетДействий;
				КонецЦикла;
				
				// Сформировать таблицы движений по рейсу - операции с контейнером.
				сткРеквизиты = Новый Структура();
				сткРеквизиты.Вставить("Работы", тбзРаботыТекущие);
				сткРеквизиты.Вставить("Идентификатор", ИдентификаторТочки);
				сткРеквизиты.Вставить("НачалоВыполнения", ОкончаниеВыполнения); 
				сткРеквизиты.Вставить("ОкончаниеВыполнения",  ОкончаниеВыполнения); 
				сткРеквизиты.Вставить("НачалоРабот",  ОкончаниеВыполнения); 
				сткРеквизиты.Вставить("РасстояниеОтПредыдущейТочки", 0); 
				сткРеквизиты.Вставить("ВремяПростояПоВинеЗаказчикаЧасы", 0); 
				сткРеквизиты.Вставить("ВремяПростояПоВинеПеревозчикаЧасы", 0);
				сткРеквизиты.Вставить("ПараметрыНаПеревозку", Неопределено);
				сткРеквизиты.Вставить("ДосрочноеУбытие", Ложь);

				
				сткДополнительныеСвойства = Новый Структура();
				сткДополнительныеСвойства.Вставить("ЭтоРаботаСКонтейнером", Истина);
				
				упКорректировкаРейсаОбъект.СформироватьТаблицыДвиженийДляКорректировки(сткДополнительныеСвойства, Ссылка, сткРеквизиты, Отказ);
				
				// Дополнить таблицы движений по исходному рейсу.
				
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(сткДополнительныеСвойства.Работы, ДополнительныеСвойства.Работы);
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(сткДополнительныеСвойства.Маршрут, ДополнительныеСвойства.Маршрут);
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(сткДополнительныеСвойства.ОстаткиГрузовыхМест, ДополнительныеСвойства.ОстаткиГрузовыхМест);
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(сткДополнительныеСвойства.ПланПоЗаданиям, ДополнительныеСвойства.ПланПоЗаданиям);
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(сткДополнительныеСвойства.СостояниеПоЗаданиям, ДополнительныеСвойства.СостояниеПоЗаданиям);
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(сткДополнительныеСвойства.НепереданныеДокументы, ДополнительныеСвойства.НепереданныеДокументы);
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(сткДополнительныеСвойства.ИнкассацияДенежныхСредств, ДополнительныеСвойства.ИнкассацияДенежныхСредств);
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Документ_Рейс_ФормированиеДвижений

// Процедура - подготавливает таблицу движений рейса.
//
Процедура СформироватьТаблицыДвиженийДляРейса(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ) Экспорт
		
	сткКонтролируемыеПоля = ПолучитьСпискиПолейДляСравнения();
	тбзМаршрут = МаршрутДоКорректировки.ВыгрузитьКолонки();
	мсвКонтролируемыеПоляМассива = сткКонтролируемыеПоля.Маршрут;

	стрСписокПолей = СтрСоединить(мсвКонтролируемыеПоляМассива, ",");
	
	МодифицированМаршрут = Ложь;
	
	// Проверка на удаленные строки
	Для каждого Строка Из МаршрутДоКорректировки Цикл
		
		МодифицированМаршрут = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", Строка.Идентификатор)).Количество() = 0;
		
		Если МодифицированМаршрут Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ МодифицированМаршрут Тогда
		
		// Формируется таблица изменений для маршрута
		Для каждого Строка Из Маршрут Цикл
			
			Если НЕ Строка.СтрокаДокумента Тогда
				Продолжить;
			КонецЕсли;
			
			мсвСтрокиМаршрутаДоКорректировки = МаршрутДоКорректировки.НайтиСтроки(Новый Структура("Идентификатор", Строка.Идентификатор));
			
			Если мсвСтрокиМаршрутаДоКорректировки.Количество() = 0 Тогда
				МодифицированМаршрут = Истина;
			Иначе
				СтрокаДоКорректировки = мсвСтрокиМаршрутаДоКорректировки[0];
				Для каждого Поле Из мсвКонтролируемыеПоляМассива Цикл
					МодифицированМаршрут = НЕ Строка[Поле] = СтрокаДоКорректировки[Поле];
					Если МодифицированМаршрут Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если МодифицированМаршрут Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	тбзМаршрутПоДокументу = Маршрут.Выгрузить(Новый Структура("СтрокаДокумента",Истина));
	ДополнительныеСвойства.Вставить("Маршрут", тбзМаршрутПоДокументу);
	ДополнительныеСвойства.Вставить("МаршрутПолный", тбзМаршрутПоДокументу.Скопировать());
	ДополнительныеСвойства.Вставить("МодифицированМаршрут", МодифицированМаршрут);
	
	тбзЗадания = ПолучитьСтруктуруТаблицыЗадания();
	
	тбзРаботы = РаботыДоКорректировки.ВыгрузитьКолонки();
	мсвКонтролируемыеПоляМассива = сткКонтролируемыеПоля.Работы;
	
	стрСписокПолей = СтрСоединить(мсвКонтролируемыеПоляМассива, ",");
	МодифицированыРаботы = Ложь;
	
	// Проверка на удаленные строки
	Для каждого Строка Из РаботыДоКорректировки Цикл
		
		МодифицированыРаботы = Работы.НайтиСтроки(Новый Структура("ИдентификаторРаботы", Строка.ИдентификаторРаботы)).Количество() = 0;
		
		Если МодифицированыРаботы Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если НЕ МодифицированыРаботы Тогда
		
		Для каждого Строка Из Работы Цикл
			
			СтрокаДоКорректировки = Неопределено;
			
			// Формируется таблица работ
			мсвСтрокиРаботыДоКорректировки = РаботыДоКорректировки.НайтиСтроки(Новый Структура("ИдентификаторРаботы", Строка.ИдентификаторРаботы));
			Если мсвСтрокиРаботыДоКорректировки.Количество() = 0 Тогда
				МодифицированыРаботы = Истина;
			Иначе
				СтрокаДоКорректировки = мсвСтрокиРаботыДоКорректировки[0];
				
				Для каждого Поле Из мсвКонтролируемыеПоляМассива Цикл
					МодифицированыРаботы = НЕ Строка[Поле] = СтрокаДоКорректировки[Поле];
					Если МодифицированыРаботы Тогда
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			Если МодифицированыРаботы Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;		
	ДополнительныеСвойства.Вставить("Работы", Работы.Выгрузить(Новый Структура("СтрокаДокумента",Истина)));
	ДополнительныеСвойства.Вставить("МодифицированыРаботы", МодифицированыРаботы);
	ДополнительныеСвойства.Вставить("МаршрутРаботыПодготовлены", Истина);
		
КонецПроцедуры

// Процедура - подготавливает таблицу движений рейса.
//
Процедура СформироватьТаблицыДвиженийДляРейсаПрохождениеМаршрутаВРейсе(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ) Экспорт

	сткКонтролируемыеПоля = ПолучитьСпискиПолейДляСравнения();
	
	тбзМаршрут = МаршрутДоКорректировки.ВыгрузитьКолонки();
	мсвКонтролируемыеПоляМассива = сткКонтролируемыеПоля.Маршрут;
	мсвСостояниеПоЗаданиям = сткКонтролируемыеПоля.СостояниеПоЗаданиям;
	мсвНепереданныеДокументы = сткКонтролируемыеПоля.СостояниеПоЗаданиям;
	
	ВариантМаршрутаСамовывоз = ВариантФормированияМаршрута = ПредопределенноеЗначение("Перечисление.упВариантыФормированияМаршрута.Самовывоз"); 
	
	стрСписокПолей = СтрСоединить(мсвКонтролируемыеПоляМассива, ",");
	
	ИдентификаторТочки = Неопределено;
	
	соотАдресаТочек = Новый Соответствие;
	тбзФактическиеМестоположенияТранспорта = ПолучитьСтруктуруТаблицыФактическиеМестоположенияТС();
	
	мсвАдреса = Маршрут.ВыгрузитьКолонку("Адрес");
	тбзУчетныеЗоныАдресов = упУчетТранспортныхСредств.УчетныеЗоныАдресов(мсвАдреса);
	
	// Формируется таблица изменений для маршрута
	Для каждого Строка Из Маршрут Цикл
		соотАдресаТочек.Вставить(Строка.Идентификатор, Новый Структура("Адрес, СтрокаНомер",Строка.Адрес, Строка.СтрокаНомер));
		НоваяСтрока = тбзМаршрут.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Истина
			И ЗначениеЗаполнено(Строка.УбытиеФакт) 
			И ЗначениеЗаполнено(ТранспортноеСредство)
			И тбзФактическиеМестоположенияТранспорта.Найти(Строка.УбытиеФакт, "Дата") = Неопределено
		Тогда
			мсвУчетныеЗоны = тбзУчетныеЗоныАдресов.НайтиСтроки(Новый Структура("Адрес", Строка.Адрес));
			УчетнаяЗона = Справочники.упГеографическиеЗоны.ПустаяСсылка();
			Если мсвУчетныеЗоны.Количество() > 0 Тогда
				УчетнаяЗона = мсвУчетныеЗоны[0].Зона;
			КонецЕсли;		
		
			ДобавитьСтрокуВТаблицуФактическиеМестоположенияТранспорта(тбзФактическиеМестоположенияТранспорта, ТранспортноеСредство, УчетнаяЗона, Строка.Адрес, Строка.УбытиеФакт);	
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ИдентификаторТочки", ИдентификаторТочки);
	ДополнительныеСвойства.Вставить("Маршрут", тбзМаршрут);
	//ДополнительныеСвойства.Вставить("МаршрутПолный", Маршрут.Выгрузить());
	
	сткСтатусыСтроки = СтатусыСтрок();
	
	тбзЗадания = Неопределено;
	Если НЕ ДополнительныеСвойства.Свойство("Задания", тбзЗадания) Тогда
		тбзЗадания = ПолучитьСтруктуруТаблицыЗадания();	
	КонецЕсли;
	
	тбзЗаявки = ПолучитьСтруктуруТаблицыЗаявки();
	тбзОтмененныеЗадания = ПолучитьСтруктуруТаблицыОтмененныеЗадания();
	тбзСостояниеЗаданий = ПолучитьСтруктуруТаблицыСостоянияЗаданиям();
	тбзОстаткиГрузовыхМест = ПолучитьСтруктуруТаблицыОстаткиГрузовыхМест();
	тбзНепереданныеДокументы = ПолучитьСтруктуруТаблицыНепереданныеДокументы();
	тбзИнкассацияДенежныхСредств = ПолучитьСтруктуруТаблицыИнкассацияДенежныхСредств();  
	тбзПрерыванияГрузовыхПотоков = ПолучитьСтруктуруТаблицыПрерыванияГрузовыхПотоков();
		
	тбзСтатистикаПоРаботам = Неопределено;
	мсвЗаданияПоРегистратору	= Неопределено;
	Если Ложь
		Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса 
		Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса 
	Тогда
		тбзСтатистикаПоРаботам = ПолучитьСтруктуруТаблицыСтатистикаПоРаботам();
		Если Реквизиты.Свойство("Работы") Тогда
			Если НЕ ТипЗнч(Реквизиты.Работы) = Тип("ТаблицаЗначений") Тогда
				мсвЗаданияПоРегистратору = Новый Массив;
				Для каждого Строка Из Реквизиты.Работы Цикл
					мсвЗаданияПоРегистратору.Добавить(Строка.Задание);	
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	КорректироватьРегистрНепереданныеДокумменты = ПолучитьФункциональнуюОпцию("упИспользуетсяВозвратДокументовПослеИсполненияРейса");
	ПланПоЗаданиям.Очистить();
	
	тбзРаботы = РаботыДоКорректировки.ВыгрузитьКолонки();
	мсвКонтролируемыеПоляМассива = сткКонтролируемыеПоля.Работы;
	
	стрСписокПолей = СтрСоединить(мсвКонтролируемыеПоляМассива, ",");
	
	соотНомераВЦепиПоставок = Новый Соответствие;
	соотЗаявки = Новый Соответствие;
	
	мсвЗаданийВернутьВПланирование = Новый Массив; // накапливаем задания, которые вернули в планирование целиком при вводе груза до начала выполнения рейса
	мсвОтмененныеГрузовыеМеста = Новый Массив; 
     КонтролироватьОстаткиГрузовыхМест = Ложь;
	
	Для каждого Строка Из Работы Цикл
		ЕстьИзменения = Ложь;
		ЕстьИзмененияВСостоянииПоЗаданиям = Ложь;
		СтрокаДоКорректировки = Неопределено;
		СтатусСтрокиПослеИзменения = СтатусСтроки(Строка, сткСтатусыСтроки); 
		СтатусСтрокиДоИзменения = Неопределено;
		ПроблемаПриОтменеДо = Неопределено;
		ПроблемаПриОтменеПосле = Строка.Проблема;
		
		// Формируется таблица работ
		Задание = Строка.Задание;
		ЗаявкаНаПеревозкуГруза = Строка.ЗаявкаНаПеревозкуГруза;
		Валюта = Строка.Валюта;
		Сумма = Строка.Сумма;
		ГрузовоеМесто = Строка.ГрузовоеМесто;
		Тара = Строка.Тара;
		СкладскаяЯчейка = Строка.СкладскаяЯчейка;
		//Если НЕ КонтролироватьОстаткиГрузовыхМест
		//		И ЗначениеЗаполнено(СкладскаяЯчейка) Тогда
		//	КонтролироватьОстаткиГрузовыхМест = Истина;
		//КонецЕсли;
		
		сткДанныеПоТочке = соотАдресаТочек.Получить(Строка.Идентификатор);
		
		Если сткДанныеПоТочке = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		
		АдресТочки = сткДанныеПоТочке.Адрес;
		СтрокаНомер = сткДанныеПоТочке.СтрокаНомер;
		АдресТочкиДоКорректировки = Неопределено;
		КоличествоГрузов = Строка.КоличествоГрузов;
		
		ДобавитьСтрокуВТаблицуСтатистикаПоРаботам(тбзСтатистикаПоРаботам, Строка, мсвЗаданияПоРегистратору);
		
		ЕстьИзменения = Истина;
		ЕстьИзмененияВСостоянииПоЗаданиям = Истина;
		НоваяСтрока = тбзРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.КоличествоГрузов = КоличествоГрузов;
			
		
		АдресПогрузкиПоЗаданию = Неопределено;
		АдресРазгрузкиПоЗаданию = Неопределено;
		АдресПогрузкиПоЗаданиюДоКорректировки = Неопределено;
		АдресРазгрузкиПоЗаданиюДоКорректировки = Неопределено;
		НовыйАдресРазгрузкиПоЗаданию	= Неопределено; // Заполняется в случае отмены разгрузки
		
		// Учитываются только работы погрузки/разгрузки
		Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(Строка.Операция) Тогда
			
			АдресПогрузкиПоЗаданию = АдресТочки;
			Если СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Отменена Тогда
				ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
				
				ДобавитьСтрокуВТаблицуПрерыванияГрузовыхПотоков(тбзПрерыванияГрузовыхПотоков, Задание, ГрузовоеМесто, КоличествоГрузов);
			Иначе
				ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, 0, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
				Если Истина 
					И ВариантМаршрутаСамовывоз 
					И СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Выполнена Тогда
					
					ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
			        	ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, АдресТочки, Истина, КоличествоГрузов, Ложь, Справочники.упПроблемы.ПустаяСсылка(), СтрокаНомер);
				
					Если Строка.Операция = Перечисления.упТипыОпераций.ВыемкаЦенностей Тогда
						ДобавитьСтрокуВТаблицуИнкассацияДенежныхСредств(тбзИнкассацияДенежныхСредств, ЗаявкаНаПеревозкуГруза, ГрузовоеМесто, Валюта, Сумма);	
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли; 

		ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(Строка.Операция) Тогда
			
			АдресРазгрузкиПоЗаданию	= АдресТочки;
			Если НЕ СтрокаДоКорректировки = Неопределено Тогда
				АдресРазгрузкиПоЗаданиюДоКорректировки = АдресТочкиДоКорректировки;
			КонецЕсли;
			
			Если СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Выполнена Тогда	
				Если ЗначениеЗаполнено(Строка.ПроблемаПричинаВозникновенияЭтойРаботы) Тогда
					
					Действие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.ПроблемаПричинаВозникновенияЭтойРаботы, "Действие");
					
					Если Действие = Перечисления.упДействияПоРаботе.ВернутьВПланирование Тогда
						Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
							мсвЗаданийВернутьВПланирование.Добавить(Задание);
						Иначе	
							ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, КоличествоГрузов, КоличествоГрузов, КоличествоГрузов, 0, ВидДвиженияНакопления.Приход);
							ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Ложь);
						КонецЕсли; 
						ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, КоличествоГрузов, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
						
					ИначеЕсли упПрохождениеТочкиКлиентСервер.ДействиеОтменяющееЗадание(Действие) Тогда	
						ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);
						Если Действие = Перечисления.упДействияПоРаботе.ОтменитьЗадание Тогда	
							ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Истина);
							ДобавитьСтрокуВТаблицуЗаявок(тбзЗаявки, Задание, ГрузовоеМесто, КоличествоГрузов);		
						КонецЕсли;	
						ДобавитьСтрокуВТаблицуНепереданныеДокументы(тбзНепереданныеДокументы, Задание, КоличествоГрузов, КоличествоГрузов, ?(СтрокаДоКорректировки = Неопределено, КоличествоГрузов, 0)); 
						
					ИначеЕсли Действие = Перечисления.упДействияПоРаботе.НетДействий Тогда		
						ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
						
					КонецЕсли;
				Иначе
					
					ДобавитьСтрокуВТаблицу(тбзЗадания, Задание, ГрузовоеМесто, Тара, 0, 0, 0, КоличествоГрузов, ВидДвиженияНакопления.Расход);	
					ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Ложь);
					
				КонецЕсли;
				
				ПланПоЗаданиюВыполнен = Истина;
				ПланПоЗаданиюОтменен = Ложь;
				ПланПоЗаданиюПроблема = Строка.ПроблемаПричинаВозникновенияЭтойРаботы;
				Если Истина
					И ЗначениеЗаполнено(Действие) 
					И НЕ Действие = Перечисления.упДействияПоРаботе.НетДействий
				Тогда
					ПланПоЗаданиюВыполнен = Ложь;
					ПланПоЗаданиюОтменен = Истина;
				КонецЕсли;
				ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, АдресТочки, ПланПоЗаданиюВыполнен, КоличествоГрузов, ПланПоЗаданиюОтменен, ПланПоЗаданиюПроблема, СтрокаНомер);
				
				Если Строка.Операция = Перечисления.упТипыОпераций.ПередачаЦенностей Тогда
					ДобавитьСтрокуВТаблицуИнкассацияДенежныхСредств(тбзИнкассацияДенежныхСредств, ЗаявкаНаПеревозкуГруза, ГрузовоеМесто, Валюта, Сумма);	
				КонецЕсли;
				
				ДобавитьСтрокуВТаблицуОстаткиГрузовыхМест(тбзОстаткиГрузовыхМест, Строка.Операция, Задание, ГрузовоеМесто, Тара, СкладскаяЯчейка, КоличествоГрузов);
				
			ИначеЕсли СтатусСтрокиПослеИзменения = сткСтатусыСтроки.Отменена Тогда		
				
				// Отменяется плановая разгрузка
				ДобавитьСтрокуВТаблицуПланПоЗаданиям(ПланПоЗаданиям, Задание, ГрузовоеМесто, АдресРазгрузкиПоЗаданию, Ложь, 0, Истина, Строка.Проблема, СтрокаНомер);
				
				ДобавитьСтрокуВТаблицуПрерыванияГрузовыхПотоков(тбзПрерыванияГрузовыхПотоков, Задание, ГрузовоеМесто, КоличествоГрузов);

			Иначе	
				ДобавитьСтрокуВТаблицуОтмененныхЗаданий(тбзОтмененныеЗадания, Задание, Ложь);
			КонецЕсли;
			
		КонецЕсли;
							
	КонецЦикла;
		
	Отказ = СуществуютЗаданияЧастичноОтмененныеВозвращенныеВПланирование(тбзСтатистикаПоРаботам);
	
	Если Отказ Тогда
		
		Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
			ТекстСообщения = НСтр("ru = 'Запрещено частично отменять и возвращать в планирование работы, если информация о грузовых местах вводится до начала выполнения рейса'");
		Иначе	
			ТекстСообщения = НСтр("ru = 'Запрещено частично отменять и возвращать в планирование работы, если информация о грузовых местах вводится в задании до начала планирования рейса'");	
		КонецЕсли;
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	Иначе	
		//Если ЭтоКорректировка И мсвЗаданийВернутьВПланирование.Количество() Тогда
		Если мсвЗаданийВернутьВПланирование.Количество() Тогда
			мсвЗаданийВернутьВПланирование = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвЗаданийВернутьВПланирование);
			Для каждого текЗадание Из мсвЗаданийВернутьВПланирование Цикл
				ДобавитьСтрокуВТаблицу(тбзЗадания, текЗадание, Справочники.упГрузовыеМеста.ПустаяСсылка(), Справочники.упГрузовыеМеста.ПустаяСсылка(), 1, 1, 1, 0, ВидДвиженияНакопления.Приход);
			КонецЦикла; 
		КонецЕсли; 
		
		тбзПлан = Неопределено;
		Если НЕ ДополнительныеСвойства.Свойство("ПланПоЗаданиям", тбзПлан) Тогда
			тбзПлан = ПланПоЗаданиям.ВыгрузитьКолонки();
		КонецЕсли;
				
		мсвКонтролируемыеПоляПланПоЗаданиям = сткКонтролируемыеПоля.ПланПоЗаданиям;
		Для каждого СтрокаПлан Из ПланПоЗаданиям Цикл
			ЕстьИзменения = Ложь;
			СтрокаДоКорректировки = Неопределено;
			
			мсвСтрокиПланаДоКорректировки = ПланПоЗаданиямДоКорректировки.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Местоположение", СтрокаПлан.Задание, СтрокаПлан.ГрузовоеМесто, СтрокаПлан.Местоположение));
			
			Если мсвСтрокиПланаДоКорректировки.Количество() = 0 Тогда
				ЕстьИзменения = Истина;
				НоваяСтрока = тбзПлан.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлан);
			Иначе
				СтрокаДоКорректировки = мсвСтрокиПланаДоКорректировки[0];
				Для каждого Поле Из мсвКонтролируемыеПоляПланПоЗаданиям Цикл
					
					ЕстьИзменения 	= СтрокаПлан[Поле] <> СтрокаДоКорректировки[Поле];
					
					Если ЕстьИзменения Тогда
						НоваяСтрока = тбзПлан.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлан);	
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если Ложь
			Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса
			Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса 
		Тогда
			// Для определенных параметров ввода информации о грузовых местах(ВводитсяВЗаданииДоПланированияРейса, ВводитсяВЗаданииДоНачалаВыполненияРейса)
			// формируется таблица заявок, которые требуется вернуть в статус "КВыполнению".
			тбзОтмененныеЗадания.Свернуть("Задание", "КоличествоГрузовыхМест, КоличествоОтмененныхГрузовыхМест");
			Для каждого Строка Из тбзОтмененныеЗадания Цикл
				Если Строка.КоличествоГрузовыхМест = Строка.КоличествоОтмененныхГрузовыхМест Тогда
					ДобавитьСтрокуВТаблицуЗаявокБезПроверки(тбзЗаявки, Строка.Задание, Справочники.упГрузовыеМеста.ПустаяСсылка(), 1);			
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 

		ДополнительныеСвойства.Вставить("Работы", тбзРаботы);
		ДополнительныеСвойства.Вставить("РаботыПоРейсу", Работы.Выгрузить());
		ДополнительныеСвойства.Вставить("МодифицированыРаботы", Истина);
		ДополнительныеСвойства.Вставить("МаршрутРаботыПодготовлены", Истина);
		ДополнительныеСвойства.Вставить("МодифицированМаршрут", Истина);
		ДополнительныеСвойства.Вставить("МаршрутПоРейсу", Маршрут.Выгрузить());
		ДополнительныеСвойства.Вставить("Задания", тбзЗадания);
		ДополнительныеСвойства.Вставить("Заявки", тбзЗаявки);
		ДополнительныеСвойства.Вставить("КонтролироватьОстаткиГрузовыхМест", КонтролироватьОстаткиГрузовыхМест);
		ДополнительныеСвойства.Вставить("ПрерыванияГрузовыхПотоков", тбзПрерыванияГрузовыхПотоков);
		Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
			ДополнительныеСвойства.Вставить("ФактическиеМестоположенияТранспорта", тбзФактическиеМестоположенияТранспорта);
		КонецЕсли; 
		
		Если Задания.Количество() Тогда
			ДополнительныеСвойства.Вставить("мсвЗадания", ОбщегоНазначенияКлиентСервер.СвернутьМассив(Задания.ВыгрузитьКолонку("Задание")));
		КонецЕсли;
		ДополнительныеСвойства.Вставить("ПланПоЗаданиям", тбзПлан);
		тбзСостояниеЗаданий.Свернуть("Задание, ГрузовоеМесто, Местоположение", "Количество");
		
		тбзСостояниеЗаданийРаботПриРазделенииГруза = Неопределено;
		Если ДополнительныеСвойства.Свойство("СостояниеЗаданий", тбзСостояниеЗаданийРаботПриРазделенииГруза) Тогда
			Для каждого Строка Из тбзСостояниеЗаданийРаботПриРазделенииГруза Цикл
				НоваяСтрока = тбзСостояниеЗаданий.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;
		КонецЕсли;	
		
		//ДополнительныеСвойства.Вставить("СостояниеПоЗаданиям", 			тбзСостояниеЗаданий);
		ДополнительныеСвойства.Вставить("НепереданныеДокументы", тбзНепереданныеДокументы);
		ДополнительныеСвойства.Вставить("ИнкассацияДенежныхСредств", тбзИнкассацияДенежныхСредств);
				
		текПлановоеОкончаниеВыполнения = Неопределено;
		Если Маршрут.Количество() > 0 Тогда
			текПлановоеОкончаниеВыполнения = Маршрут[Маршрут.Количество()-1].ПлановоеУбытие;	
		КонецЕсли;
		
		Если НЕ ПлановоеОкончаниеВыполнения = текПлановоеОкончаниеВыполнения Тогда
			ДополнительныеСвойства.Вставить("ПлановоеОкончаниеВыполнения", текПлановоеОкончаниеВыполнения);	
		Иначе	
			ДополнительныеСвойства.Вставить("ПлановоеОкончаниеВыполнения", Неопределено);	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область Документ_РегистрацияОтложенныхРаботПоРейсу_ФормированиеДвижений

// Процедура - подготавливает таблицу движений регистрации отложенных работ.
//
Процедура СформироватьТаблицыДвиженийДляРегистрацияОтложенныхРаботПоРейсу(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ) Экспорт
	
	ИнициализацияМаршрутаИРаботПоРейсу(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
	
	сткКонтролируемыеПоля = ПолучитьСпискиПолейДляСравнения();
	тбзМаршрут = МаршрутДоКорректировки.ВыгрузитьКолонки();
	мсвКонтролируемыеПоляМассива = сткКонтролируемыеПоля.Маршрут;
	ВыводитьСообщенияПользователю = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ВыводитьСообщенияПользователю", Ложь);

	стрСписокПолей = СтрСоединить(мсвКонтролируемыеПоляМассива, ",");
	
	тбзРаботы = РаботыДоКорректировки.ВыгрузитьКолонки();
	
	МодифицированыРаботы = Ложь;
	мсвИдентификаторыТочекСРаботами = Новый Массив;
	
	// Формируется таблица изменений для работ.
	Для каждого Строка Из Работы Цикл
		
		Если НЕ Строка.Отменена Тогда
			мсвИдентификаторыТочекСРаботами.Добавить(Строка.Идентификатор);
		КонецЕсли;
		
		Если Истина
			И Не Строка.Выполнена
			И Не Строка.Отменена
			И Не Строка.Отложена
		Тогда
			
			Отказ = Истина
			        И Не упПрохождениеТочкиКлиентСервер.ОперацияРазрешеноОтложить(Строка.Операция);
			
			Если Отказ Тогда
				ОсновноеСообщение = НСтр("ru = 'Работу с типом ""%1"" запрещено откладывать на более поздний период%2'");
				ТекстСообщения = СтрШаблон(ОсновноеСообщение, Строка.Операция, "");
				ДополнительныеСвойства.Вставить("ТекстОшибки", ТекстСообщения);
				
				Если ВыводитьСообщенияПользователю Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;
												
				ДополнительноеСообщение = НСтр("ru = '(Идентификатор точки:%1; идентификатор работы:%2; задание:%3)'");
				ДополнительноеСообщение = СтрШаблон(ДополнительноеСообщение, Строка.Идентификатор, Строка.ИдентификаторРаботы, Строка.Задание);
				ТекстСообщения = СтрШаблон(ОсновноеСообщение, Строка.Операция, ДополнительноеСообщение);
				
				ЗаписьЖурналаРегистрации(упКорректировкаМаршрута.СобытиеОшибкаРегистрацияОтложенныхРаботПоРейсу(НСтр("ru = 'ПроверкаТиповОпераций'")),
									УровеньЖурналаРегистрации.Предупреждение,,Ссылка, ТекстСообщения, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
				
			КонецЕсли;
			
			Строка.Отложена = Истина;
			МодифицированыРаботы = Истина;
			НоваяСтрока = тбзРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;		
		
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Если Не Отказ Тогда
	
		ДополнительныеСвойства.Вставить("Работы", тбзРаботы);
		ДополнительныеСвойства.Вставить("МодифицированыРаботы", МодифицированыРаботы);
		ДополнительныеСвойства.Вставить("МаршрутРаботыПодготовлены", Истина);
		
		МодифицированМаршрут = Ложь;
		
		тбзМаршрутПоДокументу = Маршрут.ВыгрузитьКолонки();
		
		// Формируется таблица изменений для маршрута.
		Для каждого Строка Из Маршрут Цикл
			
			Если Истина
				И Не Строка.Пройдена
				И Не Строка.Отменена
				И Не Строка.Отложена
			Тогда
				Если мсвИдентификаторыТочекСРаботами.Найти(Строка.Идентификатор) = Неопределено Тогда
					Строка.Отменена = Истина;
				Иначе
					Строка.Отложена = Истина;
				КонецЕсли;
				
				МодифицированМаршрут = Истина;
				НоваяСтрока = тбзМаршрутПоДокументу.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЕсли;		
			
		КонецЦикла;
		
		ДополнительныеСвойства.Вставить("Маршрут", тбзМаршрутПоДокументу);
		ДополнительныеСвойства.Вставить("МаршрутПолный", тбзМаршрутПоДокументу.Скопировать());
		ДополнительныеСвойства.Вставить("МодифицированМаршрут", МодифицированМаршрут);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - изменяет значения найденной строки.
//
Процедура ОбработатьИзменениеСтрокиЗадания(НомерСтроки, НоваяСтрока = Ложь, Удалить = Ложь, ОтменаРедактирования = Ложь, Отказ, Распределить = Ложь, РаспределитьПоНепройденнымТочкам = Ложь) Экспорт

	ИндексСтроки = НомерСтроки - 1;
	текСтрока = Задания.Получить(ИндексСтроки);
	
	// Ищутся поля с измененными значениями
	сткИзмененныеПоля = Новый Структура;
	Для каждого текПоле Из сткЗначенияСтрокиЗаданийДоРедактирования Цикл
		Если НЕ текСтрока[текПоле.Ключ] = текПоле.Значение Тогда
			сткИзмененныеПоля.Вставить(текПоле.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если ОтменаРедактирования Тогда
		Для каждого текПоле Из сткИзмененныеПоля Цикл
			текСтрока[текПоле.Ключ] = сткЗначенияСтрокиЗаданийДоРедактирования[текПоле.Ключ];
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	Если Не Удалить И сткИзмененныеПоля.Свойство("ГрузовоеМесто") Тогда
		текСтрока.Тара = упЗаданиеНаПеревозкуВызовСервера.ПолучитьТаруГрузовогоМеста(текСтрока.Задание, текСтрока.ГрузовоеМесто);
	КонецЕсли;
	
	ЭтоРейс = ТипЗнч(Ссылка) = тип("ДокументСсылка.упРейс");	
	
	Если НоваяСтрока Тогда
		текСтрока.ФлагРаспределения = Истина;
	КонецЕсли;
	
	Если Распределить ИЛИ ЭтоРейс Тогда
		текСтрока.ФлагРаспределения = Ложь;
	КонецЕсли;
		
	Если текСтрока.ФлагРаспределения Тогда
		Возврат; 
	КонецЕсли;
	
	текПересчитатьВременноеОкноТочки = Ложь;
	
	Если Удалить Тогда
		// Из маршрута удаляются строки со старым заданием 
		УдалитьСтрокиИзМаршрутаПоЗаданиюНаПеревозку();
		текПересчитатьВременноеОкноТочки = Истина;
		
	Иначе	
		КонтрольДанныхЗадания(текСтрока, Отказ);
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
										
		// Если изменили задание или грузовое место.
		Если сткИзмененныеПоля.Свойство("Задание") 
				ИЛИ сткИзмененныеПоля.Свойство("ГрузовоеМесто") Тогда
									
			// Изменяются грузовое место и задание в строках маршрута и пересчитывается время.
			
			Если сткИзмененныеПоля.Свойство("Задание") Тогда
				текПересчитатьВременноеОкноТочки = Истина;
			КонецЕсли;
			
			ГрузовоеМестоБыло = сткЗначенияСтрокиЗаданийДоРедактирования.ГрузовоеМесто;
			ЗаданиеБыло = сткЗначенияСтрокиЗаданийДоРедактирования.Задание;
			ГрузовоеМестоСтало = текСтрока.ГрузовоеМесто;
			ЗаданиеСтало = текСтрока.Задание;
		
			// Подсчитывается количество грузов в документе по грузовому месту и заданию в изменяемой строке.
			КоличествоТекущееГрузовоеМестоБыло = 0;
			КоличествоТекущееГрузовоеМестоСтало = 0;
			
			Для каждого СтрокаЗадание Из Задания Цикл
				
				Если СтрокаЗадание.ГрузовоеМесто = ГрузовоеМестоБыло Тогда
					
					КоличествоТекущееГрузовоеМестоБыло = КоличествоТекущееГрузовоеМестоБыло + СтрокаЗадание.КоличествоГрузов;
					
				ИначеЕсли СтрокаЗадание.ГрузовоеМесто = ГрузовоеМестоСтало Тогда
					
					КоличествоТекущееГрузовоеМестоСтало = КоличествоТекущееГрузовоеМестоСтало + СтрокаЗадание.КоличествоГрузов;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ДобавитьСтроки = Ложь;
			
			мсвСтрокиРаботыСтало = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", сткЗначенияСтрокиЗаданийДоРедактирования.Задание, ГрузовоеМестоСтало));
			
			Если мсвСтрокиРаботыСтало.Количество() > 0 Тогда
				
				Для каждого СтрокаРабота Из мсвСтрокиРаботыСтало Цикл
					СтрокаРабота.КоличествоГрузов = КоличествоТекущееГрузовоеМестоСтало;
					ПересчитатьДанныеРаботы(Новый Структура("Операция",СтрокаРабота.Операция),СтрокаРабота);
				КонецЦикла;
				
			Иначе	
				
				ДобавитьСтроки = Истина;
				
			КонецЕсли;
									
			мсвСтрокиРаботыБыло = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", сткЗначенияСтрокиЗаданийДоРедактирования.Задание, ГрузовоеМестоБыло));
									
			Для каждого СтрокаРаботаБыло Из мсвСтрокиРаботыБыло Цикл
				
				Если ДобавитьСтроки И НЕ сткИзмененныеПоля.Свойство("Задание")  Тогда
					НоваяСтрокаРабота = Работы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРабота, СтрокаРаботаБыло);
					НоваяСтрокаРабота.ГрузовоеМесто = текСтрока.ГрузовоеМесто;
					НоваяСтрокаРабота.Тара = текСтрока.Тара;
					НоваяСтрокаРабота.КоличествоГрузов = КоличествоТекущееГрузовоеМестоСтало;
					ОбработатьДобавлениеРаботы(НоваяСтрокаРабота.НомерСтроки, НоваяСтрокаРабота.Идентификатор, Отказ);
					ПересчитатьДанныеРаботы(Новый Структура("Операция",НоваяСтрокаРабота.Операция),НоваяСтрокаРабота);
				КонецЕсли;
						
				Если КоличествоТекущееГрузовоеМестоБыло = 0 Тогда
					Работы.Удалить(Работы.Индекс(СтрокаРаботаБыло));
				Иначе
					СтрокаРаботаБыло.КоличествоГрузов = КоличествоТекущееГрузовоеМестоБыло;
					ПересчитатьДанныеРаботы(Новый Структура("Операция",СтрокаРаботаБыло.Операция),СтрокаРаботаБыло);
				КонецЕсли;
			
			КонецЦикла;
			
			Если сткИзмененныеПоля.Свойство("Задание") Тогда
				Если ЭтоРейс Тогда
					ДобавитьСтрокиВМаршрутПоЗаданиюНаПеревозку(текСтрока);	
				КонецЕсли;
				текСтрока.ФлагРаспределения = Истина
			КонецЕсли;

						
		// Если изменили количество грузовых мест
		ИначеЕсли сткИзмененныеПоля.Свойство("КоличествоГрузов") Тогда
			
			// Подсчитывается количество грузов в документе по грузовому месту и заданию в изменяемой строке.
			мсвЗадания = Задания.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", сткЗначенияСтрокиЗаданийДоРедактирования.Задание, сткЗначенияСтрокиЗаданийДоРедактирования.ГрузовоеМесто));
			КоличествоГрузов = 0;
			Для каждого СтрокаЗадание Из мсвЗадания Цикл
				КоличествоГрузов = КоличествоГрузов + СтрокаЗадание.КоличествоГрузов;
			КонецЦикла;
			
			// Изменяется грузовое место в строках маршрута и пересчитывается время
			мсвСтрокиРаботы = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", сткЗначенияСтрокиЗаданийДоРедактирования.Задание, сткЗначенияСтрокиЗаданийДоРедактирования.ГрузовоеМесто));
			Для каждого текСтрокаРабота Из мсвСтрокиРаботы Цикл
				текСтрокаРабота.КоличествоГрузов = КоличествоГрузов;
				ПересчитатьДанныеРаботы(Новый Структура("КоличествоГрузов"), текСтрокаРабота);
			КонецЦикла;	
			СпланироватьРаботыПоМаршруту();
		КонецЕсли;
		
	КонецЕсли;
	
	Если текПересчитатьВременноеОкноТочки Тогда
		ПересчитатьЗначенияМаршрута(текСтрока, Удалить);
	КонецЕсли;
					
КонецПроцедуры

// Процедура производит распределение переданного задания.
//
Процедура РаспределитьСтрокуЗадания(НомерСтроки, Отказ, РаспределитьПоНепройденнымТочкам = Ложь) Экспорт

	ИндексСтроки	= НомерСтроки - 1;
	текСтрока 		= Задания.Получить(ИндексСтроки);
	
	сткЗначенияСтрокиЗаданийДоРедактирования.Вставить("Задание", 						текСтрока.Задание);
	сткЗначенияСтрокиЗаданийДоРедактирования.Вставить("ГрузовоеМесто", 					текСтрока.ГрузовоеМесто);
	сткЗначенияСтрокиЗаданийДоРедактирования.Вставить("КоличествоГрузов", 				текСтрока.КоличествоГрузов);
	
	текСтрока.ФлагРаспределения = Ложь;
	
	// Закомментирована, потому что не имеет смысла. Считается, что не распределенные строки заданий,
	// еще не имеют строк в маршруте, поэтому удалять ничего не надо. А распределенные строки заданий не распределяюся повторно.
	// УдалитьСтрокиИзМаршрутаПоЗаданиюНаПеревозку();
	
	// Добавляются строки с грузами и доп. работами по новому заданию
	ДобавитьСтрокиВМаршрутПоЗаданиюНаПеревозку(текСтрока, РаспределитьПоНепройденнымТочкам);
	
	ПересчитатьЗначенияМаршрута(текСтрока, Ложь);
			
КонецПроцедуры

Процедура ПересчитатьЗначенияМаршрута(текСтрока, Удалить)
	
	текПерваяМодифицированнаяТочка = Неопределено;
	
	Для каждого текТочка Из Маршрут Цикл
		текТочка.СтрокаНомер = текТочка.НомерСтроки;
		Если текТочка.ПересчитатьВременноеОкно Тогда
			ПересчитатьВременноеОкноТочки(текТочка, ?(Удалить, текСтрока, Неопределено));				
			текТочка.ПересчитатьВременноеОкно = Ложь;
		КонецЕсли;
		Если текПерваяМодифицированнаяТочка = Неопределено И текТочка.ПересчитатьПрибытиеУбытие Тогда
			текПерваяМодифицированнаяТочка = текТочка;
		КонецЕсли;
	КонецЦикла;
	
	УстановитьПредставлениеМаршурта();
		

	Если НЕ текПерваяМодифицированнаяТочка = Неопределено Тогда
		
		Если НЕ текТочка = Неопределено Тогда
			текИндекс = Маршрут.Индекс(текПерваяМодифицированнаяТочка);
			текАдресУбытия = Неопределено;
			Если текИндекс = 0 Тогда
				ПлановоеНачалоВыполненияРейса 	= ПлановоеНачалоВыполнения;
				ПлановоеНачалоВыполненияЗадания = текСтрока.ПлановоеВремяНачала;
				Если ЗначениеЗаполнено(ПлановоеНачалоВыполненияЗадания) И ЗначениеЗаполнено(ПлановоеНачалоВыполненияРейса) Тогда
					ПлановоеНачалоВыполнения = Мин(ПлановоеНачалоВыполненияЗадания, ПлановоеНачалоВыполненияРейса);
				ИначеЕсли ЗначениеЗаполнено(ПлановоеНачалоВыполненияЗадания) Тогда
					ПлановоеНачалоВыполнения = ПлановоеНачалоВыполненияЗадания;
				ИначеЕсли ЗначениеЗаполнено(ПлановоеНачалоВыполненияРейса) Тогда
					ПлановоеНачалоВыполнения = ПлановоеНачалоВыполненияРейса;	
				ИначеЕсли ЗначениеЗаполнено(Период) Тогда
					ПлановоеНачалоВыполнения = Период;	
				Иначе
					ПлановоеНачалоВыполнения = ТекущаяДатаСеанса();	
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(текПерваяМодифицированнаяТочка.ПлановоеПрибытие) Тогда
					текПерваяМодифицированнаяТочка.ПлановоеПрибытие = ПлановоеНачалоВыполнения;
				КонецЕсли;
			Иначе
				текПредыдущаяТочка = Маршрут.Получить(текИндекс - 1);
				текАдресУбытия     = текПредыдущаяТочка.Адрес;
				ПлановоеНачалоВыполнения = текПредыдущаяТочка.ПлановоеУбытие;
			КонецЕсли;
		СпланироватьЗадачиПоМаршруту(текИндекс,Ложь, Истина, Истина);			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

// Процедура - проверяет измененные поля строки маршрута.
//
Процедура ОбработатьИзменениеСтрокиМаршрута(НомерСтроки, НоваяСтрока = Ложь, Удалить = Ложь, ОтменаРедактирования = Ложь, Отказ, мсвВыделенныеСтроки = Неопределено, ПересчитыватьПредыдущиеТочки = Истина) Экспорт
	
	ИндексСтроки	= НомерСтроки - 1;
	текТочка = Маршрут.Получить(ИндексСтроки);

	Если Не Удалить Тогда
		// Ищутся поля с измененными значениями
		сткИзмененныеПоля = Новый Структура;
		Для каждого текПоле Из сткЗначенияСтрокиМаршрутаДоРедактирования Цикл
			Если Не текТочка[текПоле.Ключ] = текПоле.Значение Тогда
				сткИзмененныеПоля.Вставить(текПоле.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		ПопадаетВоВременноеОкноЗначениеДоИзменения = текТочка.ПопадаетВоВременноеОкно;
		
		Если Не ЗначениеЗаполнено(текТочка.ВременноеОкноНачало) И Не ЗначениеЗаполнено(текТочка.ВременноеОкноОкончание) Тогда
			текТочка.ПопадаетВоВременноеОкно = Истина;
		ИначеЕсли Не ЗначениеЗаполнено(текТочка.ВременноеОкноНачало) И текТочка.ПлановоеУбытие - 60 <= текТочка.ВременноеОкноОкончание Тогда
			текТочка.ПопадаетВоВременноеОкно = Истина;
		ИначеЕсли Не ЗначениеЗаполнено(текТочка.ВременноеОкноОкончание) И текТочка.ПлановоеПрибытие + текТочка.ВремяОжиданияВТочке*3600 + 60 >= текТочка.ВременноеОкноНачало Тогда
			текТочка.ПопадаетВоВременноеОкно = Истина;
		ИначеЕсли текТочка.ПлановоеУбытие - 60 <= текТочка.ВременноеОкноОкончание И текТочка.ПлановоеПрибытие + текТочка.ВремяОжиданияВТочке*3600 + 60 >= текТочка.ВременноеОкноНачало Тогда
			текТочка.ПопадаетВоВременноеОкно = Истина;
		Иначе
			текТочка.ПопадаетВоВременноеОкно = Ложь;	
		КонецЕсли;
		
		Если НЕ ПопадаетВоВременноеОкноЗначениеДоИзменения = текТочка.ПопадаетВоВременноеОкно Тогда
			УстановитьФлагПопадаетВоВременноеОкноПоЗаданиям(текТочка, текТочка.ПопадаетВоВременноеОкно);	
		КонецЕсли;
			
	КонецЕсли;	
	
	Если ОтменаРедактирования Тогда
		Если текТочка.СтрокаДокумента Тогда
			Маршрут.Удалить(Маршрут.Индекс(текТочка));
		Иначе	
			Для каждого текПоле Из сткИзмененныеПоля Цикл
				текТочка[текПоле.Ключ] = сткЗначенияСтрокиМаршрутаДоРедактирования[текПоле.Ключ];
			КонецЦикла;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	КонтрольДанныхМаршрута(текТочка, НомерСтроки, Отказ, сткИзмененныеПоля, Удалить);
			
	Если Отказ Тогда
		Возврат;
	Иначе
					
		Если Не Удалить Тогда
			Если Истина
				И НЕ НоваяСтрока 
				И (Ложь
				   Или сткИзмененныеПоля.Свойство("ПлановоеПрибытие") 
				   Или сткИзмененныеПоля.Свойство("ПлановоеУбытие")
				   Или сткИзмененныеПоля.Свойство("ПрибытиеФакт")
				   Или сткИзмененныеПоля.Свойство("УбытиеФакт")
				   Или сткИзмененныеПоля.Свойство("Адрес")) Тогда
				СпланироватьЗадачиПоМаршруту(НомерСтроки - 1, ПересчитыватьПредыдущиеТочки,Ложь,Истина);
			КонецЕсли;
			УстановитьПредставлениеМаршурта();
		КонецЕсли;
	КонецЕсли;
    	
КонецПроцедуры

// Процедура - проверяет измененные поля строки работы.
//
Процедура ОбработатьИзменениеСтрокиРаботы(НомерСтрокиРабота, НомерСтрокиТочка, НоваяСтрока = Ложь, Удалить = Ложь, ОтменаРедактирования = Ложь, Отказ, мсвВыделенныеСтроки = Неопределено, сткВосстановлениеСтроки = Неопределено, ПересчитыватьПредыдущиеТочки = Истина, ПересчитыватьТекущуюТочку = Ложь, ПерепланироватьРаботыМаршрута = Истина) Экспорт
	
	Если НЕ сткВосстановлениеСтроки = Неопределено Тогда
		ВосстановитьТочкуРазгрузки(сткВосстановлениеСтроки);	
	КонецЕсли;

	текРабота = Работы.Получить(НомерСтрокиРабота - 1);
	текТочка  = Маршрут.Получить(НомерСтрокиТочка - 1); 
		
	Если НЕ Удалить Тогда
		// Ищутся поля с измененными значениями
		сткИзмененныеПоля = Новый Структура;
		Для каждого текПоле Из сткЗначенияСтрокиРаботДоРедактирования Цикл
			Если НЕ текРабота[текПоле.Ключ] = текПоле.Значение Тогда
				сткИзмененныеПоля.Вставить(текПоле.Ключ);
			КонецЕсли;
		КонецЦикла;
		
		Если сткИзмененныеПоля.Свойство("ВремяРабот") Тогда
			текРабота.ВремяРабот = сткЗначенияСтрокиРаботДоРедактирования.ВремяРабот;
		КонецЕсли; 
		
		Если Ложь
			Или сткИзмененныеПоля.Свойство("Проблема")
			Или сткИзмененныеПоля.Свойство("АдресРазгрузки")
			Или сткИзмененныеПоля.Свойство("ГрузРазделен") 
		Тогда
			
			Если Истина
				И ЗначениеЗаполнено(текРабота.АдресРазгрузки) 
				И НЕ ЗначениеЗаполнено(текРабота.Проблема) 
			Тогда
				ТекстСообщения = Нстр("ru = 'Не заполнена проблема'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Отказ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
			
			Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(текРабота.Операция) Тогда
				текРабота.Отменена 	= ЗначениеЗаполнено(текРабота.Проблема) ИЛИ текРабота.ГрузРазделен;
				текРабота.Выполнена = Ложь;
				
				
			ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(текРабота.Операция) Тогда
				текРабота.Отменена 	= Ложь
				                      Или (Истина
								       И ЗначениеЗаполнено(текРабота.Проблема) 
									  И (Ложь
									     Или ЗначениеЗаполнено(текРабота.АдресРазгрузки) 
										Или текРабота.ЗапрещеноСозданиеНовойТочкиМаршрута)) 
								  Или текРабота.ГрузРазделен;	
				текРабота.Выполнена = Ложь; 
				
			КонецЕсли;
						
			Если текРабота.Отменена <> текТочка.Отменена Тогда
				
				// Проверить, не надо ли отменять точку
				мсвРабот = Работы.НайтиСтроки(Новый Структура("Идентификатор", текРабота.Идентификатор));
				ИзменитьСтатусТочки = Истина;
				ЭтоДосрочноПройденнаяТочка = Ложь;
				
				Для каждого ЭлементРабота Из мсвРабот Цикл
					
					ЭтоДосрочноПройденнаяТочка = ЭтоДосрочноПройденнаяТочка Или ЭлементРабота.Проблема = Справочники.упПроблемы.ДосрочноеПрохождение;
					Если ЭлементРабота.Отменена <> текРабота.Отменена Тогда
						ИзменитьСтатусТочки = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если ИзменитьСтатусТочки Тогда
					Если ЭтоДосрочноПройденнаяТочка Тогда
						текТочка.Отменена = Ложь;
						текТочка.Пройдена = Истина;
					Иначе	
                              текТочка.Отменена = текРабота.Отменена;
						текТочка.Пройдена = Ложь;

					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(текРабота.Операция) Тогда
				ПустыеГрузовыеМеста = ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса;					   
				Если ПустыеГрузовыеМеста Тогда
					мсвРабот = Работы.НайтиСтроки(Новый Структура("Задание, Операция", текРабота.Задание, текРабота.Операция));
				Иначе	
					мсвРабот = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Операция", текРабота.Задание, текРабота.ГрузовоеМесто, текРабота.Операция));	
				КонецЕсли;
				
				ИзменитьСтатусЗадания = Истина;
				Проблема	= Справочники.упПроблемы.ПустаяСсылка();
				Для каждого ЭлементРабота Из мсвРабот Цикл
					
					Если ЭлементРабота.Отменена <> текРабота.Отменена Тогда
						ИзменитьСтатусЗадания = Ложь;
					КонецЕсли;
					
					Проблема	= ЭлементРабота.Проблема;
				КонецЦикла;
				
				Если ИзменитьСтатусЗадания Тогда
					Если ПустыеГрузовыеМеста Тогда
						мсвСтрокиЗадание = Задания.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", текРабота.Задание, Справочники.упГрузовыеМеста.ПустаяСсылка()));
						Если мсвСтрокиЗадание.Количество() > 0 Тогда
							СтрокаЗадание = мсвСтрокиЗадание[0];
							Если НЕ текРабота.Отменена = СтрокаЗадание.Отменено Тогда
								СтрокаЗадание.Отменено = текРабота.Отменена;
								Если СтрокаЗадание.Отменено Тогда
									СтрокаЗадание.Проблема = Проблема;
								Иначе	
									СтрокаЗадание.Проблема = Справочники.упПроблемы.ПустаяСсылка();
								КонецЕсли;
							КонецЕсли;	
						КонецЕсли;
					Иначе
						// Анализируются строки по каждому грузовому месту задания.
						// 
						мсвСтрокиЗадание = Задания.НайтиСтроки(Новый Структура("Задание", текРабота.Задание, Справочники.упГрузовыеМеста.ПустаяСсылка()));
						Если мсвСтрокиЗадание.Количество() > 0 Тогда
							Для каждого СтрокаЗадание Из мсвСтрокиЗадание Цикл
								
								мсвРаботы = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Операция", текРабота.Задание, СтрокаЗадание.ГрузовоеМесто, упПрохождениеТочкиКлиентСервер.ОперацияПогрузкиПоГрузовомуМесту(СтрокаЗадание.ГрузовоеМесто)));
								Если мсвРаботы.Количество() > 0 Тогда
									текРабота = мсвРаботы[0];
									Если НЕ текРабота.Отменена = СтрокаЗадание.Отменено Тогда
										СтрокаЗадание.Отменено = текРабота.Отменена;
										Если СтрокаЗадание.Отменено Тогда
											СтрокаЗадание.Проблема = Проблема;
										Иначе	
											СтрокаЗадание.Проблема = Справочники.упПроблемы.ПустаяСсылка();
										КонецЕсли;
									КонецЕсли;	
								КонецЕсли;

							КонецЦикла;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
		
	// Если отмена редактирования 
	Если ОтменаРедактирования Тогда
		Если текРабота.СтрокаДокумента И НоваяСтрока Тогда
			Работы.Удалить(Работы.Индекс(текРабота));
		Иначе	
			Для каждого текПоле Из сткИзмененныеПоля Цикл
				текРабота[текПоле.Ключ] = сткЗначенияСтрокиРаботДоРедактирования[текПоле.Ключ];
			КонецЦикла;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ДобавитьСтрокуВТЧЗадания	= Ложь;
	ПроверитьНаличиеСтрокПоЗаданиюВМаршруте = Ложь;
		
	Если Удалить Тогда
		ПроверитьНаличиеСтрокПоЗаданиюВМаршруте = Истина;
	КонецЕсли;

	Если Не Удалить Тогда
		
		// Если изменили тип операции
		Если сткИзмененныеПоля.Свойство("Операция") Тогда
			
			Если текРабота.Операция <> ПредопределенноеЗначение("Перечисление.упТипыОпераций.ДополнительнаяОперация") Тогда
				текРабота.ДополнительнаяОперация = Неопределено;
				текРабота.КоличествоДопОпераций = 0;
			КонецЕсли;
			
			Если Истина
				И текРабота.Операция <> ПредопределенноеЗначение("Перечисление.упТипыОпераций.ПолучениеДокументов") 
				И текРабота.Операция <> ПредопределенноеЗначение("Перечисление.упТипыОпераций.ПередачаДокументов")
			Тогда
				текРабота.ТипРегламентногоДокумента = Неопределено;
				текРабота.КоличествоЭкземпляровДокумента = 0;
			КонецЕсли; 
		КонецЕсли;
		
		// Если изменили доп. операцию
		Если сткИзмененныеПоля.Свойство("ДополнительнаяОперация") Или сткИзмененныеПоля.Свойство("КоличествоДопОпераций") Тогда
			Если ЗначениеЗаполнено(текРабота.ДополнительнаяОперация) Тогда
				текРабота.ВремяРабот = упСервисныеФункцииВызовСервера.ЗначениеРеквизитаОбъекта(текРабота.ДополнительнаяОперация, "ВремяВыполненияОперации")*текРабота.КоличествоДопОпераций;
			Иначе
				текРабота.ВремяРабот = 0;
			КонецЕсли;
		КонецЕсли;
		
		//// Сбросить флаг новой строки
		//Если текРабота.СтрокаДокумента Тогда
		//	текРабота.СтрокаДокумента = Ложь;
		//КонецЕсли;
 	
	КонецЕсли;
			
	УдалитьСтрокуИзТЧЗадания	= Ложь;
	
	Если ПроверитьНаличиеСтрокПоЗаданиюВМаршруте Тогда
		УдалитьСтрокуИзТЧЗадания = УдалитьСтрокуИзМаршрута(текРабота, мсвВыделенныеСтроки); // Проверка наличия строк по тек. заданию в точке, если их нет удалить доп. работы
	КонецЕсли;
	
	Если УдалитьСтрокуИзТЧЗадания Тогда
		мсвСтроки	= Задания.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", сткЗначенияСтрокиРаботДоРедактирования.Задание, сткЗначенияСтрокиРаботДоРедактирования.ГрузовоеМесто)); 
		Если мсвСтроки.Количество() > 0 Тогда
			Для каждого текСтрокаЗадание  Из мсвСтроки Цикл
				Задания.Удалить(Задания.Индекс(текСтрокаЗадание));
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(текТочка.Адрес) И ПерепланироватьРаботыМаршрута Тогда
		СпланироватьРаботыПоМаршруту(НомерСтрокиТочка -1, ПересчитыватьПредыдущиеТочки, ПересчитыватьТекущуюТочку);				
	КонецЕсли;
			
КонецПроцедуры

Процедура УстановитьФлагПопадаетВоВременноеОкноПоЗаданиям(Точка, ФлагПопадаетВоВременноеОкно)
	
	РаботыПоТочке = Работы.НайтиСтроки(Новый Структура("Идентификатор", Точка.Идентификатор));
	ПустыеГрузовыеМеста = ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса;					   
	
	тбзЗаданияГрузовыеМестаПоТочке = Новый ТаблицаЗначений;
	тбзЗаданияГрузовыеМестаПоТочке.Колонки.Добавить("Задание", 		Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	тбзЗаданияГрузовыеМестаПоТочке.Колонки.Добавить("ГрузовоеМесто",Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	Для каждого СтрокаРабота Из РаботыПоТочке Цикл
		Если упПрохождениеТочкиКлиентСервер.ОсновнаяОперация(СтрокаРабота.Операция) Тогда
			НоваяСтрока 	= тбзЗаданияГрузовыеМестаПоТочке.Добавить();
			НоваяСтрока.Задание = СтрокаРабота.Задание;
			НоваяСтрока.ГрузовоеМесто = ?(ПустыеГрузовыеМеста,Справочники.упГрузовыеМеста.ПустаяСсылка(),СтрокаРабота.ГрузовоеМесто);
		КонецЕсли;
	КонецЦикла;
	
	тбзЗаданияГрузовыеМестаПоТочке.Свернуть("Задание, ГрузовоеМесто");
	
	// Если интервал по точке не попадает во временное окно
	Если НЕ ФлагПопадаетВоВременноеОкно Тогда
		
		// Установить всем заданиям в точке флаг не попадает
		Для каждого СтрокаЗадание Из тбзЗаданияГрузовыеМестаПоТочке Цикл
			мсвСтрокиЗадания = Задания.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто",СтрокаЗадание.Задание, СтрокаЗадание.ГрузовоеМесто));
			Для каждого СтрокаЗадание Из мсвСтрокиЗадания Цикл
				СтрокаЗадание.ПопадаетВоВременноеОкно = Ложь;
			КонецЦикла;
		КонецЦикла;
		
	Иначе
		// Пересчитать по всем точкам заданий текущей точки попадание во временное окно
		Для каждого СтрокаЗадание Из тбзЗаданияГрузовыеМестаПоТочке Цикл
			
			// Берутся все работы по заданию/грузовому месту
			Если ПустыеГрузовыеМеста Тогда
				мсвРаботыПоЗаданию = Работы.НайтиСтроки(Новый Структура("Задание", СтрокаЗадание.Задание));	
			Иначе	
				мсвРаботыПоЗаданию = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", СтрокаЗадание.Задание, СтрокаЗадание.ГрузовоеМесто));	
			КонецЕсли;
			
			мсвИдентификаторовТочек = Новый Массив;
			ПопадаетВоВременноеОкно = Истина;
			
			Для каждого СтрокаРабота Из мсвРаботыПоЗаданию Цикл
				
				// Для каждой работы по заданию проверяется точка
				Если мсвИдентификаторовТочек.Найти(СтрокаРабота.Идентификатор) = Неопределено Тогда
					мсвТочки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", СтрокаРабота.Идентификатор));
					Если мсвТочки.Количество() > 0 Тогда
						ПопадаетВоВременноеОкно = мсвТочки[0].ПопадаетВоВременноеОкно И ПопадаетВоВременноеОкно;
					КонецЕсли;
					мсвИдентификаторовТочек.Добавить(СтрокаРабота.Идентификатор);
				КонецЕсли;
				
				// Если хотя бы одна точка не попадает во временное окно
				Если Не ПопадаетВоВременноеОкно Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
						
			мсвСтрокиЗадания = Задания.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто",СтрокаЗадание.Задание, СтрокаЗадание.ГрузовоеМесто));
			Для каждого СтрокаЗадание Из мсвСтрокиЗадания Цикл
				СтрокаЗадание.ПопадаетВоВременноеОкно = ПопадаетВоВременноеОкно;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Область Маршрут

Процедура СдвинутьСтрокуМаршрута(Знач НоваяПозицияВМаршруте, Отказ, Знач СтрокаМаршрута, СмещениеВперед = 0)
	
	КоличествоСдвигов = Маршрут.Индекс(СтрокаМаршрута) + 1 - НоваяПозицияВМаршруте + СмещениеВперед;
	СдвигВверх = КоличествоСдвигов < 0;
	Для Счетчик = 1 По КоличествоСдвигов Цикл
		ОбработатьСдвигТочкиМаршрута(СтрокаМаршрута.НомерСтроки, СдвигВверх, Ложь, Отказ);
		Если Отказ Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;

КонецПроцедуры

// Процедура - заполняем данные строки добавленную в таблицу маршрутов.
//
Процедура ОбработатьДобавлениеТочкиВМаршрут(МаршрутНомерСтроки, ТипТочки = Неопределено, Отказ) Экспорт
	
	Если МаршрутНомерСтроки < 1 Тогда
		ТекстСообщения = Нстр("ru = 'Строки с номером %1 не существует'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, МаршрутНомерСтроки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	СтрокаМаршрута = Маршрут.Получить(МаршрутНомерСтроки - 1);
	СтрокаМаршрута.Идентификатор = Новый УникальныйИдентификатор;
	СтрокаМаршрута.СтрокаНомер = МаршрутНомерСтроки;
	СтрокаМаршрута.СтрокаДокумента = Истина;
	Если ЗначениеЗаполнено(ТипТочки) Тогда
		СтрокаМаршрута.ТипТочки = ТипТочки;	
		СтрокаМаршрута.ИндексКартинки = упПрохождениеТочкиКлиентСервер.ИндексКартинкиТочки(ТипТочки);
	КонецЕсли;
	
	мсвПредшественников = Новый Массив;
	Для каждого текСтрокаМаршрута Из Маршрут Цикл
		текСтрокаМаршрута.Предшественники = СтрСоединить(мсвПредшественников, ",");
		мсвПредшественников.Добавить(текСтрокаМаршрута.Идентификатор);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаМаршрута.Адрес) Тогда
		СпланироватьЗадачиПоМаршруту(МаршрутНомерСтроки - 1, Ложь, Истина);	
	КонецЕсли;
			
КонецПроцедуры

// Функция - возвращает идентификатор строки, после изменения положения строки в таблице.
//
Функция ОбработатьСдвигТочкиМаршрута(МаршрутНомерСтроки, СдвигВверх = Истина, ПересчитыватьПредыдущиеТочки = Истина, Отказ) Экспорт
	
	текРезультат = Неопределено;
	
	Если МаршрутНомерСтроки < 1 Тогда
		ТекстСообщения = Нстр("ru = 'Строки с номером %1 не существует'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, МаршрутНомерСтроки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат текРезультат;
	КонецЕсли;
	
	СтрокаМаршрута = Маршрут.Получить(МаршрутНомерСтроки - 1);
	
	Если Ложь
		Или СтрокаМаршрута = Неопределено
		Или НЕ ЗначениеЗаполнено(СтрокаМаршрута.Адрес) 
		Или СтрокаМаршрута.ТипТочки = ПредопределенноеЗначение("Перечисление.упТипыТочекМаршрута.ТочкаОтправления")
		Или СтрокаМаршрута.ТипТочки = ПредопределенноеЗначение("Перечисление.упТипыТочекМаршрута.ТочкаЗавершения") 
	Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	Если Не Отказ Тогда
		КоличествоСтрокМаршрута = Маршрут.Количество();
		
		Если СдвигВверх Тогда
			Если СтрокаМаршрута.СтрокаНомер = 1 Тогда
				Отказ = Истина;	
			КонецЕсли;
		Иначе	
			Если СтрокаМаршрута.СтрокаНомер = КоличествоСтрокМаршрута Тогда
				Отказ = Истина;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Отказ Тогда
		СтрокаОбмена = Маршрут.Получить(?(СдвигВверх, МаршрутНомерСтроки - 2,МаршрутНомерСтроки));
		
		Маршрут.Сдвинуть(СтрокаМаршрута, ?(СдвигВверх, -1, 1));
		ИндексТочкиПересчета = ?(СдвигВверх, СтрокаМаршрута.НомерСтроки - 1, СтрокаМаршрута.НомерСтроки - 2); 
		Если ИндексТочкиПересчета < 0 Тогда
			ИндексТочкиПересчета = 0;
		КонецЕсли;

		СтрокаМаршрута.СтрокаНомер = СтрокаМаршрута.НомерСтроки;
		текРезультат = СтрокаМаршрута.СтрокаНомер - 1;
		СтрокаОбмена.СтрокаНомер = СтрокаОбмена.НомерСтроки;
	
		//мсвПредшественников = Новый Массив;
		//Если СтрокаМаршрута.НомерСтроки > 1 Тогда
		//	ПредыдущаяСтрока = Маршрут.Получить(СтрокаМаршрута.НомерСтроки - 2);
		//	мсвПредшественников = СтрРазделить(ПредыдущаяСтрока.Предшественники, ",");
		//	мсвПредшественников.Добавить(ПредыдущаяСтрока.Идентификатор);
		//КонецЕсли;
						
		// Для всех точек, начиная со сдвинутой 
		Для ИндексСтроки = ИндексТочкиПересчета По КоличествоСтрокМаршрута - 1 Цикл
			текСтрокаМаршрута = Маршрут.Получить(ИндексСтроки);	
			
			// Обнуляется время до предыдущей точки
			текСтрокаМаршрута.ВремяОтПредыдущейТочки = 0;
			//текСтрокаМаршрута.Предшественники = СтрСоединить(мсвПредшественников, ",");
			//мсвПредшественников.Добавить(текСтрокаМаршрута.Идентификатор);
			текСтрокаМаршрута.РасстояниеОтПредыдущейТочки = 0;
		КонецЦикла;
						
		СпланироватьЗадачиПоМаршруту(ИндексТочкиПересчета,ПересчитыватьПредыдущиеТочки, Истина);
			
	КонецЕсли;
	
	Возврат текРезультат
	
КонецФункции

// Процедура - устанавливает значение "Выполнена" у строки.
//
Процедура ОбработатьИзменениеСтатусаТочки(ИдентификаторТочки, Отказ) Экспорт
	
	мсвСтрокиМаршрута = Маршрут.НайтиСтроки(Новый Структура("Идентификатор",ИдентификаторТочки));
	
	СтрокаТочка = Неопределено;
	
	Если мсвСтрокиМаршрута.Количество() > 0  Тогда
		СтрокаТочка = мсвСтрокиМаршрута[0];
	КонецЕсли;

	мсвСтрокиРаботы = Работы.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочки));
	
	Для каждого СтрокаРаботы Из мсвСтрокиРаботы Цикл
		СтрокаРаботы.Выполнена = НЕ СтрокаРаботы.Отменена И СтрокаТочка.Пройдена;
	КонецЦикла;
		
КонецПроцедуры

// Процедура - скрывает все пройденные маршруты. 
//
Процедура ОбработатьУдалениеТочки() Экспорт
	
	СпланироватьРаботыПоМаршруту();
	УстановитьПредставлениеМаршурта();
	
КонецПроцедуры

// Функция - добавляет точку в таблицу маршрутов.
//
Функция ДобавитьТочкуВМаршрут(ТипТочки = Неопределено, сткПараметры = Неопределено, ИндексНовойСтроки = Неопределено, ИдентификаторТочки = Неопределено) Экспорт
	
	СтрокаМаршрута = Неопределено;
	ЭтоНоваяСтрока = Истина;
	
	Если ИндексНовойСтроки <> Неопределено Тогда
		СтрокаМаршрута = Маршрут.Вставить(ИндексНовойСтроки);
		// Пересчитать номера строк маршрута
		Для й = СтрокаМаршрута.НомерСтроки По Маршрут.Количество() Цикл
			Строка = Маршрут.Получить(й-1);
			Строка.СтрокаНомер = Строка.НомерСтроки;
		КонецЦикла;

	ИначеЕсли ЗначениеЗаполнено(ИдентификаторТочки) Тогда 	
		мсвТочки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочки));	
		Если мсвТочки.Количество() > 0 Тогда
			СтрокаМаршрута = мсвТочки[0];	
		КонецЕсли; 
		ЭтоНоваяСтрока = Ложь;
	Иначе	
		СтрокаМаршрута = Маршрут.Добавить();
	КонецЕсли;
	
	Если ЭтоНоваяСтрока Тогда
		ИдентификаторТочки = Новый УникальныйИдентификатор; 
		СтрокаМаршрута.Идентификатор = ИдентификаторТочки;
		СтрокаМаршрута.СтрокаНомер = СтрокаМаршрута.НомерСтроки;
		Если ЗначениеЗаполнено(ТипТочки) Тогда
			СтрокаМаршрута.ТипТочки = ТипТочки;	
			СтрокаМаршрута.ИндексКартинки = упПрохождениеТочкиКлиентСервер.ИндексКартинкиТочки(ТипТочки);
		КонецЕсли;
	КонецЕсли;
	
	СтрокаМаршрута.СтрокаДокумента = Истина;	

	Если Истина 
		И сткПараметры <> Неопределено 
		И СтрокаМаршрута <> Неопределено 
	Тогда
		ЗаполнитьЗначенияСвойств(СтрокаМаршрута, сткПараметры);	
	КонецЕсли;
	
	// Пересчет предшественников при добавлении точек отправления/завершения.
	Если Истина
		И ЭтоНоваяСтрока 
		И ЗначениеЗаполнено(СтрокаМаршрута.Гараж)
	Тогда
		
		КоличествоСтрок = Маршрут.Количество();
		
		Если СтрокаМаршрута.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаОтправления Тогда
								
			Для ИндексСтроки = 1 По КоличествоСтрок - 1 Цикл
				Строка = Маршрут.Получить(ИндексСтроки);
				мсвПредшественники = СтрРазделить(Строка.Предшественники, ",", Ложь);
				мсвПредшественники.Вставить(0, СтрокаМаршрута.Идентификатор);
				Строка.Предшественники = СтрСоединить(мсвПредшественники, ",");
			КонецЦикла;
		
		ИначеЕсли СтрокаМаршрута.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаЗавершения Тогда
			
			мсвПредшественники = Новый Массив;
			
			Для ИндексСтроки = 0 По КоличествоСтрок - 2 Цикл
				Строка = Маршрут.Получить(ИндексСтроки);
				мсвПредшественники.Добавить(Строка.Идентификатор);
			КонецЦикла;
			
			СтрокаМаршрута.Предшественники = СтрСоединить(мсвПредшественники, ",");
			
		КонецЕсли;

	КонецЕсли; 
	
	Возврат СтрокаМаршрута.СтрокаНомер;

КонецФункции

Процедура ПодобратьКонтрольныеТочкиМаршрута() Экспорт
	
	ПодобранныеКонтрольныеТочки.Очистить();
	ПравилаПодбораТочек.Очистить();
	
	сткКонтрольныеТочки = упРейс.ПодобратьКонтрольныеТочкиМаршрута(Рейс);
	
	Если сткКонтрольныеТочки.ЕстьТочки Тогда
		ПодобранныеКонтрольныеТочки.Загрузить(сткКонтрольныеТочки.Точки);
		ПравилаПодбораТочек.Загрузить(сткКонтрольныеТочки.ПравилаВключенияПоЗвеньям);
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьПодобранныеКонтрольныеТочкиВМаршрут(ДополнительныеПараметры) Экспорт
	
	упРейс.ДобавитьПодобранныеКонтрольныеТочкиВМаршрут(Рейс, Маршрут, ПодобранныеКонтрольныеТочки, ПравилаПодбораТочек, ДополнительныеПараметры);
	
	Если ДополнительныеПараметры.СпланироватьЗадачиПоМаршруту Тогда
		ИндексТочкиПересчета = ДополнительныеПараметры.ИндексТочкиПересчета;
		Если ИндексТочкиПересчета <> Неопределено Тогда
			ПересчитыватьПредыдущиеТочки = ДополнительныеПараметры.ПересчитыватьПредыдущиеТочки;
			ПересчитыватьТекущуюТочку = Ложь;
			ПересчитыватьСледующиеТочки = ДополнительныеПараметры.ПересчитыватьСледующиеТочки;
			ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия = Ложь;
			СпланироватьРаботыПоМаршруту(ИндексТочкиПересчета, ПересчитыватьПредыдущиеТочки, ПересчитыватьТекущуюТочку,, ПересчитыватьСледующиеТочки, ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия);
			УстановитьПредставлениеМаршурта();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - удаляет точки с типом "ТочкаОтправления" и "ТочкаОтправления".
//
Процедура УдалитьТочкиОтправленияЗавершения() Экспорт
	мсвТочкиЗавершения	= Маршрут.НайтиСтроки(Новый Структура("ТипТочки", Перечисления.упТипыТочекМаршрута.ТочкаЗавершения));	
	мсвТочкиОтправления = Маршрут.НайтиСтроки(Новый Структура("ТипТочки", Перечисления.упТипыТочекМаршрута.ТочкаОтправления));
	Если мсвТочкиОтправления.Количество() Или мсвТочкиЗавершения.Количество() Тогда
		Если мсвТочкиОтправления.Количество() Тогда
			Точка  = мсвТочкиОтправления[0];
			// Удалить точку отправления из предшествеников всех точек маршрута
			Если ЗначениеЗаполнено(Точка.Гараж)
					И Точка.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаОтправления Тогда
				КоличествоСтрок 	= Маршрут.Количество();
				ИдентификаторТочки 	= Строка(Точка.Идентификатор);
				Для ИндексСтроки = 1 По КоличествоСтрок - 1 Цикл
					Строка = Маршрут.Получить(ИндексСтроки);
					Если СтрНайти(Строка.Предшественники, ИдентификаторТочки) > 0 Тогда
						мсвПредшественников = СтрРазделить(Строка.Предшественники,",");
						ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(мсвПредшественников, ИдентификаторТочки);
						Строка.Предшественники = СтрСоединить(мсвПредшественников, ",");
					КонецЕсли;					
				КонецЦикла;
			КонецЕсли;
			Маршрут.Удалить(Точка);
			Если Маршрут.Количество() Тогда
				НачалоМаршрута = Маршрут[0];
				НачалоМаршрута.РасстояниеОтПредыдущейТочки 	= 0;
				НачалоМаршрута.ВремяОтПредыдущейТочки 		= 0;
			КонецЕсли;
			ТекстСообщения = НСтр("ru = 'Выезд из гаража удален из маршрута'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если мсвТочкиЗавершения.Количество() Тогда
			Маршрут.Удалить(мсвТочкиЗавершения[0]);
			ТекстСообщения = НСтр("ru = 'Возвращение в гараж удален из маршрута'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		СпланироватьРаботыПоМаршруту();
		УстановитьПредставлениеМаршурта();
	КонецЕсли; 
КонецПроцедуры

// Процедура - обрабатывает таблицу маршрутов после измнения планового времени выполнения.
//
Процедура ОбработатьИзменениеПлановогоНачалаВыполнения() Экспорт
	
	Если Маршрут.Количество() > 0 Тогда
		Маршрут[0].ПлановоеПрибытие = ПлановоеНачалоВыполнения;
    	СпланироватьРаботыПоМаршруту();
	КонецЕсли;
		
КонецПроцедуры

// Процедура - обрабатывает таблицу маршрутов после измнения планового времени выполнения.
//
Процедура ОбработатьИзменениеФактическогоВремениВыполнения() Экспорт
	
	Если Маршрут.Количество() > 0 Тогда
		Для каждого СтрокаМаршрута Из Маршрут Цикл
			СтрокаМаршрута.ПрибытиеФакт 	= НачалоВыполнения;	
			СтрокаМаршрута.УбытиеФакт	= НачалоВыполнения;
		КонецЦикла;
		Маршрут[Маршрут.Количество() - 1].УбытиеФакт = ОкончаниеВыполнения;
	КонецЕсли;
		
КонецПроцедуры

// Процедура - заново обрабатывает весь маршрут после изменения адреса.
//
Процедура ОбработатьИзменениеАдресаМаршрута(НомерСтроки) Экспорт
	Если НомерСтроки > 0 Тогда
		СтрокаТочка = Маршрут.Получить(НомерСтроки - 1);
		Если СтрокаТочка.Адрес <> сткЗначенияСтрокиМаршрутаДоРедактирования.Адрес Тогда
			СпланироватьЗадачиПоМаршруту(НомерСтроки - 1,, Истина);
			сткЗначенияСтрокиМаршрутаДоРедактирования.Адрес = СтрокаТочка.Адрес;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Функция - возвращает массив изменений по ТС в маршруте.
//
Функция ОбработатьИзменениеТранспортногоСредстваРейса(ТранспортноеСредство, ЗонаПогрузки = Неопределено, ЗонаРазгрузки = Неопределено, ПодбиратьГаражи = Истина) Экспорт
	
	мсвРезультат = Новый Массив;

	Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
		
		сткРеквизитыТС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТранспортноеСредство, "АвтоматическиПодбиратьГаражВРейсе, АвтоматическиПодбиратьВозвращениеВГаражВРейсе, ТипТС.КоэффициентРасчетаВремениВПути");
		АвтоматическиПодбиратьГаражОтправления = сткРеквизитыТС.АвтоматическиПодбиратьГаражВРейсе;
		АвтоматическиПодбиратьГаражВозвращения = сткРеквизитыТС.АвтоматическиПодбиратьВозвращениеВГаражВРейсе;
		НовыйКоэффициентРасчетаВремениВПути = сткРеквизитыТС.ТипТСКоэффициентРасчетаВремениВПути;
		Если НовыйКоэффициентРасчетаВремениВПути = 0 Тогда
			НовыйКоэффициентРасчетаВремениВПути = 1;
		КонецЕсли;
		
		Если НЕ НовыйКоэффициентРасчетаВремениВПути = КоэффициентРасчетаВремениВПути Тогда
			КоэффициентРасчетаВремениВПути = НовыйКоэффициентРасчетаВремениВПути;
			
			// Пересчитывается время на всем маршруте
			СпланироватьРаботыПоМаршруту(0,Ложь,Ложь,,Истина);
			УстановитьПредставлениеМаршурта();
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПодбиратьГаражи Тогда
		Возврат мсвРезультат;
	КонецЕсли;
	
	// Обработка точек завершения
	ТекстВопроса 	= Неопределено;
	ИмяПроцедуры	= Неопределено;
	ДополнительныеПараметры = Неопределено;
	
	сткГаражи	= Справочники.упГаражи.ПодобратьГаражиДляТранспортногоСредства(ТранспортноеСредство, ЗонаПогрузки, ЗонаРазгрузки);
	мсвТочкиЗавершения	= Маршрут.НайтиСтроки(Новый Структура("ТипТочки", ПредопределенноеЗначение("Перечисление.упТипыТочекМаршрута.ТочкаЗавершения")));
	
	// Если у ТС есть гараж для зоны разгрузки.
	Если Истина
		И АвтоматическиПодбиратьГаражВозвращения
		И сткГаражи.АдресВозвращения <> Неопределено
	Тогда
		Если мсвТочкиЗавершения.Количество() Тогда
			
			ТочкаЗавершения = мсвТочкиЗавершения[0];
			Если ТочкаЗавершения.Гараж <> сткГаражи.ГаражВозвращения Тогда
				
				ТекстВопроса = НСтр(СтрШаблон("ru = 'У выбранного транспортного средства в зоне разгрузки есть привязка к гаражу ""%1"". Заменить гараж завершения?'", сткГаражи.ГаражВозвращения));
				ИмяПроцедуры = "ОбработатьВопросОДобавлениеТочки";
				ДополнительныеПараметры = Новый Структура();
				ДополнительныеПараметры.Вставить("Идентификатор", 				ТочкаЗавершения.Идентификатор);
				ДополнительныеПараметры.Вставить("СпланироватьЗадачиПоМаршруту", 	Истина);
				ДополнительныеПараметры.Вставить("Адрес", 						сткГаражи.АдресВозвращения);
				ДополнительныеПараметры.Вставить("Гараж", 						сткГаражи.ГаражВозвращения);
				ДополнительныеПараметры.Вставить("НачалоМаршрута", 				Ложь);
				
			КонецЕсли; 
		Иначе
			
			ТекстВопроса = НСтр(СтрШаблон("ru = 'У выбранного транспортного средства в зоне разгрузки есть привязка к гаражу ""%1"". Скорректировать маршрут с учетом возвращения в гараж?'", сткГаражи.ГаражВозвращения));
			ИмяПроцедуры = "ОбработатьВопросОДобавлениеТочки";
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("Идентификатор", 				Неопределено);
			ДополнительныеПараметры.Вставить("СпланироватьЗадачиПоМаршруту", 	Истина);
			ДополнительныеПараметры.Вставить("Адрес", 						сткГаражи.АдресВозвращения);
			ДополнительныеПараметры.Вставить("Гараж", 						сткГаражи.ГаражВозвращения);
			ДополнительныеПараметры.Вставить("НачалоМаршрута", 				Ложь);
			
		КонецЕсли;
				
	// Если гараж возвращения для ТС неопределён.
	Иначе
		
		Если мсвТочкиЗавершения.Количество() Тогда
			
			ТочкаЗавершения = мсвТочкиЗавершения[0];
			
			ТекстВопроса = НСтр(СтрШаблон("ru = 'У выбранного транспортного средства в зоне разгрузки нет привязки к гаражу ""%1"". Отменить возвращение в гараж по окончанию рейса?'", ТочкаЗавершения.Гараж));
			ИмяПроцедуры = "ОбработатьВопросОбУдаленииТочки";
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("Идентификатор", 				ТочкаЗавершения.Идентификатор);
			ДополнительныеПараметры.Вставить("СпланироватьЗадачиПоМаршруту", 	Ложь);
			
		КонецЕсли;			 
		
	КонецЕсли;
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("ИмяПроцедуры", 			ИмяПроцедуры);
	сткРезультат.Вставить("ДополнительныеПараметры", 	ДополнительныеПараметры);
	сткРезультат.Вставить("ТекстВопроса", 			ТекстВопроса);
	мсвРезультат.Добавить(сткРезультат);
	
	// Обработка точек отправления
	
	ТекстВопроса 	= Неопределено;
	ИмяПроцедуры	= Неопределено;
	ДополнительныеПараметры = Неопределено;
	
	мсвТочкиОтправления = Маршрут.НайтиСтроки(Новый Структура("ТипТочки", ПредопределенноеЗначение("Перечисление.упТипыТочекМаршрута.ТочкаОтправления")));
	
	// Если гараж отправления для ТС неопределён
	Если Истина
		И АвтоматическиПодбиратьГаражОтправления
		И сткГаражи.АдресВыезда <> Неопределено 
	Тогда
		
		Если мсвТочкиОтправления.Количество() Тогда
			ТочкаОтправления = мсвТочкиОтправления[0];
			
			Если мсвТочкиОтправления[0].Гараж <> сткГаражи.ГаражВыезда Тогда
				
				ТекстВопроса = НСтр(СтрШаблон("ru = 'У выбранного транспортного средства в зоне погрузки есть привязка к гаражу ""%1"". Заменить гараж отправления?'", сткГаражи.ГаражВыезда));
				ИмяПроцедуры = "ОбработатьВопросОДобавлениеТочки";
				ДополнительныеПараметры = Новый Структура();
				ДополнительныеПараметры.Вставить("Идентификатор", 				ТочкаОтправления.Идентификатор);
				ДополнительныеПараметры.Вставить("СпланироватьЗадачиПоМаршруту", 	Истина);//(сткГаражи.АдресВыезда = Неопределено И мсвТочкиЗавершения.Количество() = 0)
				ДополнительныеПараметры.Вставить("Адрес", 						сткГаражи.АдресВыезда);
				ДополнительныеПараметры.Вставить("Гараж", 						сткГаражи.ГаражВыезда);
				ДополнительныеПараметры.Вставить("НачалоМаршрута", 				Истина);
			КонецЕсли; 
		Иначе
			
			ТекстВопроса = НСтр(СтрШаблон("ru = 'У выбранного транспортного средства в зоне погрузки есть привязка к гаражу ""%1"". Скорректировать маршрут с учетом отправления из гаража?'", сткГаражи.ГаражВыезда));
			ИмяПроцедуры = "ОбработатьВопросОДобавлениеТочки";
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("Идентификатор", 				Неопределено);
			ДополнительныеПараметры.Вставить("СпланироватьЗадачиПоМаршруту", 	Истина); //(сткГаражи.АдресВыезда = Неопределено И мсвТочкиЗавершения.Количество() = 0)
			ДополнительныеПараметры.Вставить("Адрес", 						сткГаражи.АдресВыезда);
			ДополнительныеПараметры.Вставить("Гараж", 						сткГаражи.ГаражВыезда);
			ДополнительныеПараметры.Вставить("НачалоМаршрута", 				Истина);

		КонецЕсли;
	Иначе	 
		Если мсвТочкиОтправления.Количество() Тогда
			
			ТочкаОтправления = мсвТочкиОтправления[0];
			
			ТекстВопроса = НСтр(СтрШаблон("ru = 'У выбранного транспортного средства в зоне погрузки нет привязки к гаражу ""%1"". Отменить отправление из гаража в начале рейса?'", ТочкаОтправления.Гараж));
			ИмяПроцедуры = "ОбработатьВопросОбУдаленииТочки";
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("Идентификатор", 				ТочкаОтправления.Идентификатор);
			ДополнительныеПараметры.Вставить("СпланироватьЗадачиПоМаршруту", 	Истина);//(сткГаражи.АдресВыезда = Неопределено И мсвТочкиЗавершения.Количество() = 0)
			
		КонецЕсли;	
	КонецЕсли;

	сткРезультат = Новый Структура();
	сткРезультат.Вставить("ИмяПроцедуры", 			ИмяПроцедуры);
	сткРезультат.Вставить("ДополнительныеПараметры", 	ДополнительныеПараметры);
	сткРезультат.Вставить("ТекстВопроса", 			ТекстВопроса);
	мсвРезультат.Добавить(сткРезультат);
			
	Возврат мсвРезультат;
		
КонецФункции

// Функция - возвращает массив изменений по ТС в маршруте.
//
Процедура ОбработатьИзменениеТипаТранспортногоСредстваРейса(ТипТС) Экспорт
	
	НовыйКоэффициентРасчетаВремениВПути = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипТС, "КоэффициентРасчетаВремениВПути");
	Если НовыйКоэффициентРасчетаВремениВПути = 0 Тогда
		НовыйКоэффициентРасчетаВремениВПути = 1;
	КонецЕсли;
	
	Если НЕ НовыйКоэффициентРасчетаВремениВПути = КоэффициентРасчетаВремениВПути Тогда
		КоэффициентРасчетаВремениВПути = НовыйКоэффициентРасчетаВремениВПути;
		
		// Пересчитывается время на всем маршруте
		СпланироватьРаботыПоМаршруту(0,Ложь,Ложь,,Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - добавления новой точки в маршрут при изменении ТС.
//
Процедура ДобавитьТочкуПриИзмененииТранспортногоСредства(ДобавитьТочку, ДополнительныеПараметры) Экспорт
	
	ПересчитыватьПредыдущиеТочки 	= Ложь;
	ПересчитыватьТекущуюТочку 	= Ложь;
	ПересчитыватьСледующиеТочки 	= Ложь;
	ИндексТочкиПересчета 		= -1;
	Если ДобавитьТочку Тогда
		Если ДополнительныеПараметры.НачалоМаршрута Тогда
			Если ДополнительныеПараметры.Идентификатор = Неопределено Тогда
				сткПараметры = Новый Структура();
				сткПараметры.Вставить("Адрес", ДополнительныеПараметры.Адрес);
				сткПараметры.Вставить("Гараж", ДополнительныеПараметры.Гараж);
				сткПараметры.Вставить("ПлановоеУбытие", ПлановоеНачалоВыполнения);
				СтрокаНомер = ДобавитьТочкуВМаршрут(Перечисления.упТипыТочекМаршрута.ТочкаОтправления, сткПараметры, 0);
			Иначе
				сткПараметры = Новый Структура();
				сткПараметры.Вставить("Адрес", ДополнительныеПараметры.Адрес);
				сткПараметры.Вставить("Гараж", ДополнительныеПараметры.Гараж);
				СтрокаНомер = ДобавитьТочкуВМаршрут(,сткПараметры,,ДополнительныеПараметры.Идентификатор);
			КонецЕсли;
			
			ПересчитыватьПредыдущиеТочки = Истина;
			ПересчитыватьТекущуюТочку = Ложь;
			ПересчитыватьСледующиеТочки = Ложь;
			ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия = Истина;
			ИндексТочкиПересчета = СтрокаНомер;
			
		Иначе
			Если ДополнительныеПараметры.Идентификатор = Неопределено Тогда
				сткПараметры = Новый Структура();
				сткПараметры.Вставить("Адрес", ДополнительныеПараметры.Адрес);
				сткПараметры.Вставить("Гараж", ДополнительныеПараметры.Гараж);
				СтрокаНомер = ДобавитьТочкуВМаршрут(Перечисления.упТипыТочекМаршрута.ТочкаЗавершения, сткПараметры);
			Иначе
				сткПараметры = Новый Структура();
				сткПараметры.Вставить("Адрес", ДополнительныеПараметры.Адрес);
				сткПараметры.Вставить("Гараж", ДополнительныеПараметры.Гараж);
				СтрокаНомер = ДобавитьТочкуВМаршрут(,сткПараметры,,ДополнительныеПараметры.Идентификатор);
			КонецЕсли;
			
			ПересчитыватьПредыдущиеТочки = Ложь;
			ПересчитыватьТекущуюТочку = Ложь;
			ПересчитыватьСледующиеТочки = Истина;
			ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия = Ложь;
			ИндексТочкиПересчета = СтрокаНомер - 2;
		
		КонецЕсли; 
	КонецЕсли;
	
	Если ДополнительныеПараметры.СпланироватьЗадачиПоМаршруту Тогда
		Если ИндексТочкиПересчета >= 0 Тогда
			СпланироватьРаботыПоМаршруту(ИндексТочкиПересчета, ПересчитыватьПредыдущиеТочки, ПересчитыватьТекущуюТочку,, ПересчитыватьСледующиеТочки, ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия);
			УстановитьПредставлениеМаршурта();
		КонецЕсли;
	КонецЕсли; 
		
КонецПроцедуры

// Процедура - удаления новой точки из маршрута при изменении ТС.
//
Процедура УдалитьТочкуПриИзмененииТранспортногоСредства(УдалитьТочку, ДополнительныеПараметры) Экспорт
	
	Если УдалитьТочку Тогда
		мсвТочки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", ДополнительныеПараметры.Идентификатор));
		Если мсвТочки.Количество() > 0 Тогда
			Точка  = мсвТочки[0];
			
			// Удалить точку отправления из предшествеников всех точек маршрута
			Если ЗначениеЗаполнено(Точка.Гараж)
					И Точка.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаОтправления Тогда
				КоличествоСтрок 	= Маршрут.Количество();
				ИдентификаторТочки 	= Строка(Точка.Идентификатор);
				Для ИндексСтроки = 1 По КоличествоСтрок - 1 Цикл
					Строка = Маршрут.Получить(ИндексСтроки);
					Если СтрНайти(Строка.Предшественники, ИдентификаторТочки) > 0 Тогда
						мсвПредшественников = СтрРазделить(Строка.Предшественники,",");
						ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(мсвПредшественников, ИдентификаторТочки);
						Строка.Предшественники = СтрСоединить(мсвПредшественников, ",");
					КонецЕсли;					
				КонецЦикла;
			КонецЕсли;
			
			Маршрут.Удалить(Точка);
			Если Маршрут.Количество() > 0 Тогда
				НачалоМаршрута = Маршрут[0];
				НачалоМаршрута.РасстояниеОтПредыдущейТочки 	= 0;
				НачалоМаршрута.ВремяОтПредыдущейТочки 		= 0;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 

	Если ДополнительныеПараметры.СпланироватьЗадачиПоМаршруту Тогда
		СпланироватьРаботыПоМаршруту(0,Ложь,Ложь, ,Ложь);
		УстановитьПредставлениеМаршурта();
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - производит пересчет времени по точкам маршрута.
//
Процедура СпланироватьЗадачиПоМаршруту(ИндексСтрокиМаршрута, ПересчитыватьПредыдущиеТочки = Истина, ПересчитыватьТекущуюТочку = Ложь, ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия = Ложь) Экспорт
	
	текИндексТочки = ИндексСтрокиМаршрута;
	Если ПересчитыватьТекущуюТочку Тогда
		текИндексТочки = ?(ИндексСтрокиМаршрута > 0, ИндексСтрокиМаршрута - 1, ИндексСтрокиМаршрута);
	КонецЕсли;
	
	ВызыватьМаршрутизацию = Ложь;
	Если ЗначениеЗаполнено(ВидПеревозки) Тогда
		ВызыватьМаршрутизацию = ВидПеревозки.ОбращатьсяКМаршрутизаторуПриИзмененииМаршрутаКорректировкойРейса;
	КонецЕсли;
	
	упЗаданиеНаПеревозкуВызовСервера.СпланироватьЗадачиПоМаршруту(Маршрут, Работы, текИндексТочки, , , ВызыватьМаршрутизацию, , 
																		ПересчитыватьПредыдущиеТочки, ПересчитыватьТекущуюТочку,,
																		ПересчитыватьПлановоеВремяПосещенияТочекМаршрута, 
																		ДопустимыйПериодРассогласованностиСФактическимиДанными,
																		ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия,
																		ВидПеревозки,
																		КоэффициентРасчетаВремениВПути,, Рейс);
	ЗаполнитьРеквизитыПредставления();  
	Если Маршрут.Количество() Тогда        
		ПлановоеНачалоВыполнения    = Маршрут[0].ПлановоеПрибытие;
		ПлановоеОкончаниеВыполнения = Маршрут[Маршрут.Количество() - 1].ПлановоеУбытие;
		
		Если СпособПрохожденияТочекМаршрута = Перечисления.упСпособыПрохожденияТочекМаршрута.ВРейсе Тогда
			НачалоВыполнения = Маршрут[0].ПрибытиеФакт;
			ОкончаниеВыполнения = Маршрут[Маршрут.Количество() - 1].УбытиеФакт;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - производит пересчет времени по всем работам.
//
Процедура ПересчитатьДанныеРаботы(сткИзмененныеПоля, Строка = Неопределено, НомерСтроки = Неопределено) Экспорт
	
	Если Строка = Неопределено Тогда
		Строка =  Работы.Получить(НомерСтроки - 1);
	КонецЕсли;
	
	сткПересчитываемыеПоказатели	= Новый Структура;
	ИскомыеСтроки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", Строка.Идентификатор));
	текТочка = ИскомыеСтроки[0];
	
	сткИсходныеДанные				= Новый Структура("Задание, Операция, ДополнительнаяОперация, ГрузовоеМесто, КоличествоГрузов, Адрес, ТипТочки, Тара, ФормироватьПоГрузовымМестам");
	ЗаполнитьЗначенияСвойств(сткИсходныеДанные, Строка, "Задание, Операция, ДополнительнаяОперация, ГрузовоеМесто, Тара, КоличествоГрузов");
	ЗаполнитьЗначенияСвойств(сткИсходныеДанные, текТочка, "Адрес, ТипТочки");
	сткИсходныеДанные.ФормироватьПоГрузовымМестам = ФормироватьПоГрузовымМестам;
	
	ПересчитатьВремяРабот			= Ложь;
	ПересчитатьВремянноеОкно        = Ложь;
	
	Если сткИзмененныеПоля.Свойство("Задание") Тогда
		Строка.Операция 				= ПредопределенноеЗначение("Перечисление.упТипыОпераций.ПустаяСсылка");
		//Строка.ПакетДокументов 			= ПредопределенноеЗначение("Справочник.упПакетыРегламентныхДокументов.ПустаяСсылка");
		Строка.ДополнительнаяОперация 	= ПредопределенноеЗначение("Справочник.упДополнительныеОперации.ПустаяСсылка");
		Строка.ВремяРабот				= 0;
		Строка.ВременноеОкноНачало 		= '00010101';
		Строка.ВременноеОкноОкончание 	= '00010101';
		Строка.ГрузовоеМесто			= ПредопределенноеЗначение("Справочник.упГрузовыеМеста.ПустаяСсылка");
		Строка.ВремяОжидания			= 0;
		Строка.Отменена					= Ложь;
		ПересчитатьВремянноеОкно		= Истина;

	ИначеЕсли сткИзмененныеПоля.Свойство("Операция") Тогда 	
		ПересчитатьВремяРабот			= Истина;
		ПересчитатьВремянноеОкно		= Истина;
		
		Если упПрохождениеТочкиКлиентСервер.ОсновнаяОперация(Строка.Операция) Тогда
			Строка.ДополнительнаяОперация = ПредопределенноеЗначение("Справочник.упДополнительныеОперации.ПустаяСсылка");
		Иначе			
			Строка.ГрузовоеМесто = ПредопределенноеЗначение("Справочник.упГрузовыеМеста.ПустаяСсылка");
		КонецЕсли;
			
	ИначеЕсли сткИзмененныеПоля.Свойство("ГрузовоеМесто") Тогда 		
		ПересчитатьВремяРабот			= Истина;
		
	ИначеЕсли сткИзмененныеПоля.Свойство("КоличествоГрузов") Тогда
		ПересчитатьВремяРабот			= Истина;
		
	КонецЕсли;
	
	сткПересчитываемыеПоказатели.Вставить("ТипОперации");
	Если ПересчитатьВремяРабот Тогда
		сткПересчитываемыеПоказатели.Вставить("ВремяРабот");
	КонецЕсли;
	
	Если ПересчитатьВремянноеОкно Тогда
	    сткПересчитываемыеПоказатели.Вставить("ВременноеОкноНачало");
		сткПересчитываемыеПоказатели.Вставить("ВременноеОкноОкончание");	
	КонецЕсли;
	
	ПересчитатьДанныеРаботыНаСервере(сткИсходныеДанные, сткПересчитываемыеПоказатели);	
	
	ЗаполнитьЗначенияСвойств(Строка, сткПересчитываемыеПоказатели);
	
КонецПроцедуры // ОбработкаИзмененныхДанных()

// Процедура дозаполняет данные о заданиях
//
Процедура ЗаполнитьВспомогательныеПоляЗаданийНаСервере(НомерСтроки = Неопределено) Экспорт
	
	СтрокаЗадание = Неопределено;
	Если НЕ НомерСтроки = Неопределено Тогда
		СтрокаЗадание = Задания.Получить(НомерСтроки-1);	
	КонецЕсли;
		
	Если СтрокаЗадание = Неопределено Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Задания.Задание КАК Документ.упЗаданиеНаПеревозкуГруза) КАК Задание,
		|	Задания.ГрузовоеМесто,
		|	Задания.КоличествоГрузов,
		|	Задания.СтрокаДокумента
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	&тзЗадания КАК Задания
		|;";
	Иначе
			
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	&Задание КАК Задание,
		|	&ГрузовоеМесто КАК ГрузовоеМесто,
		|	&КоличествоГрузов КАК КоличествоГрузов,
		|	&СтрокаДокумента КАК СтрокаДокумента
		|ПОМЕСТИТЬ втЗадания
		|;"
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса + 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втЗадания.Задание КАК Задание,
	|	втЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
	|	втЗадания.КоличествоГрузов КАК КоличествоГрузов,
	|	втЗадания.СтрокаДокумента КАК СтрокаДокумента,
	|	втЗадания.Задание.АдресОтправления КАК АдресОтправления,
	|	втЗадания.Задание.АдресПолучения КАК АдресПолучения,
	|	втЗадания.Задание.ОтправлениеГрузаС КАК ПлановоеВремяНачала,
	|	втЗадания.Задание.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозку,
	|	втЗадания.Задание.НомерВЦепиПоставок КАК НомерВЦепиПоставок,
	|	втЗадания.Задание.НомерВЦепиПоставокКонец КАК НомерВЦепиПоставокКонец,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Масса, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Масса, 0)) * втЗадания.КоличествоГрузов КАК Масса,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Объем, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Объем, 0)) * втЗадания.КоличествоГрузов КАК Объем,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.КоличествоМест, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.КоличествоМест, 0)) * втЗадания.КоличествоГрузов КАК КоличествоМест,
	|	ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.КоличествоЗагрузочныхМетров, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.КоличествоЗагрузочныхМетров, 0)) * втЗадания.КоличествоГрузов КАК КоличествоЗагрузочныхМетров,
	|	ЕСТЬNULL(втЗадания.ГрузовоеМесто.ОценочнаяСтоимость, втЗадания.Задание.ОценочнаяСтоимость) КАК ОценочнаяСтоимость
	|ИЗ
	|	втЗадания КАК втЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗадания КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.Задание.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО втЗадания.Задание.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку
	|			И втЗадания.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗадания КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО втЗадания.Задание = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку
	|			И втЗадания.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто
	|ГДЕ
	|	втЗадания.Задание.ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах В (ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку), ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса), ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	втЗадания.Задание,
	|	втЗадания.ГрузовоеМесто,
	|	втЗадания.КоличествоГрузов,
	|	втЗадания.СтрокаДокумента,
	|	втЗадания.Задание.АдресОтправления,
	|	втЗадания.Задание.АдресПолучения,
	|	втЗадания.Задание.ОтправлениеГрузаС,
	|	втЗадания.Задание.ЗаявкаНаПеревозкуГруза,
	|	втЗадания.Задание.НомерВЦепиПоставок,
	|	втЗадания.Задание.НомерВЦепиПоставокКонец,
	|	СУММА(ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Масса, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Масса, 0)) * упГрузовыеМеста.КоличествоГрузов),
	|	СУММА(ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.Объем, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.Объем, 0)) * упГрузовыеМеста.КоличествоГрузов),
	|	СУММА(ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.КоличествоМест, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.КоличествоМест, 0)) * упГрузовыеМеста.КоличествоГрузов),
	|	СУММА(ЕСТЬNULL(упПараметрыЗаявкиНаПеревозку.КоличествоЗагрузочныхМетров, ЕСТЬNULL(упПараметрыЗаданияНаПеревозку.КоличествоЗагрузочныхМетров, 0)) * упГрузовыеМеста.КоличествоГрузов),
	|	втЗадания.Задание.ОценочнаяСтоимость
	|ИЗ
	|	втЗадания КАК втЗадания
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК упГрузовыеМеста
	|		ПО втЗадания.Задание = упГрузовыеМеста.Ссылка
	|			И (втЗадания.Задание.ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах = ЗНАЧЕНИЕ(Перечисление.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаявкиНаПеревозку.СрезПоследних(
	|				,
	|				ЗаявкаНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание.ЗаявкаНаПеревозкуГруза
	|					ИЗ
	|						втЗадания КАК втЗадания
	|					ГДЕ
	|						НЕ втЗадания.Задание.ЗаявкаНаПеревозкуГруза = ЗНАЧЕНИЕ(Документ.упЗаявкаНаПеревозкуГруза.ПустаяСсылка))) КАК упПараметрыЗаявкиНаПеревозку
	|		ПО (упГрузовыеМеста.Ссылка.ЗаявкаНаПеревозкуГруза = упПараметрыЗаявкиНаПеревозку.ЗаявкаНаПеревозку)
	|			И (упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаявкиНаПеревозку.ГрузовоеМесто)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упПараметрыЗаданияНаПеревозку.СрезПоследних(
	|				,
	|				ЗаданиеНаПеревозку В
	|					(ВЫБРАТЬ
	|						втЗадания.Задание
	|					ИЗ
	|						втЗадания КАК втЗадания)) КАК упПараметрыЗаданияНаПеревозку
	|		ПО (упГрузовыеМеста.Ссылка = упПараметрыЗаданияНаПеревозку.ЗаданиеНаПеревозку)
	|			И (упГрузовыеМеста.ГрузовоеМесто = упПараметрыЗаданияНаПеревозку.ГрузовоеМесто)
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗадания.Задание,
	|	втЗадания.ГрузовоеМесто,
	|	втЗадания.КоличествоГрузов,
	|	втЗадания.СтрокаДокумента,
	|	втЗадания.Задание.АдресОтправления,
	|	втЗадания.Задание.АдресПолучения,
	|	втЗадания.Задание.ОтправлениеГрузаС,
	|	втЗадания.Задание.ОценочнаяСтоимость,
	|	втЗадания.Задание.ЗаявкаНаПеревозкуГруза,
	|	втЗадания.Задание.НомерВЦепиПоставок,
	|	втЗадания.Задание.НомерВЦепиПоставокКонец";
	//"ВЫБРАТЬ
	//|	втЗадания.Задание,
	//|	втЗадания.ГрузовоеМесто,
	//|	втЗадания.КоличествоГрузов,
	//|	втЗадания.СтрокаДокумента,
	//|	ГрузовыеМеста.Ссылка.АдресОтправления,
	//|	ГрузовыеМеста.Ссылка.АдресПолучения,
	//|	ГрузовыеМеста.Ссылка.ОтправлениеГрузаС КАК ПлановоеВремяНачала,
	//|	СУММА(ГрузовыеМеста.ГрузовоеМесто.Масса * ГрузовыеМеста.КоличествоГрузов) КАК Масса,
	//|	СУММА(ГрузовыеМеста.ГрузовоеМесто.Объем * ГрузовыеМеста.КоличествоГрузов) КАК Объем,
	//|	МАКСИМУМ(втЗадания.Задание.ОценочнаяСтоимость) КАК ОценочнаяСтоимость,	
	//|	СУММА(ГрузовыеМеста.ГрузовоеМесто.КоличествоМест * ГрузовыеМеста.КоличествоГрузов) КАК КоличествоМест,
	//|	СУММА(ГрузовыеМеста.ГрузовоеМесто.КоличествоЗагрузочныхМетров * ГрузовыеМеста.КоличествоГрузов) КАК КоличествоЗагрузочныхМетров
	//|ИЗ
	//|	втЗадания КАК втЗадания
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза.ГрузовыеМеста КАК ГрузовыеМеста
	//|		ПО втЗадания.Задание = ГрузовыеМеста.Ссылка
	//|			И (втЗадания.ГрузовоеМесто = ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	втЗадания.Задание,
	//|	втЗадания.ГрузовоеМесто,
	//|	втЗадания.КоличествоГрузов,
	//|	втЗадания.СтрокаДокумента,	
	//|	ГрузовыеМеста.Ссылка.АдресОтправления,
	//|	ГрузовыеМеста.Ссылка.АдресПолучения,
	//|	ГрузовыеМеста.Ссылка.ОтправлениеГрузаС
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	втЗадания.Задание,
	//|	втЗадания.ГрузовоеМесто,
	//|	втЗадания.КоличествоГрузов,
	//|	втЗадания.СтрокаДокумента,
	//|	втЗадания.Задание.АдресОтправления,
	//|	втЗадания.Задание.АдресПолучения,
	//|	втЗадания.Задание.ОтправлениеГрузаС,
	//|	СУММА(упГрузовыеМеста.Масса * втЗадания.КоличествоГрузов),
	//|	СУММА(упГрузовыеМеста.Объем * втЗадания.КоличествоГрузов),
	//|	СУММА(упГрузовыеМеста.ОценочнаяСтоимость * втЗадания.КоличествоГрузов),	
	//|	СУММА(упГрузовыеМеста.КоличествоМест * втЗадания.КоличествоГрузов),
	//|	СУММА(упГрузовыеМеста.КоличествоЗагрузочныхМетров * втЗадания.КоличествоГрузов)
	//|ИЗ
	//|	втЗадания КАК втЗадания
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упГрузовыеМеста КАК упГрузовыеМеста
	//|		ПО (втЗадания.ГрузовоеМесто <> ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка))
	//|			И втЗадания.ГрузовоеМесто = упГрузовыеМеста.Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	втЗадания.Задание,
	//|	втЗадания.ГрузовоеМесто,
	//|	втЗадания.КоличествоГрузов,
	//|	втЗадания.СтрокаДокумента,
	//|	втЗадания.Задание.АдресОтправления,
	//|	втЗадания.Задание.АдресПолучения,
	//|	втЗадания.Задание.ОтправлениеГрузаС"; 
	Если СтрокаЗадание = Неопределено Тогда
		Запрос.УстановитьПараметр("тзЗадания", Задания.Выгрузить());
	Иначе
		Запрос.УстановитьПараметр("Задание", СтрокаЗадание.Задание);
		Запрос.УстановитьПараметр("ГрузовоеМесто", СтрокаЗадание.ГрузовоеМесто);
		Запрос.УстановитьПараметр("КоличествоГрузов", СтрокаЗадание.КоличествоГрузов);
		Запрос.УстановитьПараметр("СтрокаДокумента", СтрокаЗадание.СтрокаДокумента);
	КонецЕсли;

	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Если СтрокаЗадание = Неопределено Тогда
			тбзЗадания = Результат.Выгрузить();
			Для каждого СтрокаЗадание Из Задания Цикл
				мсвСтрокиПараметры = тбзЗадания.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", СтрокаЗадание.Задание, СтрокаЗадание.ГрузовоеМесто));
				Если мсвСтрокиПараметры.Количество() > 0 Тогда
					ЗаполнитьЗначенияСвойств(СтрокаЗадание, мсвСтрокиПараметры[0],,"Задание, ГрузовоеМесто, КоличествоГрузов, СтрокаДокумента");
				КонецЕсли;
			КонецЦикла;
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ЗаполнитьЗначенияСвойств(СтрокаЗадание, Выборка);
		КонецЕсли; 
	КонецЕсли; 
	//ОбновитьИтоговыеПоказателиЗагрузки();
	
КонецПроцедуры // ЗаполнитьВспомогательныеПоляЗаданийНаСервере()

// Функция - возвращает строку представления маршрута для рейса.
//
Процедура УстановитьПредставлениеМаршурта() Экспорт
	
	ПредставлениеМаршрута = упРейс.ПолучитьПредставлениеДляРейса(Маршрут.Выгрузить(), ВидЗоныДляФормированияПредставленияРейса);
	
КонецПроцедуры

// Функция - переводит все задачи в указанной точке в состояние "Проблема".
//
Функция УстановитьПроблемуНаВсеНеЗаполненныеЗадачиВТочке(Проблема, ИдентификаторТочки, НомерТочки) Экспорт
	
	мсвРезультат = Новый Массив;
	
	мсвРаботы = Работы.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочки));
	
	Для каждого СтрокаРабота Из мсвРаботы Цикл
		
		СтарыйАдрес 	= СтрокаРабота.АдресРазгрузки;
		СтараяПроблема 	= СтрокаРабота.Проблема;
		
		Если НЕ ЗначениеЗаполнено(СтрокаРабота.Проблема) Тогда
				СтрокаРабота.Проблема = Проблема;
		КонецЕсли;
		
		СтрокаРабота.Отменена = Истина;	
		 	
		
		Если упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(СтрокаРабота.Операция)  Тогда
				
			Если НЕ ЗначениеЗаполнено(СтрокаРабота.АдресРазгрузки) Тогда
				
				мсвСтрокиПогрузки = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Операция", СтрокаРабота.Задание, СтрокаРабота.ГрузовоеМесто, упПрохождениеТочкиКлиентСервер.ОбратнаяОперация(СтрокаРабота.Операция)));
				
				Если мсвСтрокиПогрузки.Количество() > 0 Тогда
					мсвТочка = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", мсвСтрокиПогрузки[0].Идентификатор));
					Если мсвТочка.Количество() > 0  Тогда
						СтрокаРабота.АдресРазгрузки = мсвТочка[0].Адрес;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			мсвРезультат.Добавить(Новый Структура("Индекс, СтарыйАдрес, СтараяПроблема", Работы.Индекс(СтрокаРабота), СтарыйАдрес, СтараяПроблема))

		КонецЕсли;
		
	КонецЦикла;
	
	Возврат мсвРезультат;
		
КонецФункции

// Процедура - восстанавливает состояние разгрузки в точке.
//
Процедура ВосстановитьТочкуРазгрузки(сткВозврата) Экспорт
	
	мсвОпераций = упПрохождениеТочкиКлиентСервер.СписокОперацийРазгрузки();
	
	Для каждого Операция Из мсвОпераций Цикл
			
		// Поиск работы
		мсвСтрокиРабот = Работы.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Операция", сткВозврата.Задание, сткВозврата.ГрузовоеМесто, Операция));
		
		Если мсвСтрокиРабот.Количество() > 0 Тогда
			
			Для каждого СтрокаРазгрузки Из мсвСтрокиРабот Цикл
				
				// Восстанавливается разгрузка в точке
				СтрокаРазгрузки.Отменена = Ложь;
				СтрокаРазгрузки.Проблема = Справочники.упПроблемы.ПустаяСсылка();
				СтрокаРазгрузки.АдресРазгрузки = Справочники.упАдреса.ПустаяСсылка();
				
				мсвТочки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", СтрокаРазгрузки.Идентификатор));	
				Если мсвТочки.Количество() > 0  Тогда
					
					Точка = мсвТочки[0];
					Если Точка.Отменена Тогда
						
						// Восстанавливается точка
						Точка.Отменена = Ложь;
						
						// Восстанавливаются не основные работы в точке
						мсвСтрокиРаботВТочке = Работы.НайтиСтроки(Новый Структура("Идентификатор",Точка.Идентификатор));
						Для каждого СтрокаРабота Из мсвСтрокиРаботВТочке Цикл
							Если упПрохождениеТочкиКлиентСервер.ОсновнаяОперация(СтрокаРабота.Операция) Тогда
								Продолжить
							КонецЕсли;
							
							СтрокаРабота.Отменена = Ложь;
							СтрокаРабота.Проблема = Справочники.упПроблемы.ПустаяСсылка();
							СтрокаРабота.АдресРазгрузки = Справочники.упАдреса.ПустаяСсылка();
							
						КонецЦикла;
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура - проставляет реквизит Порядок отгрузки у тч Задания 
//
Процедура ПроставитьПорядокОтгрузки() Экспорт
	
	Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится
		ИЛИ  ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
		ИспользоватьГрузовыеМеста = Ложь;
	Иначе
		ИспользоватьГрузовыеМеста = Истина;
	Конецесли;
	// Заполнить номера строк.
	Для Каждого текЗадание Из Задания Цикл
		ИдентификаторЗадания = "";
		стрПоика = Новый Структура;
		стрПоика.Вставить("Задание",текЗадание.Задание);
		Если ИспользоватьГрузовыеМеста Тогда
			стрПоика.Вставить("ГрузовоеМесто",текЗадание.ГрузовоеМесто);
		КонецЕсли;
		стрПоика.Вставить("Операция", Перечисления.упТипыОпераций.Разгрузка);
		НайденныеСтроки = Работы.НайтиСтроки(стрПоика);
		Если НайденныеСтроки.Количество() Тогда
			ИдентификаторЗадания = НайденныеСтроки[0].Идентификатор;
		КонецЕсли;	
		Если ИдентификаторЗадания = "" Тогда
			стрПоика = Новый Структура;
			стрПоика.Вставить("Задание",текЗадание.Задание);
			Если ИспользоватьГрузовыеМеста Тогда
				стрПоика.Вставить("ГрузовоеМесто",текЗадание.ГрузовоеМесто);
			КонецЕсли;
			стрПоика.Вставить("Операция", Перечисления.упТипыОпераций.ПередачаЦенностей);
			НайденныеСтроки = Работы.НайтиСтроки(стрПоика);
			Если НайденныеСтроки.Количество() Тогда
				ИдентификаторЗадания = НайденныеСтроки[0].Идентификатор;
			КонецЕсли;	
		КонецЕсли;	
		Если Не ИдентификаторЗадания = "" Тогда
			СтрокиМаршрута = Маршрут.НайтиСтроки(Новый Структура("Идентификатор",ИдентификаторЗадания));
			Если СтрокиМаршрута.Количество() Тогда
				текЗадание.ПорядокОтгрузки = СтрокиМаршрута[0].СтрокаНомер;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
	// Перенумеровать реквизит ПорядокОтгрузки в ТЧ Задания.
	Задания.Сортировать("ПорядокОтгрузки Возр");
	Значение = 0;
	Для Каждого текЗадание Из Задания Цикл
		Если Значение = 0 Тогда // Первая строка.
			Значение = текЗадание.ПорядокОтгрузки;
			текЗадание.ПорядокОтгрузки = 1;
			ЗначениеНумератора = 1;
			Продолжить;
		КонецЕсли;
		
		Если Значение = текЗадание.ПорядокОтгрузки Тогда
			текЗадание.ПорядокОтгрузки = ЗначениеНумератора;
		Иначе
			ЗначениеНумератора = ЗначениеНумератора +1;
			Значение = текЗадание.ПорядокОтгрузки;
			текЗадание.ПорядокОтгрузки = ЗначениеНумератора;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Работы

// Процедура - выполняется после добавления новой работы.
//
Процедура ОбработатьДобавлениеРаботы(РаботаНомерСтроки, ИдентификаторТочки, Отказ) Экспорт
	
	Если РаботаНомерСтроки < 1 Тогда
		ТекстСообщения = Нстр("ru = 'Строки с номером %1 не существует'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, РаботаНомерСтроки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	мсвСтрокиМаршрута = Маршрут.НайтиСтроки(Новый Структура("Идентификатор",ИдентификаторТочки));
	
	СтрокаТочка = Неопределено;
	
	Если мсвСтрокиМаршрута.Количество() > 0  Тогда
		СтрокаТочка = мсвСтрокиМаршрута[0];
	КонецЕсли;
	
	СтрокаРабота	= Работы.Получить(РаботаНомерСтроки-1);
	СтрокаРабота.Идентификатор			= ИдентификаторТочки;
	СтрокаРабота.ИдентификаторРаботы	= Новый УникальныйИдентификатор;
	СтрокаНомер = Работы.НайтиСтроки(Новый Структура("Идентификатор",ИдентификаторТочки)).Количество();
	СтрокаРабота.СтрокаНомер			= СтрокаНомер;
	
	Если Не ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками Тогда
		СтрокаРабота.ВремяРабот = ПолучитьВремяРаботПоАдресу(СтрокаТочка.Адрес);
		СтрокаРабота.ВремяРаботПредставление = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(СтрокаРабота.ВремяРабот*3600);
	КонецЕсли; 
	
	Если НЕ СтрокаТочка = Неопределено Тогда
		СтрокаРабота.Выполнена = СтрокаТочка.Пройдена;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

// Процедура - проверяет заполнение всех значимых реквизитов. 
//
Процедура ПроверитьЗаполнениеМаршрута(Отказ) Экспорт
	
	// Проверка заполненности реквизитов заданий
	
	ПроверятьГрузовыеМеста 		= Истина;
	ПроверятьКоличествоГрузов 	= Истина;
	
	Если НЕ ФормироватьПоГрузовымМестам Тогда
		ПроверятьГрузовыеМеста 		= Ложь;
		ПроверятьКоличествоГрузов 	= Ложь;
	КонецЕсли;

	Если ПроверятьГрузовыеМеста 
		И ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
		ПроверятьГрузовыеМеста 		= Ложь;
	КонецЕсли;
	
	Если ПроверятьКоличествоГрузов И НЕ ПолучитьФункциональнуюОпцию("упИспользуетсяКоличественныйУчетГрузов") Тогда
		ПроверятьКоличествоГрузов = Ложь;	
	КонецЕсли;
	
	Для каждого Строка Из Задания Цикл
		Если Не ЗначениеЗаполнено(Строка.Задание) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнена колонка ""Задание"" в строке %1 списка ""Задания""'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			"Задания",
			,
			Отказ);
		КонецЕсли;
		
		Если НЕ Отказ И ПроверятьГрузовыеМеста И НЕ ЗначениеЗаполнено(Строка.ГрузовоеМесто) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнена колонка ""ГрузовоеМесто"" в строке %1 списка ""Задания""'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			"Задания",
			,
			Отказ);
		КонецЕсли;

		
		Если НЕ Отказ И ПроверятьКоличествоГрузов И НЕ ЗначениеЗаполнено(Строка.КоличествоГрузов) Тогда
			ТекстСообщения = Нстр("ru = 'Не заполнена колонка ""Количество грузов"" в строке %1 списка ""Задания""'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			"Задания",
			,
			Отказ);
		КонецЕсли;


		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	// Проверка того что погрузка не может быть раньше разгрузки
	тбзРаботы = Работы.Выгрузить();
	тбзРаботы.Колонки.Добавить("ИдентификаторСтрока", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	Для каждого текСтрока Из тбзРаботы Цикл
		
		текСтрока.ИдентификаторСтрока 	= Строка(текСтрока.Идентификатор);
		текСтрока.СтрокаНомер			= тбзРаботы.Индекс(текСтрока);
		Если ИспользуетсяГлобальнаяКомпонентаУправлениеПеревозками И Не ЗначениеЗаполнено(текСтрока.Задание) Тогда
			ТекстСообщения = Нстр("ru = 'В рейсе присутствуют работы с незаполненным заданием на перевозку груза'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			"Маршрут",
			,
			Отказ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(текСтрока.Операция) Тогда
			ТекстСообщения = Нстр("ru = 'В рейсе присутствуют работы с незаполненным типом операции'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			"Маршрут",
			,
			Отказ);
		КонецЕсли;
		
		Если СпособПрохожденияТочекМаршрута = Перечисления.упСпособыПрохожденияТочекМаршрута.ВРейсе
				И (СтатусРейсаДоКорректировки = Перечисления.упСтатусыРейса.Выполнен
					ИЛИ СтатусРейсаДоКорректировки = Перечисления.упСтатусыРейса.ВыполненЧастично)
				И НЕ текСтрока.Выполнена
				И НЕ текСтрока.Отменена Тогда
			ТекстСообщения = Нстр("ru = 'В рейсе присутствуют работы не выполненные и не отмененные'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,,,Отказ);	
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	тбзМаршрут = Маршрут.Выгрузить();
	тбзМаршрут.Колонки.Добавить("ИдентификаторСтрока", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	
	текВремяУбытияИзПредыдущейТочкиПлан = '00010101';
	текВремяУбытияИзПредыдущейТочкиФакт = '00010101';
	ПредыдущаяТочкаПройдена			 = Ложь;
	
	Для каждого текСтрока Из тбзМаршрут Цикл
		НомерСтроки	= тбзМаршрут.Индекс(текСтрока) + 1;
		текСтрока.ИдентификаторСтрока 	= Строка(текСтрока.Идентификатор);
		текСтрока.СтрокаНомер			= НомерСтроки;
		ПроверятьПлановоеВремя			= НЕ текСтрока.Пройдена;
				
		Если текСтрока.ТипТочки = Перечисления.упТипыТочекМаршрута.ПроисшествиеВПути Тогда
			ПроверятьПлановоеВремя			= Ложь;
		КонецЕсли;
		
		Если текСтрока.Отменена Тогда
			Продолжить;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(текСтрока.Адрес) Тогда
			ТекстСообщения = Нстр("ru = 'В маршруте есть строки с незаполненным адресом'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Маршрут", НомерСтроки, "Адрес"),,Отказ);
		КонецЕсли;
	
		// Проверка планового времени
		Если НЕ Отказ И ПроверятьПлановоеВремя И НЕ ПредыдущаяТочкаПройдена И текВремяУбытияИзПредыдущейТочкиПлан > текСтрока.ПлановоеПрибытие Тогда
			ТекстСообщения = Нстр("ru = 'Время прибытия в точку раньше чем время убытия из предыдущей точки'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Маршрут", НомерСтроки, "ПлановоеПрибытие"),,Отказ);	
		КонецЕсли;
		
		Если НЕ Отказ И ПроверятьПлановоеВремя И текСтрока.ПлановоеПрибытие > текСтрока.ПлановоеУбытие Тогда
			ТекстСообщения = Нстр("ru = 'Время убытия из точки раньше чем время прибытия'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Маршрут", НомерСтроки, "ПлановоеУбытие"),,Отказ);	
		КонецЕсли;
		
		// Проверка фактического времени
		Если НЕ Отказ И текСтрока.Пройдена И текВремяУбытияИзПредыдущейТочкиФакт > текСтрока.ПрибытиеФакт Тогда
			ТекстСообщения = Нстр("ru = 'Время прибытия в точку раньше чем время убытия из предыдущей точки'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Маршрут", НомерСтроки, "ПрибытиеФакт"),,Отказ);	
		КонецЕсли;
		
		Если НЕ Отказ  И текСтрока.Пройдена И текСтрока.ПрибытиеФакт > текСтрока.УбытиеФакт Тогда
			ТекстСообщения = Нстр("ru = 'Время убытия из точки раньше чем время прибытия'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Маршрут", НомерСтроки, "УбытиеФакт"),,Отказ);	
		КонецЕсли;
		
		Если Истина
			И НЕ Отказ 
			И СпособПрохожденияТочекМаршрута = Перечисления.упСпособыПрохожденияТочекМаршрута.ВРейсе
			И (Ложь
				Или СтатусРейсаДоКорректировки = Перечисления.упСтатусыРейса.Выполнен
				Или СтатусРейсаДоКорректировки = Перечисления.упСтатусыРейса.ВыполненЧастично
				Или НовыйСтатус = Перечисления.упСтатусыРейса.Выполнен
				Или НовыйСтатус = Перечисления.упСтатусыРейса.ВыполненЧастично)
			И НЕ текСтрока.Пройдена
			И НЕ текСтрока.Отменена 
		Тогда
			ТекстСообщения = Нстр("ru = 'В рейсе присутствуют точки не пройденные и не отмененные'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
			Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Маршрут", НомерСтроки, "Пройдена"),,Отказ);	
			Прервать;
		КонецЕсли;
     	
		текВремяУбытияИзПредыдущейТочкиПлан = текСтрока.ПлановоеУбытие;
		текВремяУбытияИзПредыдущейТочкиФакт = текСтрока.УбытиеФакт;
		ПредыдущаяТочкаПройдена			 = текСтрока.Пройдена;
	КонецЦикла;

	Если НЕ Отказ Тогда
		
		текЗапрос = Новый Запрос;
		текЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		текЗапрос.Текст = 
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбМаршрут.ИдентификаторСтрока КАК Идентификатор,
		|	тбМаршрут.СтрокаНомер КАК СтрокаНомер,
		|	тбМаршрут.Пройдена КАК Пройдена,
		|	тбМаршрут.Отменена КАК Отменена
		|ПОМЕСТИТЬ втМаршрут
		|ИЗ
		|	&тбМаршрут КАК тбМаршрут
		|ГДЕ НЕ (тбМаршрут.Отменена)
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбРаботы.Задание КАК Задание,
		|	тбРаботы.ГрузовоеМесто КАК ГрузовоеМесто,
		|	тбРаботы.Операция КАК Операция,
		|	тбРаботы.ИдентификаторСтрока КАК Идентификатор,
		|	тбРаботы.КоличествоГрузов КАК КоличествоГрузов,
		|	тбРаботы.СтрокаНомер КАК СтрокаНомер
		|ПОМЕСТИТЬ втРаботы
		|ИЗ
		|	&тбРаботы КАК тбРаботы
		|ГДЕ ЛОЖЬ
		|	ИЛИ НЕ (тбРаботы.Отменена)
		|	ИЛИ (ИСТИНА
		|		И тбРаботы.Отменена
		|		И тбРаботы.ГрузРазделен)
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбРаботы.Задание КАК Задание,
		|	ВЫБОР
		|		КОГДА &ПустыеГрузовыеМеста
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
		|		ИНАЧЕ тбРаботы.ГрузовоеМесто
		|	КОНЕЦ КАК ГрузовоеМесто,
		|	тбРаботы.Операция КАК Операция,
		|	тбРаботы.Идентификатор КАК Идентификатор,
		|	тбРаботы.КоличествоГрузов КАК КоличествоГрузов,
		|	тбРаботы.СтрокаНомер КАК СтрокаНомер
		|ПОМЕСТИТЬ втРаботыПоЗаданиям
		|ИЗ
		|	втРаботы КАК тбРаботы
		|;
		|//{Запрос: 3 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбзЗадания.Задание КАК Задание,
		|	тбзЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	тбзЗадания.КоличествоГрузов КАК КоличествоГрузов
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	&Задания КАК тбзЗадания
		|ГДЕ НЕ (тбзЗадания.Отменено)
		|;
		|//{Запрос: 4 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Задание КАК Задание,
		|	втЗадания.ГрузовоеМесто КАК ГрузовоеМесто,
		|	ВЫБОР
		|		КОГДА втРаботы.Операция ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
		|				ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ВыемкаЦенностей)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПогрузок,
		|	ВЫБОР
		|		КОГДА втРаботы.Операция ЕСТЬ NULL
		|			ТОГДА 0
		|		КОГДА втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
		|				ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПередачаЦенностей)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРазгрузок
		|ПОМЕСТИТЬ втКоличествоРабот
		|ИЗ
		|	втЗадания КАК втЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ втРаботыПоЗаданиям КАК втРаботы
		|	ПО ИСТИНА
		|		И втЗадания.Задание = втРаботы.Задание
		|		И втЗадания.ГрузовоеМесто = втРаботы.ГрузовоеМесто
		|ГДЕ ЛОЖЬ
		|	ИЛИ втРаботы.Операция ЕСТЬ NULL
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ВыемкаЦенностей)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПередачаЦенностей)
		|;
		|//{Запрос: 5 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботы.Задание КАК Задание,
		|	втРаботы.ГрузовоеМесто КАК ГрузовоеМесто,
		|	втРаботы.Операция КАК Операция,
		|	втМаршрут.Идентификатор КАК ИдентификаторТочки
		|ИЗ
		|	втРаботы КАК втРаботы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМаршрут КАК втМаршрут
		|	ПО втРаботы.Идентификатор = втМаршрут.Идентификатор
		|ГДЕ ЛОЖЬ
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ВыемкаЦенностей)
		|	ИЛИ втРаботы.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПередачаЦенностей)
		|УПОРЯДОЧИТЬ ПО
		|	втМаршрут.СтрокаНомер
		|ИТОГИ
		|ПО
		|	Задание,
		|	ГрузовоеМесто
		|;
		|//{Запрос: 6 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втКоличествоРабот.Задание КАК Задание,
		|	втКоличествоРабот.ГрузовоеМесто КАК ГрузовоеМесто,
		|	СУММА(втКоличествоРабот.КоличествоПогрузок) КАК КоличествоПогрузок,
		|	СУММА(втКоличествоРабот.КоличествоРазгрузок) КАК КоличествоРазгрузок
		|ИЗ
		|	втКоличествоРабот КАК втКоличествоРабот
		|ГДЕ ЛОЖЬ
		|	ИЛИ втКоличествоРабот.КоличествоПогрузок = 0
		|	ИЛИ НЕ (втКоличествоРабот.КоличествоПогрузок = втКоличествоРабот.КоличествоРазгрузок)
		|СГРУППИРОВАТЬ ПО
		|	втКоличествоРабот.Задание,
		|	втКоличествоРабот.ГрузовоеМесто
		|;
		|//{Запрос: 7 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втМаршрут.СтрокаНомер КАК СтрокаНомер,
		|	втМаршрут.Пройдена КАК Пройдена,
		|	втМаршрут.Отменена КАК Отменена,
		|	втМаршрут.Идентификатор КАК Идентификатор
		|ИЗ
		|	втМаршрут КАК втМаршрут
		|УПОРЯДОЧИТЬ ПО
		|	СтрокаНомер
		|";

		текЗапрос.УстановитьПараметр("тбРаботы", тбзРаботы);
		текЗапрос.УстановитьПараметр("тбМаршрут", тбзМаршрут);
		текЗапрос.УстановитьПараметр("ПустыеГрузовыеМеста", ВидПеревозки.ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса);
		текЗапрос.УстановитьПараметр("Задания", Задания.Выгрузить());
		
		ИндексЗапросаПорядокТочекПогрузкиРазгрузки = 5;
		ИндексЗапросаВсеЗаданияРаспределеныПоТочкам = 6;
		ИндексЗапросаПорядокПрохожденияТочек = 7;
		ИндексЗапросаЗависимыеГрузовыеМеста = 8;
		
		мсвРезультат = текЗапрос.ВыполнитьПакет();
		текВыборкаЗадание = мсвРезультат[ИндексЗапросаПорядокТочекПогрузкиРазгрузки].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока текВыборкаЗадание.Следующий() Цикл
			текЗадание = текВыборкаЗадание.Задание;
			текВыборкаГрузовоеМесто = текВыборкаЗадание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока текВыборкаГрузовоеМесто.Следующий() Цикл
				
				текГрузовоеМесто = текВыборкаГрузовоеМесто.ГрузовоеМесто;
				текВыборкаОперация = текВыборкаГрузовоеМесто.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				ЕстьОперацияПогрузки = Ложь;
				ЕстьОперацияРазгрузки = Ложь;
				
				ИдентификаторТочкиПогрузки = "";
				ИдентификаторТочкиРазгрузки = "";
				
				ИдентификаторПредыдущейТочки = Неопределено;
				
				Пока текВыборкаОперация.Следующий() Цикл
										
					Если Истина
						И ЕстьОперацияРазгрузки 
						И НЕ ЕстьОперацияПогрузки 
						И ИдентификаторПредыдущейТочки <> текВыборкаОперация.ИдентификаторТочки // В одной точке могут быть работы погрузки и разгрузки, так бывает при разделении грузовых мест.
					Тогда
						ТекстСообщения = Нстр("ru = 'Для работы:%1 разгрузка введена раньше погрузки'");
						ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текЗадание);
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
						
						Прервать;
					КонецЕсли;
					
					текОперация = текВыборкаОперация.Операция;
					
					Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(текОперация) Тогда
						ЕстьОперацияПогрузки = Истина;
					ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(текОперация) Тогда
						ЕстьОперацияРазгрузки = Истина;	
					КонецЕсли;
					
					ИдентификаторПредыдущейТочки = текВыборкаОперация.ИдентификаторТочки;
					
				КонецЦикла;
								
			КонецЦикла;
		КонецЦикла;
		
		ВариантФормированияМаршрутаПолный = ВариантФормированияМаршрута = ПредопределенноеЗначение("Перечисление.упВариантыФормированияМаршрута.Полный");
		
		текВыборка = мсвРезультат[ИндексЗапросаВсеЗаданияРаспределеныПоТочкам].Выбрать();
		// Проверить что по каждому заданию есть работы погрузки/разгрузки
		Пока текВыборка.Следующий() Цикл
			Если текВыборка.КоличествоПогрузок = 0 Тогда
				Если ЗначениеЗаполнено(текВыборка.ГрузовоеМесто) Тогда
					ТекстСообщения = Нстр("ru = 'По заданию %1, грузовому месту %2 нет работ погрузки'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текВыборка.Задание, текВыборка.ГрузовоеМесто);
				Иначе	
					ТекстСообщения = Нстр("ru = 'По заданию %1 нет работ погрузки'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текВыборка.Задание);
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			ИначеЕсли ВариантФормированияМаршрутаПолный И НЕ текВыборка.КоличествоПогрузок = текВыборка.КоличествоРазгрузок Тогда	
				Если ЗначениеЗаполнено(текВыборка.ГрузовоеМесто) Тогда
					ТекстСообщения = Нстр("ru = 'По заданию %1, грузовому месту %2 количество работ погрузки не равно количеству разгрузок'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текВыборка.Задание, текВыборка.ГрузовоеМесто);
				Иначе	
					ТекстСообщения = Нстр("ru = 'По заданию %1 количество работ погрузки не равно количеству разгрузок'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текВыборка.Задание);
				КонецЕсли;
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);	
			КонецЕсли;	
		КонецЦикла;
		
		текВыборка = мсвРезультат[ИндексЗапросаПорядокПрохожденияТочек].Выбрать();
		
		ЕстьПройденнаяТочка 	= Ложь;
		ЕстьНеПройденнаяТочка 	= Ложь;
		
		Пока текВыборка.Следующий() Цикл
			
			Если ЕстьНеПройденнаяТочка И текВыборка.Пройдена Тогда
				ТекстСообщения = Нстр("ru = 'Нарушен порядок прохождения точек. Точка в строке %1 должна быть не пройдена или отменена, так как перед ней существуют не пройденные точки'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, текВыборка.СтрокаНомер);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				Ссылка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Маршрут", НомерСтроки, "Пройдена"),
				,
				Отказ);
				
			КонецЕсли;
			
			ЕстьПройденнаяТочка 	= ЕстьПройденнаяТочка ИЛИ текВыборка.Пройдена;
			ЕстьНеПройденнаяТочка   	= ЕстьНеПройденнаяТочка ИЛИ (НЕ текВыборка.Пройдена И НЕ текВыборка.Отменена);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализацияМаршрутаИРаботПоРейсу(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);

	Инициализировать = Ложь;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.упПрохождениеТочки") Тогда
		Инициализировать = Истина;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.упПроисшествиеВПути") Тогда
		
		Если Реквизиты.Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад Тогда
			
			Инициализировать = Истина;
			
		ИначеЕсли Реквизиты.Действие = Перечисления.упДействияПриПроисшествииВПути.ПродолжениеРейса Тогда
			
			Инициализировать = Истина;
			
		КонецЕсли;
	ИначеЕсли  ТипЗнч(Ссылка) = Тип("ДокументСсылка.упРегистрацияОтложенныхРаботПоРейсу") Тогда	
		Инициализировать = Истина;
	КонецЕсли;
	
	Если Инициализировать Тогда
		Маршрут.Загрузить(МаршрутДоКорректировки.Выгрузить());
		Работы.Загрузить(РаботыДоКорректировки.Выгрузить());
	КонецЕсли;
			
КонецПроцедуры

Процедура ЗаполнениеМаршрутаИРаботПоРейсу(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);

	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.упПрохождениеТочки") Тогда
		ЗаполнениеМаршрутаИРаботПоРейсуДляПрохожденияТочки(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);	
	ИначеЕсли  ТипЗнч(Ссылка) = Тип("ДокументСсылка.упПроисшествиеВПути") Тогда
		
		Если Реквизиты.Действие = Перечисления.упДействияПриПроисшествииВПути.ВозвратНаСклад Тогда
			
			ЗаполнениеМаршрутаИРаботПоРейсуДляПроисшествияВозвратНаСклад(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
			
		ИначеЕсли Реквизиты.Действие = Перечисления.упДействияПриПроисшествииВПути.ПродолжениеРейса Тогда
			
			ЗаполнениеМаршрутаИРаботПоРейсуДляПроисшествияПродолжениеРейса(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
			
		КонецЕсли;
	КонецЕсли;					
			
КонецПроцедуры

Функция АдресФактическойРазгрузкиГрузовогоМестаКонтейнера(ОперацииСКонтейнером, Контейнер)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|
	|//{Запрос: 0 ////////////////////////////////////////
	|// Для определения точки разгрузки контейнера
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УпМаршрутПоРейсу_СрезПоследнихТ.Адрес КАК Адрес
	|ПОМЕСТИТЬ втТочкаРасформированияКонтейнера
	|ИЗ
	|	РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
	|		,
	|		Рейс = &ОперацииСКонтейнером) КАК УпМаршрутПоРейсу_СрезПоследнихТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упРаботыПоРейсу.СрезПоследних(
	|		,
	|		Рейс = &ОперацииСКонтейнером) КАК УпРаботыПоРейсу_СрезПоследнихТ
	|	ПО УпРаботыПоРейсу_СрезПоследнихТ.Идентификатор = УпМаршрутПоРейсу_СрезПоследнихТ.Идентификатор
	|ГДЕ ИСТИНА
	|	И НЕ (УпМаршрутПоРейсу_СрезПоследнихТ.Отменена)
	|	И НЕ (УпРаботыПоРейсу_СрезПоследнихТ.Отменена)
	|	И УпРаботыПоРейсу_СрезПоследнихТ.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрузовоеМестоКонтейнер.ГрузовоеМесто КАК ГрузовоеМесто,
	|	упЗаявкаНаПеревозкуГруза.Ссылка КАК ЗаявкаНаПеревозкуГруза
	|ПОМЕСТИТЬ втГрузовоеМестоКонтейнера
	|ИЗ
	|	РегистрСведений.упГрузовыеМестаКонтейнеров КАК ГрузовоеМестоКонтейнер
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.упЗаявкаНаПеревозкуГруза КАК упЗаявкаНаПеревозкуГруза
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упСтатусыЗаявокНаПеревозкуГруза.СрезПоследних(
	|			,
	|			) КАК СтатусыЗаявок
	|		ПО СтатусыЗаявок.Документ = упЗаявкаНаПеревозкуГруза.Ссылка
	|	ПО ГрузовоеМестоКонтейнер.Документ = упЗаявкаНаПеревозкуГруза.ДокументОснование
	|ГДЕ ИСТИНА
	|	И ГрузовоеМестоКонтейнер.Документ = &ОперацииСКонтейнером
	|	И ГрузовоеМестоКонтейнер.Контейнер = &Контейнер
	|	И ЕСТЬNULL(СтатусыЗаявок.Статус, ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.Новая)) <> ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.Отменена)
	|	И НЕ (упЗаявкаНаПеревозкуГруза.ПометкаУдаления)
	|;
	|//{Запрос: 2 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упЗаданиеНаПеревозкуГрузаТ.Ссылка КАК ЗаданиеНаПеревозкуГруза
	|ПОМЕСТИТЬ втЗаданияПоЗаявкеНаПеревозкуГрузаКонтейнера
	|ИЗ
	|	втГрузовоеМестоКонтейнера КАК втГрузовоеМестоКонтейнераТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГрузаТ
	|	ПО втГрузовоеМестоКонтейнераТ.ЗаявкаНаПеревозкуГруза = упЗаданиеНаПеревозкуГрузаТ.ЗаявкаНаПеревозкуГруза
	|;
	|//{Запрос: 3 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УпРейс_ЗаданияТ.Задание КАК ЗаданиеНаПеревозкуГруза,
	|	УпРейс_ЗаданияТ.Ссылка КАК Рейс
	|ПОМЕСТИТЬ втРейсы
	|ИЗ
	|	втЗаданияПоЗаявкеНаПеревозкуГрузаКонтейнера КАК втЗаданияНаПеревозкуКонтейнераТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упРейс.Задания КАК УпРейс_ЗаданияТ
	|	ПО УпРейс_ЗаданияТ.Задание = втЗаданияНаПеревозкуКонтейнераТ.ЗаданиеНаПеревозкуГруза
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	упКорректировкаРейса_ЗаданияТ.Задание КАК ЗаданиеНаПеревозкуГруза,
	|	втЗаданияНаПеревозкуКонтейнераТ.ЗаданиеНаПеревозкуГруза КАК Рейс
	|ИЗ
	|	втЗаданияПоЗаявкеНаПеревозкуГрузаКонтейнера КАК втЗаданияНаПеревозкуКонтейнераТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упКорректировкаРейса.Задания КАК упКорректировкаРейса_ЗаданияТ
	|	ПО упКорректировкаРейса_ЗаданияТ.Задание = втЗаданияНаПеревозкуКонтейнераТ.ЗаданиеНаПеревозкуГруза
	|;
	|//{Запрос: 4 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпРаботыПоРейсу_СрезПоследнихТ.Задание.НомерВЦепиПоставокКонец КАК НомерВЦепиПоставокКонец,
	|	УпМаршрутПоРейсу_СрезПоследнихТ.Адрес КАК Адрес
	|ПОМЕСТИТЬ втАдресаРазгрузкиЗаданий
	|ИЗ
	|	втРейсы КАК втРейсы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упРаботыПоРейсу.СрезПоследних(
	|		,
	|		Рейс В (
	|			ВЫБРАТЬ
	|				втРейсы.Рейс КАК Рейс
	|			ИЗ
	|				втРейсы КАК втРейсы)) КАК УпРаботыПоРейсу_СрезПоследнихТ
	|	ПО ИСТИНА
	|		И втРейсы.ЗаданиеНаПеревозкуГруза = УпРаботыПоРейсу_СрезПоследнихТ.Задание
	|		И втРейсы.Рейс = УпРаботыПоРейсу_СрезПоследнихТ.Рейс
	|		И УпРаботыПоРейсу_СрезПоследнихТ.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
	|		И УпРаботыПоРейсу_СрезПоследнихТ.Выполнена
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упМаршрутПоРейсу.СрезПоследних(
	|		,
	|		Рейс В (
	|			ВЫБРАТЬ
	|				втРейсы.Рейс КАК Рейс
	|			ИЗ
	|				втРейсы КАК втРейсы)) КАК УпМаршрутПоРейсу_СрезПоследнихТ
	|	ПО ИСТИНА
	|		И УпМаршрутПоРейсу_СрезПоследнихТ.Идентификатор = УпРаботыПоРейсу_СрезПоследнихТ.Идентификатор
	|		И УпМаршрутПоРейсу_СрезПоследнихТ.Пройдена
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрузовоеМестоКонтейнера КАК втГрузовоеМестоКонтейнера
	|	ПО втГрузовоеМестоКонтейнера.ГрузовоеМесто = УпРаботыПоРейсу_СрезПоследнихТ.ГрузовоеМесто
	|;
	|//{Запрос: 5 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТочкаРасформированияКонтейнераТ.Адрес КАК АдресРасформирования,
	|	втАдресаРазгрузкиЗаданийТ.Адрес КАК ФактическийАдресРазгрузки
	|ИЗ
	|	втАдресаРазгрузкиЗаданий КАК втАдресаРазгрузкиЗаданийТ
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|		МАКСИМУМ(втАдресаРазгрузкиЗаданий.НомерВЦепиПоставокКонец) КАК НомерВЦепиПоставокКонец
	|	ИЗ
	|		втАдресаРазгрузкиЗаданий КАК втАдресаРазгрузкиЗаданий) КАК ПоследнееЗвеноПоставки
	|	ПО втАдресаРазгрузкиЗаданийТ.НомерВЦепиПоставокКонец = ПоследнееЗвеноПоставки.НомерВЦепиПоставокКонец,
	|	втТочкаРасформированияКонтейнера КАК втТочкаРасформированияКонтейнераТ
	|ГДЕ втАдресаРазгрузкиЗаданийТ.Адрес <> втТочкаРасформированияКонтейнераТ.Адрес
	|";

	Запрос.УстановитьПараметр("ОперацииСКонтейнером", ОперацииСКонтейнером);
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат	= Выборка.ФактическийАдресРазгрузки;
		КонецЕсли; 
	КонецЕсли;
		
	Возврат Результат;
		
КонецФункции


Процедура ЗаполнениеМаршрутаИРаботПоРейсуДляПрохожденияТочки(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
	
	ИмяСобытия = Нстр("ru = 'Ошибка при проведении прохождения точки'");
	
	ПрохождениеТочкиТЧРаботы = Реквизиты.Работы;
	
	Пройдена = Истина;
	Отменена = Истина;
	ДосрочноПройдена = Ложь;
	тбзГрузовыеМестаКонтейнеры =  Новый ТаблицаЗначений;
	тбзГрузовыеМестаКонтейнеры = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ГрузовыеМестаКонтейнеры", Неопределено);
	Если тбзГрузовыеМестаКонтейнеры = Неопределено Тогда
		тбзГрузовыеМестаКонтейнеры = Новый ТаблицаЗначений;
		тбзГрузовыеМестаКонтейнеры.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
		тбзГрузовыеМестаКонтейнеры.Колонки.Добавить("Задание", Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	КонецЕсли;
	
	//Если ПрохождениеТочкиТЧРаботы.Количество() Тогда
	//	Для каждого СтрокаРаботаТЧ Из ПрохождениеТочкиТЧРаботы Цикл
	//		Пройдена = Пройдена И (СтрокаРаботаТЧ.Выполнена ИЛИ СтрокаРаботаТЧ.Отменена);
	//		Отменена = Отменена И СтрокаРаботаТЧ.Отменена;
	//	КонецЦикла;
	//Иначе
	//	Пройдена = Истина;
	//	Отменена = Ложь;
	//КонецЕсли; 
	//
	//Если Отменена Тогда
	//	Пройдена = Ложь;
	//КонецЕсли;

	ИдентификаторТочки = Реквизиты.Идентификатор;
			
	мсвРаботыПоТочке = Работы.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочки));
	
	Если мсвРаботыПоТочке.Количество() Тогда
		Для каждого СтрокаРабота Из мсвРаботыПоТочке Цикл
			
			мсвСтрокиРаботТЧ = ПрохождениеТочкиТЧРаботы.НайтиСтроки(Новый Структура("ИдентификаторРаботы", СтрокаРабота.ИдентификаторРаботы));
			Если мсвСтрокиРаботТЧ.Количество() > 0  Тогда
				СтрокаРаботаТЧ = мсвСтрокиРаботТЧ[0];
				Пройдена = Пройдена И (СтрокаРаботаТЧ.Выполнена ИЛИ СтрокаРаботаТЧ.Отменена);
				Отменена = Отменена И СтрокаРаботаТЧ.Отменена;
				ДосрочноПройдена = ДосрочноПройдена Или СтрокаРаботаТЧ.Проблема = Справочники.упПроблемы.ДосрочноеПрохождение;
			Иначе	
				Пройдена = Пройдена И (СтрокаРабота.Выполнена ИЛИ СтрокаРабота.Отменена);
				Отменена = Отменена И СтрокаРабота.Отменена;
				ДосрочноПройдена = ДосрочноПройдена Или СтрокаРабота.Проблема = Справочники.упПроблемы.ДосрочноеПрохождение;
			КонецЕсли;
									
		КонецЦикла;
	Иначе
		Пройдена = Истина;
		Отменена = Ложь;
	КонецЕсли; 
	
	Если Отменена Тогда
		Если ДосрочноПройдена Тогда
			Пройдена = Истина;	
			Отменена = Ложь;
		Иначе
			Пройдена = Ложь;	
		КонецЕсли;
	КонецЕсли;
	
	мсвСтрокиТочки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", ИдентификаторТочки));
	
	Если мсвСтрокиТочки.Количество() > 0 Тогда
		
		СтрокаТочка = мсвСтрокиТочки[0];
		Для каждого текПоле Из сткЗначенияСтрокиМаршрутаДоРедактирования Цикл
			сткЗначенияСтрокиМаршрутаДоРедактирования.Вставить(текПоле.Ключ, СтрокаТочка[текПоле.Ключ]);
		КонецЦикла;
		
		СтрокаТочка.Пройдена = Пройдена;
		СтрокаТочка.Отменена = Отменена;
		СтрокаТочка.Отложена = Ложь;
		СтрокаТочка.РасстояниеОтПредыдущейточкиФакт = Реквизиты.РасстояниеОтПредыдущейточки;
		СтрокаТочка.ПрибытиеФакт	= Реквизиты.НачалоВыполнения;
		СтрокаТочка.УбытиеФакт = Реквизиты.ОкончаниеВыполнения;
		СтрокаТочка.НачалоРаботФакт = Реквизиты.НачалоРабот;
		СтрокаТочка.ВремяПростояПоВинеЗаказчикаЧасы = Реквизиты.ВремяПростояПоВинеЗаказчикаЧасы;
		СтрокаТочка.ВремяПростояПоВинеПеревозчикаЧасы = Реквизиты.ВремяПростояПоВинеПеревозчикаЧасы;
		
		// Если порядок прохождения точек был нарушен, необходимо перенумеровать точки
		СтрокаНомер = 1;
		Маршрут.Сортировать("СтрокаНомер");
		Для каждого СтрокаТочкаМаршрута Из Маршрут Цикл
			Если СтрокаТочкаМаршрута.Пройдена ИЛИ СтрокаТочкаМаршрута.Отменена  Тогда
				СтрокаТочкаМаршрута.СтрокаНомер = СтрокаНомер;
				СтрокаНомер = СтрокаНомер + 1;
			КонецЕсли;			
		КонецЦикла;
		
		Для каждого СтрокаТочкаМаршрута Из Маршрут Цикл
			Если НЕ(СтрокаТочкаМаршрута.Пройдена ИЛИ СтрокаТочкаМаршрута.Отменена) Тогда
				СтрокаТочкаМаршрута.СтрокаНомер = СтрокаНомер;
				СтрокаНомер = СтрокаНомер + 1;
			КонецЕсли;			
		КонецЦикла;

		Маршрут.Сортировать("СтрокаНомер");
		
		НомерСтрокиДляПерепланирования = Неопределено;
		ПерепланироватьРаботыМаршрута = упЗаданиеНаПеревозкуВызовСервера.ПринятьФактическоеУбытиеИзТочкиЗаПлановое(СтрокаТочка, ПересчитыватьПлановоеВремяПосещенияТочекМаршрута,ДопустимыйПериодРассогласованностиСФактическимиДанными);
		Если ПерепланироватьРаботыМаршрута Тогда
			
			// Для перепланирования берется индекс предыдущей точки
			НомерСтрокиДляПерепланирования = ?(СтрокаТочка.НомерСтроки - 2 > 0, СтрокаТочка.НомерСтроки - 2, 0);
			
		КонецЕсли;
		
		Для каждого СтрокаРаботаТЧ Из ПрохождениеТочкиТЧРаботы Цикл
			
			ИдентификаторРаботы = СтрокаРаботаТЧ.ИдентификаторРаботы;
			
			мсвСтрокРаботы = Работы.НайтиСтроки(Новый Структура("ИдентификаторРаботы",ИдентификаторРаботы));
			ПорядковыйНомерНовойТочки = Неопределено;
			Если мсвСтрокРаботы.Количество() > 0 Тогда
				
				СтрокаРабота = мсвСтрокРаботы[0];
				
				Для каждого текПоле Из сткЗначенияСтрокиРаботДоРедактирования Цикл
					сткЗначенияСтрокиРаботДоРедактирования.Вставить(текПоле.Ключ, СтрокаРабота[текПоле.Ключ]);
				КонецЦикла;
				
				СтрокаРабота.ГрузРазделен = СтрокаРаботаТЧ.ГрузРазделен; 
				СтрокаРабота.Отложена = Ложь;
				СтрокаРабота.Сумма = СтрокаРаботаТЧ.Сумма;
				СтрокаРабота.Выполнена = СтрокаРаботаТЧ.Выполнена; 
				СтрокаРабота.Отменена = СтрокаРаботаТЧ.Отменена;
				СтрокаРабота.Проблема = СтрокаРаботаТЧ.Проблема;
				СтрокаРабота.АдресРазгрузки = СтрокаРаботаТЧ.АдресРазгрузки;
				СтрокаРабота.СкладскаяЯчейка = СтрокаРаботаТЧ.СкладскаяЯчейка;
				СтрокаРабота.КоличествоЭкземпляровДокумента	= СтрокаРаботаТЧ.КоличествоЭкземпляровДокумента;
				СтрокаРабота.ЗапрещеноСозданиеНовойТочкиМаршрута = СтрокаРаботаТЧ.ЗапрещеноСозданиеНовойТочкиМаршрута; 
				
				Если Истина
					И СтрокаРабота.Проблема <> Справочники.упПроблемы.ДосрочноеПрохождение
					И ЗначениеЗаполнено(СтрокаРабота.АдресРазгрузки)
					И СтрокаТочка.Адрес = СтрокаРабота.АдресРазгрузки
				Тогда
					СтрокаРабота.АдресРазгрузки  = ПредопределенноеЗначение("Справочник.упАдреса.ПустаяСсылка");
					ТекстСообщения = Нстр("ru = 'Адрес разгрузки не должен совпадать с адресом текущей точки'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("упКорректировкаРейса.Работы",СтрокаРабота.НомерСтроки,"АдресРазгрузки"),,Отказ);
				КонецЕсли;
				
				Если Истина
					И СтрокаРабота.Выполнена
					И СтрокаРабота.Операция = Перечисления.упТипыОпераций.Разгрузка
					И СтрокаРабота.ЭтоКонтейнер
				Тогда
					НоваяСтрока = тбзГрузовыеМестаКонтейнеры.Добавить();
					НоваяСтрока.ГрузовоеМесто = СтрокаРабота.ГрузовоеМесто;
					НоваяСтрока.Задание = СтрокаРабота.Задание;
				КонецЕсли;

				
				СтарыйАдрес = Справочники.упАдреса.ПустаяСсылка();
				СтараяПроблема = Справочники.упПроблемы.ПустаяСсылка();
				
				сткВозврата = Неопределено;
				упПрохождениеТочкиКлиентСервер.ОбработатьИзменениеРаботы(СтрокаРабота, Маршрут, Работы, СтараяПроблема, СтарыйАдрес, сткВозврата, СтрокаТочка.СтрокаНомер, АдресаПогрузкиПоРейсу, ПорядковыйНомерНовойТочки);
				Если НЕ ПорядковыйНомерНовойТочки = Неопределено Тогда
					ПерепланироватьРаботыМаршрута = Истина;
					Если НЕ НомерСтрокиДляПерепланирования = Неопределено Тогда
						НомерСтрокиДляПерепланирования = Мин(НомерСтрокиДляПерепланирования, ПорядковыйНомерНовойТочки - 2);
					Иначе
						НомерСтрокиДляПерепланирования = ПорядковыйНомерНовойТочки - 2;
					КонецЕсли;
					НомерСтрокиДляПерепланирования = ?(НомерСтрокиДляПерепланирования > 0, НомерСтрокиДляПерепланирования, 0);
					
				КонецЕсли;
				ОбработатьИзменениеСтрокиРаботы(СтрокаРабота.НомерСтроки, СтрокаТочка.НомерСтроки, , , Ложь, Отказ, , сткВозврата,,,Ложь);
				
			Иначе
				ОписаниеОшибки = Нстр("ru = 'Табличная часть работы содержит устаревшие данные, перезаполните документ'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,Ссылка,,,Отказ);
				
				ОписаниеОшибки = Нстр("ru = 'Не найдена работа с идентификатором %1'");
				ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ИдентификаторРаботы);
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки);    
				
			КонецЕсли;					
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ Отказ И ПерепланироватьРаботыМаршрута Тогда
			СпланироватьРаботыПоМаршруту(НомерСтрокиДляПерепланирования, Ложь,Ложь,,,Ложь);					
		КонецЕсли;
		
	Иначе
		ОписаниеОшибки = Нстр("ru = 'Табличная часть работы содержит устаревшие данные, перезаполните документ'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,Ссылка,,,Отказ);
		
		ОписаниеОшибки = Нстр("ru = 'Не найдена точка с идентификатором %1'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ИдентификаторТочки);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки);    
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ГрузовыеМестаКонтейнеры", тбзГрузовыеМестаКонтейнеры);
			
КонецПроцедуры

Процедура ЗаполнениеМаршрутаИРаботПоРейсуДляПроисшествияВозвратНаСклад(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);

	МаксСтрокаНомер = 0;
	ПроисшествиеСтрокаНомер = 0;
	УбытиеИзПредыдущейТочки = Неопределено;
	
	// Отменяются все не пройденные точки.
	Для каждого СтрокаТочка Из Маршрут Цикл
		
		Если СтрокаТочка.СтрокаНомер > МаксСтрокаНомер Тогда
			МаксСтрокаНомер = СтрокаТочка.СтрокаНомер;
		КонецЕсли;
		
		Если СтрокаТочка.Пройдена ИЛИ СтрокаТочка.Отменена Тогда
			Если СтрокаТочка.СтрокаНомер > ПроисшествиеСтрокаНомер Тогда
				ПроисшествиеСтрокаНомер = СтрокаТочка.СтрокаНомер;
			КонецЕсли;
			Если СтрокаТочка.Пройдена Тогда
				УбытиеИзПредыдущейТочки = СтрокаТочка.УбытиеФакт;
			КонецЕсли;

			Продолжить;
		КонецЕсли;
		
		СтрокаТочка.СтрокаНомер = СтрокаТочка.СтрокаНомер + 1;//Не пройденные точки сдвигаются на одну, для точки проиcшествия.
		Если НЕ ЗначениеЗаполнено(СтрокаТочка.Гараж) Тогда
			СтрокаТочка.Отменена = Истина;	
		КонецЕсли;
				
	КонецЦикла;

	МаксСтрокаНомер = МаксСтрокаНомер + 1;
	НомерТочкиПланирования = МаксСтрокаНомер;
	ПроисшествиеСтрокаНомер = ПроисшествиеСтрокаНомер + 1;
	
	Если НЕ УбытиеИзПредыдущейТочки = Неопределено 
			И УбытиеИзПредыдущейТочки > Реквизиты.НачалоВыполнения Тогда
		ОписаниеОшибки = Нстр("ru = 'Прибытие в точку происшествия %1 произошло раньше чем убытие из предыдущей точки %2'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, Реквизиты.НачалоВыполнения, УбытиеИзПредыдущейТочки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,,,,Отказ);
		Событие = Нстр("ru = 'Ошибка при проведении происшествия в пути'");
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки);   
		Возврат;
	КонецЕсли;
	
	// Последней пройденной точкой становится точка проиcшествия.
	СтрокаТочка = Маршрут.Добавить();
	СтрокаТочка.ТипТочки = Перечисления.упТипыТочекМаршрута.ПроисшествиеВПути;
	СтрокаТочка.Идентификатор = Реквизиты.Идентификатор;
	СтрокаТочка.СтрокаНомер = ПроисшествиеСтрокаНомер;
    	СтрокаТочка.Пройдена = Истина;
	СтрокаТочка.Отменена = Ложь;
	СтрокаТочка.Адрес = Реквизиты.АдресПроисшествия;
	СтрокаТочка.ПрибытиеФакт	= Реквизиты.НачалоВыполнения;
	СтрокаТочка.НачалоРаботФакт = Реквизиты.НачалоВыполнения;
	СтрокаТочка.УбытиеФакт = Реквизиты.ОкончаниеВыполнения;
	СтрокаТочка.ПлановоеПрибытие = Реквизиты.НачалоВыполнения;
	СтрокаТочка.НачалоРаботПлан = Реквизиты.НачалоВыполнения;
	СтрокаТочка.ПлановоеУбытие = Реквизиты.ОкончаниеВыполнения;
	
	тбзОтмененныеПогрузки = Новый ТаблицаЗначений;
	тбзОтмененныеПогрузки.Колонки.Добавить("Задание", Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	тбзОтмененныеПогрузки.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
			
	Если НЕ ЗначениеЗаполнено(Реквизиты.АдресВозврата) Тогда
		
		тбзТочкиРазгрузки = Новый ТаблицаЗначений;
		тбзТочкиРазгрузки.Колонки.Добавить("Адрес", Новый ОписаниеТипов("СправочникСсылка.упАдреса"));
		тбзТочкиРазгрузки.Колонки.Добавить("Задание", Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
		тбзТочкиРазгрузки.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
		тбзТочкиРазгрузки.Колонки.Добавить("ТипРегламентногоДокумента", Новый ОписаниеТипов("СправочникСсылка.упТипыРегламентныхДокументов"));
		
		тбзОтмененныеПогрузки = тбзТочкиРазгрузки.СкопироватьКолонки("Задание, ГрузовоеМесто");
		
		соотАдресовИдентификаторам = Новый Соответствие;
		соотИдентификаторовАдресам = Новый Соответствие;
			
		СтрокаНомер = 1;
		
		тбзНовыеРаботы = Работы.ВыгрузитьКолонки();
		
		// Отменяются все работы и создаются новые работы разгрузки по адресу возврата.
		Для каждого СтрокаРабота Из Работы Цикл
			
			// Заполняются адреса точек погрузки по заданиям и грузовым местам.
			Если Истина
				И СтрокаРабота.Выполнена 
				И (Ложь
				   Или упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(СтрокаРабота.Операция)
				   Или СтрокаРабота.Операция = Перечисления.упТипыОпераций.ПолучениеДокументов) 
			Тогда
				АдресПогрузки = соотАдресовИдентификаторам.Получить(СтрокаРабота.Идентификатор);		
				
				Если АдресПогрузки = Неопределено Тогда
					мсвТочкаПогрузки = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", СтрокаРабота.Идентификатор));		
					Если мсвТочкаПогрузки.Количество() Тогда
						АдресПогрузки = мсвТочкаПогрузки[0].Адрес;
						соотАдресовИдентификаторам.Вставить(СтрокаРабота.Идентификатор, АдресПогрузки);
					Иначе	
						ОписаниеОшибки = Нстр("ru = 'При проведении документа возникла ошибка'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,,,,Отказ);
						ОписаниеОшибки = Нстр("ru = 'В маршруте не найдена точка с идентификатором %1'");
						ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, СтрокаРабота.Идентификатор);
						Событие = Нстр("ru = 'Ошибка при проведении происшествия в пути'");
						ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки); 	
					КонецЕсли;	
				КонецЕсли;
				
				Если НЕ Отказ Тогда
					НоваяСтрокаТочка = тбзТочкиРазгрузки.Добавить();		
					НоваяСтрокаТочка.Адрес = АдресПогрузки;
					НоваяСтрокаТочка.Задание = СтрокаРабота.Задание; 
					НоваяСтрокаТочка.ГрузовоеМесто = СтрокаРабота.ГрузовоеМесто;
					НоваяСтрокаТочка.ТипРегламентногоДокумента = СтрокаРабота.ТипРегламентногоДокумента;
				КонецЕсли;
			КонецЕсли;
			
			Если Отказ Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаРабота.Выполнена
					ИЛИ СтрокаРабота.Отменена Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаРабота.Отменена = Истина;
			СтрокаРабота.Проблема = Реквизиты.Проблема;		
			
			Если упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(СтрокаРабота.Операция) Тогда
				
				мсвОтмененныеРаботыПогрузки = тбзОтмененныеПогрузки.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", СтрокаРабота.Задание, СтрокаРабота.ГрузовоеМесто));
				
				Если мсвОтмененныеРаботыПогрузки.Количество() = 0 Тогда
				
					// Найти адрес разгрузки
					мсвТочкиПогрузки = тбзТочкиРазгрузки.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, ТипРегламентногоДокумента", СтрокаРабота.Задание, СтрокаРабота.ГрузовоеМесто, СтрокаРабота.ТипРегламентногоДокумента));
					
					АдресПогрузки = Неопределено;
					
					Если мсвТочкиПогрузки.Количество() > 0 Тогда
						АдресПогрузки = мсвТочкиПогрузки[0].Адрес; 	
					Иначе	
						ОписаниеОшибки = Нстр("ru = 'При проведении документа возникла ошибка'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,,,,Отказ);
						ОписаниеОшибки = Нстр("ru = 'Не удалось найти точку погрузки с реквизитами %1:%2:%3'");
						ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, СтрокаРабота.Задание, СтрокаРабота.ГрузовоеМесто, СтрокаРабота.ТипРегламентногоДокумента);
						Событие = Нстр("ru = 'Ошибка при проведении происшествия в пути'");
						ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки);	
					КонецЕсли;
					
					Если НЕ Отказ Тогда
						
						// Найти точку разгрузки.
						сткТочкаРазгрузки = соотИдентификаторовАдресам.Получить(АдресПогрузки);
						ИдентификаторТочкиРазгрузки = Неопределено;
						
						// Если точки еще нет. 
						Если сткТочкаРазгрузки = Неопределено Тогда
							
							ИдентификаторТочкиРазгрузки = Новый УникальныйИдентификатор;
							
							Если МаксСтрокаНомер > 1 Тогда
								ПоследняяТочка = Маршрут[МаксСтрокаНомер - 2]; // Последняя точка происшествие
							КонецЕсли;
							
							МаксСтрокаНомер = МаксСтрокаНомер + 1;
							// Если последняя точка гараж.
							Если ЗначениеЗаполнено(ПоследняяТочка.Гараж) Тогда
								НомерНовойСтроки = ПоследняяТочка.СтрокаНомер;
								ПоследняяТочка.СтрокаНомер = МаксСтрокаНомер;
							Иначе
								НомерНовойСтроки = МаксСтрокаНомер; 		
							КонецЕсли;
							
							СтрокаТочка = Маршрут.Добавить();
							СтрокаТочка.Идентификатор = ИдентификаторТочкиРазгрузки;
							СтрокаТочка.СтрокаНомер = НомерНовойСтроки;
							СтрокаТочка.Пройдена = Ложь;
							СтрокаТочка.Отменена = Ложь;
							СтрокаТочка.Адрес = АдресПогрузки;
							СтрокаТочка.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаПоЗаданию;
							СтрокаНомер = 1;
							
						Иначе	
							ИдентификаторТочкиРазгрузки = сткТочкаРазгрузки.Идентификатор;
							СтрокаНомер = сткТочкаРазгрузки.СтрокаНомер + 1; 
						КонецЕсли;
						сткТочкаРазгрузки = Новый Структура("Идентификатор, СтрокаНомер",ИдентификаторТочкиРазгрузки, СтрокаНомер);
						соотИдентификаторовАдресам.Вставить(АдресПогрузки, сткТочкаРазгрузки);
						
						СтрокаРабота.АдресРазгрузки	= АдресПогрузки;	
						
						НоваяСтрокаРабота = тбзНовыеРаботы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРабота, СтрокаРабота);
						НоваяСтрокаРабота.Проблема = Справочники.упПроблемы.ПустаяСсылка();
						НоваяСтрокаРабота.АдресРазгрузки = Справочники.упАдреса.ПустаяСсылка();
						НоваяСтрокаРабота.Выполнена = Ложь;
						НоваяСтрокаРабота.Отменена = Ложь;
						НоваяСтрокаРабота.Идентификатор = ИдентификаторТочкиРазгрузки;
						НоваяСтрокаРабота.ИдентификаторРаботы = Новый УникальныйИдентификатор;
						НоваяСтрокаРабота.СтрокаНомер = СтрокаНомер;
						
					КонецЕсли;
					Если Отказ Тогда
						Прервать;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(СтрокаРабота.Операция) Тогда
				НоваяСтрокаРабота = тбзОтмененныеПогрузки.Добавить();
				НоваяСтрокаРабота.Задание = СтрокаРабота.Задание; 
				НоваяСтрокаРабота.ГрузовоеМесто = СтрокаРабота.ГрузовоеМесто;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого НоваяСтрокаРабота Из тбзНовыеРаботы Цикл
			СтрокаРабота = Работы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРабота, НоваяСтрокаРабота);
		КонецЦикла;
		
	Иначе
		
		Если МаксСтрокаНомер > 1 Тогда
			ПоследняяТочка = Маршрут[МаксСтрокаНомер - 2]; // Последняя точка происшествие
		КонецЕсли;
		
		МаксСтрокаНомер = МаксСтрокаНомер + 1;
		
		// Если последняя точка гараж.
		Если ЗначениеЗаполнено(ПоследняяТочка.Гараж) Тогда
			НомерНовойСтроки			= ПоследняяТочка.СтрокаНомер;
			ПоследняяТочка.СтрокаНомер 	= МаксСтрокаНомер;
		Иначе
			НомерНовойСтроки = МаксСтрокаНомер; 		
		КонецЕсли;

		// Создается точка разгрузки по адресу возврата.
		СтрокаТочка = Маршрут.Добавить();
		СтрокаТочка.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаПоЗаданию;
		СтрокаТочка.Идентификатор = Новый УникальныйИдентификатор;
		СтрокаТочка.СтрокаНомер = НомерНовойСтроки;
		СтрокаТочка.Пройдена = Ложь;
		СтрокаТочка.Отменена = Ложь;
		СтрокаТочка.Адрес = Реквизиты.АдресВозврата;
				
		
		СтрокаНомер = 1;
		
		тбзНовыеРаботы = Работы.ВыгрузитьКолонки();
		
		// Отменяются все работы и создаются новые работы разгрузки по адресу возврата.
		Для каждого СтрокаРабота Из Работы Цикл
			
			Если СтрокаРабота.Выполнена
					ИЛИ СтрокаРабота.Отменена Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаРабота.Отменена = Истина;
			СтрокаРабота.Проблема = Реквизиты.Проблема;	
			
			Если упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(СтрокаРабота.Операция) Тогда
				
				СтрокаРабота.АдресРазгрузки	= Реквизиты.АдресВозврата;	
				
				мсвОтмененныеРаботыПогрузки = тбзОтмененныеПогрузки.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", СтрокаРабота.Задание, СтрокаРабота.ГрузовоеМесто));
				
				Если мсвОтмененныеРаботыПогрузки.Количество() = 0 Тогда
					
					
					НоваяСтрокаРабота = тбзНовыеРаботы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаРабота, СтрокаРабота);
					НоваяСтрокаРабота.АдресРазгрузки = Справочники.упАдреса.ПустаяСсылка();
					НоваяСтрокаРабота.Проблема = Справочники.упПроблемы.ПустаяСсылка();
					НоваяСтрокаРабота.Выполнена = Ложь;
					НоваяСтрокаРабота.Отменена = Ложь;
					НоваяСтрокаРабота.Идентификатор = СтрокаТочка.Идентификатор;
					НоваяСтрокаРабота.ИдентификаторРаботы = Новый УникальныйИдентификатор;
					НоваяСтрокаРабота.СтрокаНомер = СтрокаНомер;
					НоваяСтрокаРабота.ПроблемаПричинаВозникновенияЭтойРаботы	= СтрокаРабота.Проблема;
					
					СтрокаНомер = СтрокаНомер + 1;
				КонецЕсли;
			ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(СтрокаРабота.Операция) Тогда
				НоваяСтрокаРабота = тбзОтмененныеПогрузки.Добавить();
				НоваяСтрокаРабота.Задание = СтрокаРабота.Задание; 
				НоваяСтрокаРабота.ГрузовоеМесто = СтрокаРабота.ГрузовоеМесто;
				
			КонецЕсли;
		КонецЦикла;
		
		Для каждого НоваяСтрокаРабота Из тбзНовыеРаботы Цикл
			СтрокаРабота = Работы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРабота, НоваяСтрокаРабота);
		КонецЦикла;
	КонецЕсли;	
	СпланироватьЗадачиПоМаршруту(НомерТочкиПланирования - 1, Ложь);
			
			
КонецПроцедуры

Процедура ЗаполнениеМаршрутаИРаботПоРейсуДляПроисшествияПродолжениеРейса(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ);
	
	МаксНомерПройденнойТочки = 0;
	
	УбытиеИзПредыдущейТочки = Неопределено;

	Для каждого СтрокаМаршрут Из Маршрут Цикл
		
		Если СтрокаМаршрут.Пройдена ИЛИ СтрокаМаршрут.Отменена Тогда
			Если СтрокаМаршрут.СтрокаНомер > МаксНомерПройденнойТочки Тогда
				МаксНомерПройденнойТочки = СтрокаМаршрут.СтрокаНомер;
			КонецЕсли;
			
			Если СтрокаМаршрут.Пройдена Тогда
				УбытиеИзПредыдущейТочки = СтрокаМаршрут.УбытиеФакт;
			КонецЕсли;

			Продолжить;
		КонецЕсли;
		
		СтрокаМаршрут.СтрокаНомер = СтрокаМаршрут.СтрокаНомер + 1;
		
	КонецЦикла;
	
	Если НЕ УбытиеИзПредыдущейТочки = Неопределено 
			И УбытиеИзПредыдущейТочки > Реквизиты.НачалоВыполнения Тогда
		ОписаниеОшибки = Нстр("ru = 'Прибытие в точку происшествия %1 произошло раньше чем убытие из предыдущей точки %2'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, Реквизиты.НачалоВыполнения, УбытиеИзПредыдущейТочки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки,,,,Отказ);
		Событие = Нстр("ru = 'Ошибка при проведении происшествия в пути'");
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,, , ОписаниеОшибки);    
		Возврат;
	КонецЕсли;
	
	// Добавляется точка простоя
	НомерТочки = МаксНомерПройденнойТочки + 1;
	СтрокаМаршрут	= Маршрут.Добавить();
	СтрокаМаршрут.ТипТочки			= Перечисления.упТипыТочекМаршрута.ПроисшествиеВПути;
	СтрокаМаршрут.Идентификатор		= Реквизиты.Идентификатор;
	СтрокаМаршрут.СтрокаНомер		= НомерТочки;
    СтрокаМаршрут.Пройдена			= Истина;
	СтрокаМаршрут.Отменена			= Ложь;
	СтрокаМаршрут.Адрес				= Реквизиты.АдресПроисшествия;
	СтрокаМаршрут.ПрибытиеФакт		= Реквизиты.НачалоВыполнения;
	СтрокаМаршрут.НачалоРаботФакт	= Реквизиты.НачалоВыполнения;
	СтрокаМаршрут.УбытиеФакт		= Реквизиты.ОкончаниеВыполнения;
	СтрокаМаршрут.ПлановоеПрибытие	= Реквизиты.НачалоВыполнения;
	СтрокаМаршрут.НачалоРаботПлан	= Реквизиты.НачалоВыполнения;
	СтрокаМаршрут.ПлановоеУбытие	= Реквизиты.ОкончаниеВыполнения;
		
	// Сдвигаются точки
	НомерСдвигаемойТочки = МаксНомерПройденнойТочки + 1;
	Для ИндексТочки = МаксНомерПройденнойТочки - 1 По Маршрут.Количество() - 2 Цикл
		СтрокаМаршрута 	= Маршрут[ИндексТочки];		
		СтрокаМаршрута 	= НомерСдвигаемойТочки + 1;
		НомерСдвигаемойТочки = НомерСдвигаемойТочки + 1;
	КонецЦикла;
	
	Маршрут.Сортировать("СтрокаНомер");
	
	СпланироватьЗадачиПоМаршруту(НомерТочки - 1, Ложь);
				
КонецПроцедуры

Процедура ЗаполнитьПараметрыПеревозки(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ)
	
	ПараметрыНаПеревозку = Неопределено;
	тбзРаботы = Неопределено;
	
	Если НЕ Реквизиты.Свойство("Работы", тбзРаботы) Тогда
		Возврат;
	КонецЕсли;	
	
	ИменаКолонок = "ГрузовоеМесто, Задание, Высота, Длина, КоличествоЗагрузочныхМетров, КоличествоМест, Масса, Объем, Ширина, ИзмененыПараметры";
	Если ТипЗнч(Реквизиты.Работы) = тип("ТаблицаЗначений") Тогда
		тбзРаботы = Реквизиты.Работы.Скопировать(,ИменаКолонок);	
	Иначе	
		тбзРаботы = Реквизиты.Работы.Выгрузить(,ИменаКолонок);	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	тбРаботы.ГрузовоеМесто КАК ГрузовоеМесто,
	|	тбРаботы.Задание КАК ЗаданиеНаПеревозку,
	|	тбРаботы.Высота КАК Высота,
	|	тбРаботы.Длина КАК Длина,
	|	тбРаботы.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	тбРаботы.КоличествоМест КАК КоличествоМест,
	|	тбРаботы.Масса КАК Масса,
	|	тбРаботы.Объем КАК Объем,
	|	тбРаботы.Ширина КАК Ширина,
	|	тбРаботы.ИзмененыПараметры КАК ИзмененыПараметры
	|ПОМЕСТИТЬ втРаботы
	|ИЗ
	|	&тбРаботы КАК тбРаботы
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРаботыТ.*,
	|	упЗаданиеНаПеревозкуГрузаТ.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозку
	|ИЗ
	|	втРаботы КАК втРаботыТ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГрузаТ
	|	ПО втРаботыТ.ЗаданиеНаПеревозку = упЗаданиеНаПеревозкуГрузаТ.Ссылка
	|ГДЕ втРаботыТ.ИзмененыПараметры
	|";
	
	Запрос.УстановитьПараметр("тбРаботы", тбзРаботы);
	
	ПараметрыНаПеревозку = Запрос.Выполнить().Выгрузить();
	ДополнительныеСвойства.Вставить("ПараметрыНаПеревозку",ПараметрыНаПеревозку);
	
КонецПроцедуры

Процедура ФормированиеГрузовыхМестИДвиженийПриРазделенииГрузовыхМест(ДополнительныеСвойства, Ссылка, Реквизиты, Отказ)
	
	ТоварныйСоставГруза	= Неопределено;
	тбзРаботы	= Неопределено;
	ПараметрыНаПеревозку = Неопределено;
	ПрерываниеГрузовыхПотоков = Неопределено;
	
	Если Истина
		И НЕ ДополнительныеСвойства.Свойство("ТоварныйСоставГруза", ТоварныйСоставГруза)
		И НЕ Реквизиты.Свойство("Работы", тбзРаботы)	Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ДополнительныеСвойства.Свойство("ПараметрыНаПеревозку", ПараметрыНаПеревозку) Тогда
		Возврат;
	КонецЕсли;	
		
	Если ТипЗнч(Реквизиты.Работы) = тип("ТаблицаЗначений") Тогда
		тбзРаботы = Реквизиты.Работы.Скопировать(,"ГрузовоеМесто, Операция,Задание");	
	Иначе	
		тбзРаботы = Реквизиты.Работы.Выгрузить(,"ГрузовоеМесто, Операция,Задание");	
	КонецЕсли;
					
	ТоварныйСоставГруза	= ДополнительныеСвойства.ТоварныйСоставГруза;
	ПрерыванияГрузовыхПотоков = ДополнительныеСвойства.ПрерыванияГрузовыхПотоков;
	
	// Строки по грузовым местам, которые образовались в следствии изменения грузовых мест.
	ТоварныйСоставИзмененныхГрузовыхМест = ТоварныйСоставГруза.Скопировать(Новый Структура("ГрузовоеМесто", Справочники.упГрузовыеМеста.ПустаяСсылка()));

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|//{Запрос: 0 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	тбРаботы.ГрузовоеМесто КАК ГрузовоеМесто,
	|	тбРаботы.Операция КАК Операция,
	|	тбРаботы.Задание КАК Задание
	|ПОМЕСТИТЬ втРаботы
	|ИЗ
	|	&тбРаботы КАК тбРаботы
	|;
	|//{Запрос: 1 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	тбТоварныйСостав.ЗаданиеНаПеревозкуГруза КАК ЗаданиеНаПеревозкуГруза,
	|	тбТоварныйСостав.АдресРазгрузки КАК АдресРазгрузки,
	|	тбТоварныйСостав.ГрузовоеМестоРодитель КАК ГрузовоеМестоРодитель,
	|	тбТоварныйСостав.ЕдиныйГруз КАК ЕдиныйГруз,
	|	тбТоварныйСостав.Проблема КАК Проблема,
	|	тбТоварныйСостав.АналитическийРазрез КАК АналитическийРазрез,
	|	тбТоварныйСостав.ГрузовоеМесто КАК ГрузовоеМесто,
	|	тбТоварныйСостав.Количество КАК Количество,
	|	тбТоварныйСостав.Номенклатура КАК Номенклатура,
	|	тбТоварныйСостав.НомерСтроки КАК НомерСтроки,
	|	тбТоварныйСостав.СтавкаНДС КАК СтавкаНДС,
	|	тбТоварныйСостав.Сумма КАК Сумма,
	|	тбТоварныйСостав.СуммаБезНДС КАК СуммаБезНДС,
	|	тбТоварныйСостав.СуммаНДС КАК СуммаНДС,
	|	тбТоварныйСостав.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	тбТоварныйСостав.Цена КАК Цена,
	|	тбТоварныйСостав.КоличествоГрузов КАК КоличествоГрузов
	|ПОМЕСТИТЬ втТоварныйСостав
	|ИЗ
	|	&тбТоварныйСостав КАК тбТоварныйСостав
	|;
	|//{Запрос: 2 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втРаботы.ГрузовоеМесто КАК ГрузовоеМесто,
	|	втРаботы.Операция КАК Операция,
	|	втРаботы.Задание КАК Задание
	|ПОМЕСТИТЬ втРаботыПогрузкиРазгрузки
	|ИЗ
	|	втРаботы КАК втРаботы
	|ГДЕ втРаботы.Операция В (ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Погрузка),
	|		ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка))
	|;
	|//{Запрос: 3 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТоварныйСостав.ЗаданиеНаПеревозкуГруза КАК ЗаданиеНаПеревозкуГруза,
	|	втТоварныйСостав.АдресРазгрузки КАК АдресРазгрузки,
	|	втТоварныйСостав.ГрузовоеМестоРодитель КАК ГрузовоеМестоРодитель,
	|	втТоварныйСостав.ЕдиныйГруз КАК ЕдиныйГруз,
	|	втТоварныйСостав.Проблема КАК Проблема,
	|	втТоварныйСостав.АналитическийРазрез КАК АналитическийРазрез,
	|	ВЫБОР
	|		КОГДА втТоварныйСостав.ЕдиныйГруз
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
	|		ИНАЧЕ втТоварныйСостав.ГрузовоеМестоРодитель
	|	КОНЕЦ КАК ГрузовоеМестоГруппировка,
	|	втТоварныйСостав.Количество КАК Количество,
	|	втТоварныйСостав.Номенклатура КАК Номенклатура,
	|	втТоварныйСостав.НомерСтроки КАК НомерСтроки,
	|	втТоварныйСостав.СтавкаНДС КАК СтавкаНДС,
	|	втТоварныйСостав.Сумма КАК Сумма,
	|	втТоварныйСостав.СуммаБезНДС КАК СуммаБезНДС,
	|	втТоварныйСостав.СуммаНДС КАК СуммаНДС,
	|	втТоварныйСостав.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	втТоварныйСостав.Цена КАК Цена,
	|	втТоварныйСостав.КоличествоГрузов КАК КоличествоГрузов,
	|	упЗаданиеНаПеревозкуГруза.Номер КАК Номер,
	|	упЗаданиеНаПеревозкуГруза.АдресОтправления КАК АдресОтправления,
	|	упЗаданиеНаПеревозкуГруза.АдресПолучения КАК АдресПолучения,
	|	ЕСТЬNULL(упУпаковкиНоменклатурыТ.Масса, 0) * втТоварныйСостав.Количество КАК Масса,
	|	ЕСТЬNULL(упУпаковкиНоменклатурыТ.Объем, 0) * втТоварныйСостав.Количество КАК Объем,
	|	упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза
	|ИЗ
	|	втТоварныйСостав КАК втТоварныйСостав
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГруза
	|	ПО ИСТИНА
	|		И втТоварныйСостав.ЗаданиеНаПеревозкуГруза = упЗаданиеНаПеревозкуГруза.Ссылка
	|		И втТоварныйСостав.ГрузовоеМесто = ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упУпаковкиНоменклатуры КАК упУпаковкиНоменклатурыТ
	|	ПО втТоварныйСостав.УпаковкаНоменклатуры = упУпаковкиНоменклатурыТ.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(КоличествоГрузов),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(АдресОтправления),
	|	МАКСИМУМ(АдресПолучения),
	|	СУММА(Масса),
	|	СУММА(Объем)
	|ПО
	|	ЗаявкаНаПеревозкуГруза,
	|	ЗаданиеНаПеревозкуГруза,
	|	ЕдиныйГруз,
	|	ГрузовоеМестоГруппировка,
	|	АдресРазгрузки,
	|	Проблема
	|;
	|//{Запрос: 4 ////////////////////////////////////////
	|ВЫБРАТЬ
	|	упГрузовыеМеста.Ссылка КАК Ссылка,
	|	упГрузовыеМеста.Код КАК Код,
	|	упГрузовыеМеста.БеречьОтВлаги КАК БеречьОтВлаги,
	|	упГрузовыеМеста.БеречьОтИзлучения КАК БеречьОтИзлучения,
	|	упГрузовыеМеста.БеречьОтНагрева КАК БеречьОтНагрева,
	|	упГрузовыеМеста.Валюта КАК Валюта,
	|	упГрузовыеМеста.Высота КАК Высота,
	|	упГрузовыеМеста.Длина КАК Длина,
	|	упГрузовыеМеста.ДокументОснование КАК ДокументОснование,
	|	упГрузовыеМеста.КлассОпасности КАК КлассОпасности,
	|	упГрузовыеМеста.КоличествоЗагрузочныхМетров КАК КоличествоЗагрузочныхМетров,
	|	упГрузовыеМеста.КоличествоМест КАК КоличествоМест,
	|	упГрузовыеМеста.Масса КАК Масса,
	|	упГрузовыеМеста.ОбщийГрузПоЗаявке КАК ОбщийГрузПоЗаявке,
	|	упГрузовыеМеста.Объем КАК Объем,
	|	упГрузовыеМеста.Описание КАК Описание,
	|	упГрузовыеМеста.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	упГрузовыеМеста.Сумма КАК Сумма,
	|	упГрузовыеМеста.СуммаНДС КАК СуммаНДС,
	|	упГрузовыеМеста.ТемпературныйРежим КАК ТемпературныйРежим,
	|	упГрузовыеМеста.ТипГруза КАК ТипГруза,
	|	упГрузовыеМеста.Хрупкий КАК Хрупкий,
	|	упГрузовыеМеста.Ширина КАК Ширина,
	|	упГрузовыеМеста.Штрихкод КАК Штрихкод,
	|	упГрузовыеМеста.Тара КАК Тара,
	|	упГрузовыеМеста.ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки КАК ВыемкаИнкассируемыхЦенностейВТочкеРазгрузки,
	|	упГрузовыеМеста.ЗапрещеноСкладироватьДругНаДруга КАК ЗапрещеноСкладироватьДругНаДруга
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		втТоварныйСостав.ГрузовоеМестоРодитель КАК ГрузовоеМестоРодитель
	|	ИЗ
	|		втТоварныйСостав КАК втТоварныйСостав
	|	ГДЕ втТоварныйСостав.ГрузовоеМесто = ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)) КАК ВложенныйЗапрос
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упГрузовыеМеста КАК упГрузовыеМеста
	|	ПО ВложенныйЗапрос.ГрузовоеМестоРодитель = упГрузовыеМеста.Ссылка
	|;
	|//{Запрос: 5 ////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	втТоварныйСостав.ЗаданиеНаПеревозкуГруза КАК ЗаданиеНаПеревозкуГруза,
	|	втТоварныйСостав.АдресРазгрузки КАК АдресРазгрузки,
	|	втТоварныйСостав.ГрузовоеМестоРодитель КАК ГрузовоеМестоРодитель,
	|	втТоварныйСостав.ЕдиныйГруз КАК ЕдиныйГруз,
	|	втТоварныйСостав.Проблема КАК Проблема,
	|	втТоварныйСостав.ГрузовоеМесто КАК ГрузовоеМесто,
	|	втТоварныйСостав.КоличествоГрузов КАК КоличествоГрузов,
	|	втРаботы.Операция КАК Операция,
	|	ЕстьNull(РазделениеГрузовыхМест.РодительИсходный, втТоварныйСостав.ГрузовоеМестоРодитель) КАК ГрузовоеМестоРодительИсходный
	|ИЗ
	|	втТоварныйСостав КАК втТоварныйСостав
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРаботыПогрузкиРазгрузки КАК втРаботы
	|	ПО ИСТИНА
	|		И втТоварныйСостав.ЗаданиеНаПеревозкуГруза = втРаботы.Задание
	|		И втТоварныйСостав.ГрузовоеМестоРодитель = втРаботы.ГрузовоеМесто
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упРазделениеГрузовыхМест.СрезПоследних(
	|		,
	|		) КАК РазделениеГрузовыхМест
	|	ПО РазделениеГрузовыхМест.ГрузовоеМесто = втТоварныйСостав.ГрузовоеМестоРодитель
	|";


	Запрос.УстановитьПараметр("тбТоварныйСостав", ТоварныйСоставГруза);
	Запрос.УстановитьПараметр("тбРаботы", тбзРаботы);
	
	мсвРезультатыЗапрос = Запрос.ВыполнитьПакет();
		
	тбзРеквизитыГрузовыхМест = мсвРезультатыЗапрос[4].Выгрузить();
	тбзГрузовыеМеста = мсвРезультатыЗапрос[5].Выгрузить();
	
	ВыборкаЗаявкаНаПеревозкуГруза = мсвРезультатыЗапрос[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Формируются новые грузовые места.
	Пока ВыборкаЗаявкаНаПеревозкуГруза.Следующий() Цикл
		
		ВыборкаЗаданиеНаПервозкуГруза = ВыборкаЗаявкаНаПеревозкуГруза.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ЗаявкаНаПеревозкуГруза = ВыборкаЗаявкаНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза;
				
		Пока ВыборкаЗаданиеНаПервозкуГруза.Следующий() Цикл
			
			ЗаданиеНаПеревозкуГруза = ВыборкаЗаданиеНаПервозкуГруза.ЗаданиеНаПеревозкуГруза;
			НомерЗаданияНаПеревозкуГруза = ВыборкаЗаданиеНаПервозкуГруза.Номер;
			ВыборкаЕдиныйГруз = ВыборкаЗаданиеНаПервозкуГруза.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЕдиныйГруз.Следующий() Цикл
				
				ЕдиныйГруз = ВыборкаЕдиныйГруз.ЕдиныйГруз;
				ВыборкаГрузовоеМесто = ВыборкаЕдиныйГруз.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Сч = 1;
				
				Пока ВыборкаГрузовоеМесто.Следующий() Цикл
					
					ГрузовоеМестоГруппировка = ВыборкаГрузовоеМесто.ГрузовоеМестоГруппировка;
					ВыборкаАдресРазгрузки = ВыборкаГрузовоеМесто.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаАдресРазгрузки.Следующий() Цикл
						
						АдресРазгрузки	= ВыборкаАдресРазгрузки.АдресРазгрузки;
						ВыборкаПроблема = ВыборкаАдресРазгрузки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаПроблема.Следующий() Цикл
							
							Проблема = ВыборкаПроблема.Проблема;
							
							ВыбранТипУЕдиногоГрузовогоМеста	= Ложь;
							НовоеГрузовоеМесто = Справочники.упГрузовыеМеста.СоздатьЭлемент();
							НовоеГрузовоеМесто.УстановитьСсылкуНового(Справочники.упГрузовыеМеста.ПолучитьСсылку(Новый УникальныйИдентификатор));
							
							ГрузовоеМесто = НовоеГрузовоеМесто.ПолучитьСсылкуНового();
							НоваяСтрокаПараметры = Неопределено;
							
							Если ПараметрыНаПеревозку <> Неопределено Тогда
								НоваяСтрокаПараметры = ПараметрыНаПеревозку.Добавить();
								НоваяСтрокаПараметры.ГрузовоеМесто = ГрузовоеМесто;
								НоваяСтрокаПараметры.ЗаданиеНаПеревозку = ЗаданиеНаПеревозкуГруза;
								НоваяСтрокаПараметры.ЗаявкаНаПеревозку = ЗаявкаНаПеревозкуГруза;
							КонецЕсли;
							
							Если НЕ ЕдиныйГруз Тогда
								
								мсвСтрокиРеквизитыГрузовогоМеста = тбзРеквизитыГрузовыхМест.НайтиСтроки(Новый Структура("Ссылка", ГрузовоеМестоГруппировка));
								Если мсвСтрокиРеквизитыГрузовогоМеста.Количество() > 0 Тогда
									ЗаполнитьЗначенияСвойств(НовоеГрузовоеМесто, мсвСтрокиРеквизитыГрузовогоМеста[0]);	
									Если НоваяСтрокаПараметры <> Неопределено Тогда
										ЗаполнитьЗначенияСвойств(НоваяСтрокаПараметры, мсвСтрокиРеквизитыГрузовогоМеста[0]);	
									КонецЕсли;	
									НовоеГрузовоеМесто.Код = СтрШаблон("%1-%2", мсвСтрокиРеквизитыГрузовогоМеста[0].Код, Сч);
								КонецЕсли;
								
							Иначе	
								НовоеГрузовоеМесто.Код = СтрШаблон("%1", НомерЗаданияНаПеревозкуГруза);
							КонецЕсли;
							
							Выборка = ВыборкаПроблема.Выбрать();
							Пока Выборка.Следующий() Цикл
								НоваяСтрока = 	НовоеГрузовоеМесто.ТоварныйСоставГруза.Добавить();
								ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
								Если ЕдиныйГруз Тогда
									
									НоваяСтрока.Количество = Выборка.Количество * Выборка.КоличествоГрузов;
									НоваяСтрока.Сумма = НоваяСтрока.Количество * Выборка.Цена;
									упОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммуНДС(НоваяСтрока);
									
									Если НЕ ВыбранТипУЕдиногоГрузовогоМеста Тогда
										
										мсвСтрокиРеквизитыГрузовогоМеста = тбзРеквизитыГрузовыхМест.НайтиСтроки(Новый Структура("Ссылка", Выборка.ГрузовоеМестоРодитель));
										Если мсвСтрокиРеквизитыГрузовогоМеста.Количество() > 0 Тогда
											НовоеГрузовоеМесто.ТипГруза = мсвСтрокиРеквизитыГрузовогоМеста[0].ТипГруза;
										КонецЕсли;
										
										ВыбранТипУЕдиногоГрузовогоМеста = Истина;
									КонецЕсли;
									
								КонецЕсли;
								
								мсвСтрокиГрузовыхМест = тбзГрузовыеМеста.НайтиСтроки(Новый Структура("ЗаданиеНаПеревозкуГруза, 
																						|АдресРазгрузки, 
																						|ГрузовоеМестоРодитель, 
																						|ЕдиныйГруз, 
																						|Проблема",
																						ЗаданиеНаПеревозкуГруза,
																						АдресРазгрузки,
																						ГрузовоеМестоГруппировка,
																						ЕдиныйГруз,
																						Проблема));
								Для каждого СтрокаТоварныйСоставГруза Из мсвСтрокиГрузовыхМест Цикл
									СтрокаТоварныйСоставГруза.ГрузовоеМесто = ГрузовоеМесто;
								КонецЦикла;																						
															
							КонецЦикла;
							
							Попытка
								НовоеГрузовоеМесто.ТоварныйСоставГруза.Свернуть("Номенклатура,УпаковкаНоменклатуры,Цена,СтавкаНДС,АналитическийРазрез","Количество,СуммаНДС,СуммаБезНДС,Сумма");
								НовоеГрузовоеМесто.Записать();
							Исключение
								ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
								Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
									ТекстОшибки = ОписаниеОшибки();
								КонецЕсли;
								ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, НовоеГрузовоеМесто,,,Отказ);
								ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, ,НовоеГрузовоеМесто, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
							КонецПопытки;
							
							Если ЕдиныйГруз Тогда
								мсвСтрокиГрузовыхМест = тбзГрузовыеМеста.НайтиСтроки(Новый Структура("ЗаданиеНаПеревозкуГруза, 
																						|АдресРазгрузки, 
																						|ГрузовоеМесто, 
																						|ЕдиныйГруз, 
																						|Проблема",
																						ЗаданиеНаПеревозкуГруза,
																						АдресРазгрузки,
																						Справочники.упГрузовыеМеста.ПустаяСсылка(),
																						ЕдиныйГруз,
																						Проблема));
		
							Иначе	
								мсвСтрокиГрузовыхМест = тбзГрузовыеМеста.НайтиСтроки(Новый Структура("ЗаданиеНаПеревозкуГруза, 
																						|АдресРазгрузки, 
																						|ГрузовоеМестоРодитель, 
																						|ЕдиныйГруз, 
																						|Проблема",
																						ЗаданиеНаПеревозкуГруза,
																						АдресРазгрузки,
																						ГрузовоеМестоГруппировка,
																						ЕдиныйГруз,
																						Проблема));
							КонецЕсли;																						
							Для каждого СтрокаТоварныйСоставГруза Из мсвСтрокиГрузовыхМест Цикл
								СтрокаТоварныйСоставГруза.ГрузовоеМесто = НовоеГрузовоеМесто.Ссылка;
							КонецЦикла;		
							
							Сч = Сч + 1;
							
						КонецЦикла;
					КонецЦикла;			
				КонецЦикла;
			КонецЦикла;		
		КонецЦикла;
	КонецЦикла;

	// Формируются движения по упРазделениеГрузовыхМест.
	тбзГрузовыеМеста.Свернуть("Операция, ЗаданиеНаПеревозкуГруза, ГрузовоеМесто, ГрузовоеМестоРодительИсходный, ГрузовоеМестоРодитель, Проблема, АдресРазгрузки, КоличествоГрузов, ЕдиныйГруз");
	
	мсвЗадания = тбзГрузовыеМеста.ВыгрузитьКолонку("ЗаданиеНаПеревозкуГруза");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвЗадания);
	соотАдресаПоЗаданиям = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(мсвЗадания, "АдресОтправления, АдресПолучения");
	
	тбзРазделениеГрузовыхМест = ПолучитьСтруктуруТаблицыРазделениеГрузовыхМест(); 
	тбзПлан = ПланПоЗаданиям.ВыгрузитьКолонки();
	тбзСостояниеЗаданий = ПолучитьСтруктуруТаблицыСостоянияЗаданиям();
	Для каждого Строка Из тбзГрузовыеМеста Цикл
		ДобавитьСтрокуВТаблицуРазделениеГрузовыхМест(тбзРазделениеГрузовыхМест, Строка.ГрузовоеМесто, Строка.ГрузовоеМестоРодительИсходный, Строка.ГрузовоеМестоРодитель, Строка.Проблема, Строка.АдресРазгрузки); 
		Если Истина
			И Строка.Операция = Перечисления.упТипыОпераций.Погрузка 
			И ЗначениеЗаполнено(Строка.Проблема)
		Тогда
			сткАдреса = соотАдресаПоЗаданиям.Получить(Строка.ЗаданиеНаПеревозкуГруза);
			ДобавитьСтрокуВТаблицуСостояниеЗаданий(тбзСостояниеЗаданий, Строка.ЗаданиеНаПеревозкуГруза, Строка.ГрузовоеМесто, сткАдреса.АдресОтправления, Строка.КоличествоГрузов);
			ДобавитьСтрокуВТаблицуСостояниеЗаданий(тбзСостояниеЗаданий, Строка.ЗаданиеНаПеревозкуГруза, Строка.ГрузовоеМесто, сткАдреса.АдресПолучения, -Строка.КоличествоГрузов);	
		КонецЕсли;
		
		Если Истина
			И ЗначениеЗаполнено(Строка.Проблема)
			И Строка.Проблема <> Справочники.упПроблемы.ДосрочноеПрохождение
		Тогда
               Действие = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Проблема, "Действие");
			Если Действие <> Перечисления.упДействияПоРаботе.ВернутьВПланирование Тогда
                  ДобавитьСтрокуВТаблицуПрерыванияГрузовыхПотоков(ПрерыванияГрузовыхПотоков,Строка.ЗаданиеНаПеревозкуГруза, Строка.ГрузовоеМестоРодитель, Строка.КоличествоГрузов, Истина);
			КонецЕсли;
		КонецЕсли;	
		
		//НоваяСтрока = тбзПлан.Добавить();
		//НоваяСтрока.Задание 		= Строка.ЗаданиеНаПеревозкуГруза;
		//НоваяСтрока.ГрузовоеМесто 	= Строка.ГрузовоеМесто;
		//НоваяСтрока.Местоположение 	= сткАдреса.АдресПолучения;
		//НоваяСтрока.Количество		= Строка.КоличествоГрузов;
		//НоваяСтрока.Выполнено		= Ложь;
		//НоваяСтрока.Отменено		= Ложь;
		
	КонецЦикла;
	ДополнительныеСвойства.Вставить("РазделениеГрузовыхМест", тбзРазделениеГрузовыхМест);
	ДополнительныеСвойства.Вставить("СостояниеЗаданий", тбзСостояниеЗаданий);
	ДополнительныеСвойства.Вставить("ПланПоЗаданиям", тбзПлан);
	
	// Отменяются все работы по разделяемым регистрам.
	мсвГрузовыеМеста = тбзГрузовыеМеста.ВыгрузитьКолонку("ГрузовоеМестоРодитель");
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвГрузовыеМеста);
	
	// В табличной части устанавливается признак "Груз разделен" и отменяются работы.
	ТекущиеРаботы = Реквизиты.Работы;
	ПрерыванияГрузовыхПотоков = ДополнительныеСвойства.ПрерыванияГрузовыхПотоков;
	Для каждого ГрузовоеМесто Из мсвГрузовыеМеста Цикл
		мсвСтрокиРаботы = ТекущиеРаботы.НайтиСтроки(Новый Структура("ГрузовоеМесто", ГрузовоеМесто));
		Для каждого СтрокаРабота Из мсвСтрокиРаботы Цикл
			СтрокаРабота.Отменена = Истина;
			СтрокаРабота.Выполнена = Ложь;
			СтрокаРабота.ГрузРазделен = Истина;
			
			ДобавитьСтрокуВТаблицуПрерыванияГрузовыхПотоков(ПрерыванияГрузовыхПотоков, СтрокаРабота.Задание, СтрокаРабота.ГрузовоеМесто, СтрокаРабота.КоличествоГрузов); 
						
		КонецЦикла;
	КонецЦикла;
	
	тбзЗадания = ПолучитьСтруктуруТаблицыЗадания();
	мсвДобавленныеЕдиныеГрузовыеМеста = Новый Массив;
	
	ИндексТочкиДляПересчетаМаршрута = Неопределено;

	Для каждого Строка Из тбзГрузовыеМеста Цикл
				
		мсвСтрокиРаботы = Работы.НайтиСтроки(Новый Структура("Задание,ГрузовоеМесто,Выполнена", Строка.ЗаданиеНаПеревозкуГруза, Строка.ГрузовоеМестоРодитель, Ложь));
		
		Если Строка.ЕдиныйГруз Тогда
			Если мсвДобавленныеЕдиныеГрузовыеМеста.Найти(Строка.ГрузовоеМесто) = Неопределено Тогда
				мсвДобавленныеЕдиныеГрузовыеМеста.Добавить(Строка.ГрузовоеМесто);
			Иначе	
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Погрузка и разгрузка	
		Если мсвСтрокиРаботы.Количество() > 1 Тогда
			
			Если Истина
				И Строка.Операция = Перечисления.упТипыОпераций.Погрузка 
				И ЗначениеЗаполнено(Строка.Проблема)
			Тогда
				Продолжить;
			КонецЕсли;	
			
			АдресТочкиПогрузки 	= Неопределено;
			АдресТочкиРазгрузки	= Неопределено;
									
			Для каждого СтрокаРабота Из мсвСтрокиРаботы Цикл
				НоваяСтрока = Работы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабота);
				НоваяСтрока.ГрузовоеМесто = Строка.ГрузовоеМесто;
				НоваяСтрока.КоличествоГрузов	= Строка.КоличествоГрузов;
				НоваяСтрока.Выполнена = Реквизиты.Идентификатор = СтрокаРабота.Идентификатор;
				НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
			КонецЦикла;
			
		// Только разгрузка
		Иначе	
			
			Для каждого СтрокаРабота Из мсвСтрокиРаботы Цикл
				
				// Фиктивная погрузка
				НоваяСтрока = Работы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабота);
				НоваяСтрока.ГрузовоеМесто = Строка.ГрузовоеМесто;
				НоваяСтрока.Операция = Перечисления.упТипыОпераций.Погрузка;
				НоваяСтрока.КоличествоГрузов	= Строка.КоличествоГрузов;
				НоваяСтрока.Выполнена = Истина;
				НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
								
				НоваяСтрока = Работы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРабота);
				НоваяСтрока.ГрузовоеМесто = Строка.ГрузовоеМесто;
				НоваяСтрока.КоличествоГрузов	= Строка.КоличествоГрузов;
				
				НоваяСтрока.Выполнена = Реквизиты.Идентификатор = СтрокаРабота.Идентификатор;
				НоваяСтрока.ИдентификаторРаботы = Новый УникальныйИдентификатор;
				
				Если ЗначениеЗаполнено(Строка.Проблема) Тогда
					НоваяСтрока.Проблема = Строка.Проблема;
					НоваяСтрока.АдресРазгрузки = Строка.АдресРазгрузки;
					НоваяСтрока.Отменена = Истина;
					НоваяСтрока.Выполнена = Ложь;
					
					ПоследняяТочка = Маршрут[Маршрут.Количество()-1];
									
					мсвТочка = Маршрут.НайтиСтроки(Новый Структура("Адрес, Пройдена", Строка.АдресРазгрузки, Ложь));
					Если мсвТочка.Количество() = 0 Тогда
						НоваяТочка = Маршрут.Добавить();
						НоваяТочка.Идентификатор = Новый УникальныйИдентификатор;
						НоваяТочка.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаПоЗаданию;
						НоваяТочка.Адрес = Строка.АдресРазгрузки;
						Если ПоследняяТочка.ТипТочки = Перечисления.упТипыТочекМаршрута.ТочкаЗавершения Тогда
							Маршрут.Сдвинуть(НоваяТочка, -1);	
							НоваяТочка.СтрокаНомер = НоваяТочка.НомерСтроки;
							
							Если ЗначениеЗаполнено(ПоследняяТочка.Предшественники) Тогда
								ПоследняяТочка.Предшественники = ПоследняяТочка.Предшественники + "," + НоваяТочка.Идентификатор;
							Иначе
								ПоследняяТочка.Предшественники = "" + НоваяТочка.Идентификатор;
							КонецЕсли; 
						Иначе
							НоваяТочка.СтрокаНомер = Маршрут.Количество();
						КонецЕсли;
						
						мсвСтрокиТочка = Маршрут.НайтиСтроки(Новый Структура("Идентификатор", СтрокаРабота.Идентификатор));
						Если мсвСтрокиТочка.Количество() > 0 Тогда
							НоваяТочка.Предшественники = мсвСтрокиТочка[0].Предшественники + "," + мсвСтрокиТочка[0].Идентификатор;
						КонецЕсли;
											
						НоваяТочка.Пройдена = Ложь;
						ТекущийИндекс = Маршрут.Индекс(НоваяТочка);
						
						Если ИндексТочкиДляПересчетаМаршрута = Неопределено Тогда
							ИндексТочкиДляПересчетаМаршрута = ТекущийИндекс;
						Иначе
							Если ИндексТочкиДляПересчетаМаршрута > ТекущийИндекс Тогда
								ИндексТочкиДляПересчетаМаршрута = ТекущийИндекс;
							КонецЕсли;
						КонецЕсли;
						
					Иначе
						НоваяТочка = мсвТочка[0];						
					КонецЕсли;
														
					НоваяРабота = Работы.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяРабота, НоваяСтрока);
					НоваяРабота.ПроблемаПричинаВозникновенияЭтойРаботы = Строка.Проблема;
					НоваяРабота.Проблема = Справочники.упПроблемы.ПустаяСсылка();
					НоваяРабота.АдресРазгрузки = Справочники.упАдреса.ПустаяСсылка();
					НоваяРабота.Отменена = Ложь;
					НоваяРабота.Идентификатор = НоваяТочка.Идентификатор;
					НоваяРабота.ИдентификаторРаботы = Новый УникальныйИдентификатор;
					НоваяРабота.Выполнена = Ложь;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ДобавитьСтрокуВТаблицу(тбзЗадания, Строка.ЗаданиеНаПеревозкуГруза, Строка.ГрузовоеМесто, Справочники.упГрузовыеМеста.ПустаяСсылка(), 0, 0, 0, Строка.КоличествоГрузов, ВидДвиженияНакопления.Приход);					
		
	КонецЦикла;
	
	Если Истина
		И ИндексТочкиДляПересчетаМаршрута <> Неопределено 
		И ИндексТочкиДляПересчетаМаршрута > 0 
	Тогда
		СпланироватьРаботыПоМаршруту(ИндексТочкиДляПересчетаМаршрута - 1, Ложь, Ложь, , Истина, Ложь);	
	КонецЕсли;
		
	ДополнительныеСвойства.Вставить("Задания", тбзЗадания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСпискиПолейДляСравнения()
	
	сткРезультат = Новый Структура();
	мсвМаршрут = Новый Массив;
	мсвМаршрут.Добавить("Идентификатор");
	мсвМаршрут.Добавить("Адрес");
	мсвМаршрут.Добавить("ВременноеОкноНачало");
	мсвМаршрут.Добавить("ВременноеОкноОкончание");
	мсвМаршрут.Добавить("ВремяОтПредыдущейТочки");
	мсвМаршрут.Добавить("ВремяОтдыхаВПутиОтПредыдущейТочки");
	мсвМаршрут.Добавить("СтрокаНомер");
	мсвМаршрут.Добавить("Пройдена");
	мсвМаршрут.Добавить("ПрибытиеФакт");
	мсвМаршрут.Добавить("УбытиеФакт");
	мсвМаршрут.Добавить("ИдентификаторИсходнойТочки");
	мсвМаршрут.Добавить("РасстояниеОтПредыдущейТочкиФакт");
	мсвМаршрут.Добавить("РасстояниеОтПредыдущейТочки");
	мсвМаршрут.Добавить("НачалоРаботФакт");
	мсвМаршрут.Добавить("Отменена");
	мсвМаршрут.Добавить("Предшественники");
	мсвМаршрут.Добавить("ПлановоеПрибытие");
	мсвМаршрут.Добавить("ПлановоеУбытие");
	мсвМаршрут.Добавить("НачалоРаботПлан");
	мсвМаршрут.Добавить("ВремяПростояПоВинеЗаказчикаЧасы");
	мсвМаршрут.Добавить("ВремяПростояПоВинеПеревозчикаЧасы");
	мсвМаршрут.Добавить("ВремяОжиданияВТочке");
	мсвМаршрут.Добавить("ВремяОжиданияВТочкеПослеРабот");
	мсвМаршрут.Добавить("ВремяРабот");
	мсвМаршрут.Добавить("Отложена");
		
	мсвРаботы = Новый Массив;
	мсвРаботы.Добавить("Идентификатор");
	мсвРаботы.Добавить("ИдентификаторРаботы");
	мсвРаботы.Добавить("СтрокаНомер");
	мсвРаботы.Добавить("Операция");
	мсвРаботы.Добавить("Отменена");
	мсвРаботы.Добавить("Выполнена");
	мсвРаботы.Добавить("Задание");
	мсвРаботы.Добавить("ГрузовоеМесто");
	мсвРаботы.Добавить("КоличествоГрузов");
	мсвРаботы.Добавить("Сумма");
	мсвРаботы.Добавить("Проблема");
	мсвРаботы.Добавить("Получатель");
	мсвРаботы.Добавить("ПроблемаПричинаВозникновенияЭтойРаботы");
	мсвРаботы.Добавить("АдресРазгрузки");
	мсвРаботы.Добавить("ПлановоеВремяНачалаРабот");
	мсвРаботы.Добавить("КоличествоЭкземпляровДокумента");
	мсвРаботы.Добавить("ГрузРазделен");
	мсвРаботы.Добавить("СкладскаяЯчейка");
	мсвРаботы.Добавить("Отложена");
	мсвРаботы.Добавить("ЗапрещеноСозданиеНовойТочкиМаршрута");
		
	мсвПеревозчик = Новый Массив;
	мсвПеревозчик.Добавить("Перевозчик");
	мсвПеревозчик.Добавить("Соглашение");
	мсвПеревозчик.Добавить("КонтрагентПеревозчика");
	мсвПеревозчик.Добавить("ТипТС");
	мсвПеревозчик.Добавить("ТранспортноеСредство");
	мсвПеревозчик.Добавить("Водитель1");
	мсвПеревозчик.Добавить("Водитель2");
	мсвПеревозчик.Добавить("Экспедитор");
	
	мсвПланПоЗаданиям = Новый Массив;
	мсвПланПоЗаданиям.Добавить("Задание");
	мсвПланПоЗаданиям.Добавить("ГрузовоеМесто");
	мсвПланПоЗаданиям.Добавить("Местоположение");
	мсвПланПоЗаданиям.Добавить("Выполнено");
	мсвПланПоЗаданиям.Добавить("Количество");
	мсвПланПоЗаданиям.Добавить("Отменено");
	мсвПланПоЗаданиям.Добавить("ПричинаОтмены");
	
	мсвСостояниеПоЗаданиям = Новый Массив;
	мсвСостояниеПоЗаданиям.Добавить("Задание");
	мсвСостояниеПоЗаданиям.Добавить("ГрузовоеМесто");
	мсвСостояниеПоЗаданиям.Добавить("Выполнена");
	мсвСостояниеПоЗаданиям.Добавить("КоличествоГрузов");
	мсвСостояниеПоЗаданиям.Добавить("Отменена");
	мсвСостояниеПоЗаданиям.Добавить("Проблема");
	мсвСостояниеПоЗаданиям.Добавить("АдресРазгрузки");
	
	мсвНепереданныеДокументы = Новый Массив;
	мсвНепереданныеДокументы.Добавить("Задание");
	мсвНепереданныеДокументы.Добавить("ГрузовоеМесто");
	мсвНепереданныеДокументы.Добавить("Выполнена");
	мсвНепереданныеДокументы.Добавить("КоличествоЭкземпляровДокумента");
	мсвНепереданныеДокументы.Добавить("Отменена");
	мсвНепереданныеДокументы.Добавить("ТипОперации");
	мсвНепереданныеДокументы.Добавить("ТипРегламентногоДокумента");
				
	сткРезультат.Вставить("Маршрут", 		мсвМаршрут);
	сткРезультат.Вставить("Работы", 		мсвРаботы);
	сткРезультат.Вставить("Перевозчик", 	мсвПеревозчик);
	сткРезультат.Вставить("ПланПоЗаданиям", мсвПланПоЗаданиям);
	сткРезультат.Вставить("СостояниеПоЗаданиям", 	мсвСостояниеПоЗаданиям);
	сткРезультат.Вставить("НепереданныеДокументы", 	мсвНепереданныеДокументы);
	
	
	Возврат сткРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыЗадания()
	
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ВидДвижения" , Новый ОписаниеТипов("ВидДвиженияНакопления"));
	тбзРезультат.Колонки.Добавить("Задание" , Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("ГрузовоеМесто" , Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("Тара", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("КоличествоГрузов" , Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоКПланированию" , Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоНеПодтверждено" , Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоНеПереданноеКВыполнению", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоКВыполнению" , Новый ОписаниеТипов("Число"));
	
	Возврат тбзРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыОтмененныеЗадания()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("Задание", Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("КоличествоГрузовыхМест", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоОтмененныхГрузовыхМест", Новый ОписаниеТипов("Число"));
	
	Возврат тбзРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыНепереданныеДокументы()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ЗаданиеНаПеревозку", Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоОтменено", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоДобавлено",Новый ОписаниеТипов("Число"));
	Возврат тбзРезультат;
КонецФункции

Функция ПолучитьСтруктуруТаблицыЗаявки()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
	тбзРезультат.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.упЗаявкаНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("НомерВЦепиПоставок", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("НомерВЦепиПоставокКонец", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
		
	Возврат тбзРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыСостоянияЗаданиям()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
	тбзРезультат.Колонки.Добавить("Задание", Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("Местоположение", Новый ОписаниеТипов("СправочникСсылка.упАдреса, СправочникСсылка.упТранспортныеСредства"));
	тбзРезультат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

	Возврат тбзРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыСтатистикаПоРаботам()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("Задание", Новый ОписаниеТипов("ДокументСсылка.упЗаданиеНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("Проблема", Новый ОписаниеТипов("СправочникСсылка.упПроблемы"));
	тбзРезультат.Колонки.Добавить("КоличествоПогрузок", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоПогрузокВернутьВПланирование", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоРазгрузок", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоРазгрузокВернутьВПланирование",Новый ОписаниеТипов("Число"));
	Возврат тбзРезультат;
КонецФункции

Функция ПолучитьСтруктуруТаблицыИнкассацияДенежныхСредств()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ЗаявкаНаПеревозкуГруза", Новый ОписаниеТипов("ДокументСсылка.упЗаявкаНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	тбзРезультат.Колонки.Добавить("СуммаПлан", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("СуммаФакт", Новый ОписаниеТипов("Число"));
	Возврат тбзРезультат;
КонецФункции

Функция ПолучитьСтруктуруТаблицыРазделениеГрузовыхМест()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("РодительИсходный", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("Родитель", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("Проблема", Новый ОписаниеТипов("СправочникСсылка.упПроблемы"));
	тбзРезультат.Колонки.Добавить("АдресРазгрузки", Новый ОписаниеТипов("СправочникСсылка.упАдреса"));
	Возврат тбзРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыОстаткиГрузовыхМест()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("Тара", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("СкладскаяЯчейка", Новый ОписаниеТипов("СправочникСсылка.упСкладскиеЯчейки"));
	тбзРезультат.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

	Возврат тбзРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыФактическиеМестоположенияТС()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ТранспортноеСредство", Новый ОписаниеТипов("СправочникСсылка.упТранспортныеСредства"));
	тбзРезультат.Колонки.Добавить("Зона",  Новый ОписаниеТипов("СправочникСсылка.упГеографическиеЗоны"));
	тбзРезультат.Колонки.Добавить("Адрес", Новый ОписаниеТипов("СправочникСсылка.упАдреса"));
	тбзРезультат.Колонки.Добавить("Дата",  Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	Возврат тбзРезультат;
	
КонецФункции

Функция ПолучитьСтруктуруТаблицыПрерыванияГрузовыхПотоков()
	тбзРезультат = Новый ТаблицаЗначений;
	тбзРезультат.Колонки.Добавить("ЗаявкаНаПеревозку", Новый ОписаниеТипов("ДокументСсылка.упЗаявкаНаПеревозкуГруза"));
	тбзРезультат.Колонки.Добавить("ГрузовоеМесто", Новый ОписаниеТипов("СправочникСсылка.упГрузовыеМеста"));
	тбзРезультат.Колонки.Добавить("НомерВЦепиПоставокКонец", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("КоличествоГрузов", Новый ОписаниеТипов("Число"));
	тбзРезультат.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	тбзРезультат.Колонки.Добавить("ГрузРазделен", Новый ОписаниеТипов("Булево"));
	Возврат тбзРезультат;
	
КонецФункции

Функция СтатусыСтрок()
	
	Возврат Новый ФиксированнаяСтруктура(Новый Структура("Новая, Создана, Выполнена, Отменена", 0, 1, 2, 3));
	
КонецФункции

Функция СтатусСтроки(Строка, сткСтатусыСтрок)
	
	текРезультат = сткСтатусыСтрок.Создана;
	
	Если Строка.Выполнена Тогда
		текРезультат = сткСтатусыСтрок.Выполнена;
	ИначеЕсли Строка.Отменена Тогда	
		текРезультат = сткСтатусыСтрок.Отменена;
	КонецЕсли;
	
	Возврат текРезультат;
		
КонецФункции

Процедура ДобавитьСтрокуВТаблицу(ТаблицаДвижений, Задание, ГрузовоеМесто, Тара, КоличествоКПланированию, КоличествоНеПодтверждено, КоличествоНеПереданноеКВыполнению, КоличествоКВыполнению, ВидДвижения = Неопределено)
	
	СтрокаЗадание = ТаблицаДвижений.Добавить();
	СтрокаЗадание.Задание 			                = Задание;
	СтрокаЗадание.ГрузовоеМесто 	                = ГрузовоеМесто;
	СтрокаЗадание.Тара 	                            = Тара;
	СтрокаЗадание.КоличествоКПланированию 			= КоличествоКПланированию;
	СтрокаЗадание.КоличествоНеПодтверждено 			= КоличествоНеПодтверждено;
	СтрокаЗадание.КоличествоНеПереданноеКВыполнению = КоличествоНеПереданноеКВыполнению;
	СтрокаЗадание.КоличествоКВыполнению 			= КоличествоКВыполнению;
	СтрокаЗадание.ВидДвижения 			            = ВидДвижения;
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуОтмененныхЗаданий(ТаблицаДвижений, Задание, Отменено)
	Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоПланированияРейса 
		ИЛИ ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
		
		СтрокаЗадание = ТаблицаДвижений.Добавить();
		СтрокаЗадание.Задание 			= Задание;
		СтрокаЗадание.КоличествоГрузовыхМест = 1;
		Если Отменено Тогда
			СтрокаЗадание.КоличествоОтмененныхГрузовыхМест = 1;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуСтатистикаПоРаботам(ТаблицаДвижений, Строка, мсвЗаданияПоРегистратору = Неопределено)

	Если НЕ ТаблицаДвижений = Неопределено Тогда
		
		// Если по работе в текущем документе не производили действий.
		Если НЕ мсвЗаданияПоРегистратору = Неопределено
				И мсвЗаданияПоРегистратору.Найти(Строка.Задание) = Неопределено Тогда
			// Задание по ней анализировать не нужно.	
			Возврат;
		КонецЕсли;
		
		//Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(Строка.Операция) Тогда
		Если Строка.Операция = ПредопределенноеЗначение("Перечисление.упТипыОпераций.Погрузка") Тогда
			СтрокаЗадание = ТаблицаДвижений.Добавить();
			СтрокаЗадание.Задание 			= Строка.Задание;
			СтрокаЗадание.Проблема 			= Строка.Проблема;
			СтрокаЗадание.КоличествоПогрузок 	= 1;
			//ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(Строка.Операция) Тогда	
		ИначеЕсли Строка.Операция = ПредопределенноеЗначение("Перечисление.упТипыОпераций.Разгрузка") Тогда
			СтрокаЗадание = ТаблицаДвижений.Добавить();
			СтрокаЗадание.Задание 			= Строка.Задание;
			Если ЗначениеЗаполнено(Строка.Проблема) Тогда
				СтрокаЗадание.Проблема = Строка.Проблема;					
			ИначеЕсли ЗначениеЗаполнено(Строка.ПроблемаПричинаВозникновенияЭтойРаботы) Тогда	
				СтрокаЗадание.Проблема = Строка.ПроблемаПричинаВозникновенияЭтойРаботы;						
			КонецЕсли;
			СтрокаЗадание.КоличествоРазгрузок 	= 1;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Функция СуществуютЗаданияЧастичноОтмененныеВозвращенныеВПланирование(ТаблицаДвижений)
	
	Результат = Ложь;
	
	Если ТаблицаДвижений = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаДвижений.Свернуть("Задание, Проблема", "КоличествоПогрузок, КоличествоПогрузокВернутьВПланирование, КоличествоРазгрузок, КоличествоРазгрузокВернутьВПланирование");
	
	Запрос = Новый Запрос;
	
	Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
		
		Запрос.Текст =
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Задание КАК Задание,
		|	втЗадания.Проблема КАК Проблема,
		|	втЗадания.КоличествоПогрузок КАК КоличествоПогрузок,
		|	втЗадания.КоличествоПогрузокВернутьВПланирование КАК КоличествоПогрузокВернутьВПланирование,
		|	втЗадания.КоличествоРазгрузок КАК КоличествоРазгрузок,
		|	втЗадания.КоличествоРазгрузокВернутьВПланирование КАК КоличествоРазгрузокВернутьВПланирование
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	&тбзЗадания КАК втЗадания
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Задание КАК Задание,
		|	втЗадания.КоличествоПогрузок КАК КоличествоПогрузок,
		|	втЗадания.КоличествоРазгрузок КАК КоличествоРазгрузок,
		|	ВЫБОР
		|		КОГДА НЕ упПроблемы.Действие = ЗНАЧЕНИЕ(Перечисление.упДействияПоРаботе.НетДействий)
		|			ТОГДА втЗадания.КоличествоПогрузок
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПогрузокВернутьВПланирование,
		|	ВЫБОР
		|		КОГДА НЕ упПроблемы.Действие = ЗНАЧЕНИЕ(Перечисление.упДействияПоРаботе.НетДействий)
		|			ТОГДА втЗадания.КоличествоРазгрузок
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРазгрузокВернутьВПланирование
		|ПОМЕСТИТЬ втЗаданияДействия
		|ИЗ
		|	втЗадания КАК втЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упПроблемы КАК упПроблемы
		|	ПО втЗадания.Проблема = упПроблемы.Ссылка
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаданияДействия.Задание КАК Задание,
		|	СУММА(втЗаданияДействия.КоличествоПогрузок) КАК КоличествоПогрузок,
		|	СУММА(втЗаданияДействия.КоличествоРазгрузок) КАК КоличествоРазгрузок,
		|	СУММА(втЗаданияДействия.КоличествоПогрузокВернутьВПланирование) КАК КоличествоПогрузокВернутьВПланирование,
		|	СУММА(втЗаданияДействия.КоличествоРазгрузокВернутьВПланирование) КАК КоличествоРазгрузокВернутьВПланирование
		|ИЗ
		|	втЗаданияДействия КАК втЗаданияДействия
		|СГРУППИРОВАТЬ ПО
		|	втЗаданияДействия.Задание
		|ИМЕЮЩИЕ ЛОЖЬ
		|	ИЛИ (ИСТИНА
		|		И СУММА(втЗаданияДействия.КоличествоПогрузокВернутьВПланирование) > 0
		|		И НЕ (СУММА(втЗаданияДействия.КоличествоПогрузокВернутьВПланирование) = СУММА(втЗаданияДействия.КоличествоПогрузок)))
		|	ИЛИ (ИСТИНА
		|		И СУММА(втЗаданияДействия.КоличествоРазгрузокВернутьВПланирование) > 0
		|		И НЕ (СУММА(втЗаданияДействия.КоличествоРазгрузокВернутьВПланирование) = СУММА(втЗаданияДействия.КоличествоРазгрузок)))
		|";
		
	Иначе
		
		Запрос.Текст =
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Задание КАК Задание,
		|	втЗадания.Проблема КАК Проблема,
		|	втЗадания.КоличествоПогрузок КАК КоличествоПогрузок,
		|	втЗадания.КоличествоПогрузокВернутьВПланирование КАК КоличествоПогрузокВернутьВПланирование,
		|	втЗадания.КоличествоРазгрузок КАК КоличествоРазгрузок,
		|	втЗадания.КоличествоРазгрузокВернутьВПланирование КАК КоличествоРазгрузокВернутьВПланирование
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	&тбзЗадания КАК втЗадания
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	Задания.Рейс КАК Рейс,
		|	Задания.Задание КАК Задание
		|ПОМЕСТИТЬ втРейсы
		|ИЗ
		|	(ВЫБРАТЬ
		|		тбЗаданияПоРейсу.Ссылка КАК Рейс,
		|		тбЗаданияПоРейсу.Задание КАК Задание
		|	ИЗ
		|		Документ.упРейс.Задания КАК тбЗаданияПоРейсу
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗадания
		|		ПО ИСТИНА
		|			И тбЗаданияПоРейсу.Задание = втЗадания.Задание
		|			И НЕ (тбЗаданияПоРейсу.Ссылка = &Рейс)
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		тбЗаданияПоКорректировкам.Ссылка.Рейс КАК Рейс,
		|		тбЗаданияПоКорректировкам.Задание КАК Задание
		|	ИЗ
		|		Документ.упКорректировкаРейса.Задания КАК тбЗаданияПоКорректировкам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗадания
		|		ПО ИСТИНА
		|			И тбЗаданияПоКорректировкам.Задание = втЗадания.Задание
		|			И НЕ (тбЗаданияПоКорректировкам.Ссылка.Рейс = &Рейс)) КАК Задания
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втРаботыПоРейсу.Задание КАК Задание,
		|	СУММА(ВЫБОР
		|		КОГДА втРаботыПоРейсу.Отменена
		|				И ВЫБОР
		|				КОГДА втРаботыПоРейсу.Проблема = ЗНАЧЕНИЕ(Справочник.упПроблемы.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ НЕ втРаботыПоРейсу.Проблема.Действие = ЗНАЧЕНИЕ(Перечисление.упДействияПоРаботе.НетДействий)
		|			КОНЕЦ
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Отменена,
		|	СУММА(1) КАК КоличествоРабот,
		|	СУММА(ВЫБОР
		|		КОГДА (втРаботыПоРейсу.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
		|					ИЛИ втРаботыПоРейсу.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПередачаЦенностей))
		|				И (втРаботыПоРейсу.Отменена
		|						ИЛИ НЕ втРаботыПоРейсу.ПроблемаПричинаВозникновенияЭтойРаботы = ЗНАЧЕНИЕ(Справочник.упПроблемы.ПустаяСсылка))
		|					И НЕ втРаботыПоРейсу.ПроблемаПричинаВозникновенияЭтойРаботы.Действие = ЗНАЧЕНИЕ(Перечисление.упДействияПоРаботе.НетДействий)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК ОтмененаРазгрузка,
		|	СУММА(ВЫБОР
		|		КОГДА (втРаботыПоРейсу.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.Разгрузка)
		|					ИЛИ втРаботыПоРейсу.Операция = ЗНАЧЕНИЕ(Перечисление.упТипыОпераций.ПередачаЦенностей))
		|				И втРаботыПоРейсу.Проблема = ЗНАЧЕНИЕ(Справочник.упПроблемы.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ) КАК Разгрузка
		|ПОМЕСТИТЬ втРаботыПоДругимРейсам
		|ИЗ
		|	РегистрСведений.упРаботыПоРейсу.СрезПоследних(
		|		,
		|		(Рейс, Задание) В (
		|				ВЫБРАТЬ
		|				втРейсы.Рейс КАК Рейс,
		|				втРейсы.Задание КАК Задание
		|			ИЗ
		|				втРейсы КАК втРейсы)) КАК втРаботыПоРейсу
		|СГРУППИРОВАТЬ ПО
		|	втРаботыПоРейсу.Задание
		|;
		|//{Запрос: 3 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗадания.Задание КАК Задание,
		|	втЗадания.КоличествоПогрузок КАК КоличествоПогрузок,
		|	втЗадания.КоличествоРазгрузок КАК КоличествоРазгрузок,
		|	ВЫБОР
		|		КОГДА НЕ упПроблемы.Действие = ЗНАЧЕНИЕ(Перечисление.упДействияПоРаботе.НетДействий)
		|			ТОГДА втЗадания.КоличествоПогрузок
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоПогрузокВернутьВПланирование,
		|	ВЫБОР
		|		КОГДА НЕ упПроблемы.Действие = ЗНАЧЕНИЕ(Перечисление.упДействияПоРаботе.НетДействий)
		|			ТОГДА втЗадания.КоличествоРазгрузок
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КоличествоРазгрузокВернутьВПланирование
		|ПОМЕСТИТЬ втЗаданияДействия
		|ИЗ
		|	втЗадания КАК втЗадания
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упПроблемы КАК упПроблемы
		|	ПО втЗадания.Проблема = упПроблемы.Ссылка
		|;
		|//{Запрос: 4 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаданияДействия.Задание КАК Задание,
		|	СУММА(втЗаданияДействия.КоличествоПогрузок) КАК КоличествоПогрузок,
		|	СУММА(втЗаданияДействия.КоличествоРазгрузок) КАК КоличествоРазгрузок,
		|	СУММА(втЗаданияДействия.КоличествоПогрузокВернутьВПланирование) КАК КоличествоПогрузокВернутьВПланирование,
		|	СУММА(втЗаданияДействия.КоличествоРазгрузокВернутьВПланирование) КАК КоличествоРазгрузокВернутьВПланирование,
		|	СУММА(ЗаданияКПланированию.КоличествоКПланированиюОстаток) КАК КоличествоКПланированиюОстаток
		|ИЗ
		|	втЗаданияДействия КАК втЗаданияДействия
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|		упЗаданияКПланированиюОстатки.Задание КАК Задание,
		|		упЗаданияКПланированиюОстатки.КоличествоКПланированиюОстаток КАК КоличествоКПланированиюОстаток
		|	ИЗ
		|		РегистрНакопления.упЗаданияКПланированию.Остатки(
		|			,
		|			Задание В (
		|				ВЫБРАТЬ
		|					втЗадания.Задание КАК Задание
		|				ИЗ
		|					втЗадания КАК втЗадания)) КАК упЗаданияКПланированиюОстатки) КАК ЗаданияКПланированию
		|	ПО втЗаданияДействия.Задание = ЗаданияКПланированию.Задание
		|	ЛЕВОЕ СОЕДИНЕНИЕ втРаботыПоДругимРейсам КАК втРаботыПоДругимРейсам
		|	ПО втЗаданияДействия.Задание = втРаботыПоДругимРейсам.Задание
		|СГРУППИРОВАТЬ ПО
		|	втЗаданияДействия.Задание
		|ИМЕЮЩИЕ ЛОЖЬ
		|	ИЛИ (ИСТИНА
		|		И СУММА(втЗаданияДействия.КоличествоПогрузокВернутьВПланирование) > 0
		|		И СУММА(втЗаданияДействия.КоличествоПогрузокВернутьВПланирование) <> СУММА(втЗаданияДействия.КоличествоПогрузок))
		|	ИЛИ (ИСТИНА
		|		И СУММА(втЗаданияДействия.КоличествоРазгрузокВернутьВПланирование) > 0
		|		И СУММА(втЗаданияДействия.КоличествоРазгрузокВернутьВПланирование) <> СУММА(втЗаданияДействия.КоличествоРазгрузок))
		|	ИЛИ (ИСТИНА
		|		И (ЛОЖЬ
		|			ИЛИ СУММА(втЗаданияДействия.КоличествоПогрузокВернутьВПланирование) > 0
		|			ИЛИ СУММА(втЗаданияДействия.КоличествоРазгрузокВернутьВПланирование) > 0)
		|		И (ЛОЖЬ
		|			ИЛИ СУММА(ЕСТЬNULL(ЗаданияКПланированию.КоличествоКПланированиюОстаток, 0)) <> 0
		|			ИЛИ (ИСТИНА
		|				И МАКСИМУМ(ЕСТЬNULL(втРаботыПоДругимРейсам.Отменена, 0)) > 0
		|				И МИНИМУМ(ЕСТЬNULL(втРаботыПоДругимРейсам.КоличествоРабот, 0)) <> МИНИМУМ(ЕСТЬNULL(втРаботыПоДругимРейсам.Отменена, 0))
		|				И МИНИМУМ(ЕСТЬNULL(втРаботыПоДругимРейсам.ОтмененаРазгрузка, 0)) <> МИНИМУМ(ЕСТЬNULL(втРаботыПоДругимРейсам.Разгрузка, 0)))))
		|";

		Запрос.УстановитьПараметр("Рейс", Рейс);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("тбзЗадания", ТаблицаДвижений);
	РезультатЗапрос = Запрос.Выполнить();
	Результат = НЕ РезультатЗапрос.Пустой();
		
	Возврат Результат;
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуЗаявок(ТаблицаДвижений, Задание, ГрузовоеМесто, Количество)
	
	Если Ложь
		Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаявкеНаПеревозку 
		Или ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.НеВводится
	Тогда
		ДобавитьСтрокуВТаблицуЗаявокБезПроверки(ТаблицаДвижений, Задание, ГрузовоеМесто, Количество);
	КонецЕсли;		
	
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуЗаявокБезПроверки(ТаблицаДвижений, Задание, ГрузовоеМесто, Количество)
		
	мсвСтрокиЗаданий = Задания.НайтиСтроки(Новый Структура("Задание",Задание));
	
	Если мсвСтрокиЗаданий.Количество() > 0 Тогда
		
		СтрокаПараметрыЗадания = мсвСтрокиЗаданий[0];
		
		СтрокаЗадание = ТаблицаДвижений.Добавить();
		СтрокаЗадание.Заявка = СтрокаПараметрыЗадания.ЗаявкаНаПеревозку;
		СтрокаЗадание.ГрузовоеМесто = ГрузовоеМесто;
		СтрокаЗадание.НомерВЦепиПоставок = СтрокаПараметрыЗадания.НомерВЦепиПоставок;
		СтрокаЗадание.НомерВЦепиПоставокКонец = СтрокаПараметрыЗадания.НомерВЦепиПоставокКонец;
		СтрокаЗадание.Количество = Количество;

	КонецЕсли;
			
КонецПроцедуры

Процедура ДобавитьРаботуВТаблицуСостояниеЗаданий(ТаблицаДвижений, 
									    Задание, 
									    ГрузовоеМесто, 
									    ТранспортноеСредство, 
									    Количество, 
									    СтатусРаботы, 
									    ТипОперации,
									    АдресПогрузки = Неопределено, 
									    АдресРазгрузки = Неопределено, 
									    НовыйАдресРазгрузки = Неопределено,
									    ПроблемаПриОтмене,
									    сткСтатусыСтроки, 
									    ЭтоОбратнаяОперация = Ложь,
									    РазделениеГрузовыхМест = Ложь)
													
	ДействиеПриОтмене = Неопределено;												
													
	Если ЗначениеЗаполнено(ПроблемаПриОтмене) Тогда
		ДействиеПриОтмене = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроблемаПриОтмене, "Действие");
	ИначеЕсли РазделениеГрузовыхМест Тогда
		ДействиеПриОтмене = Перечисления.упДействияПоРаботе.ОтменитьЗадание;
	КонецЕсли;												
	
	КоличествоСоЗнаком = ?(ЭтоОбратнаяОперация, -Количество, Количество);
	ВариантМаршрутаПолный =  упКорректировкаМаршрута.ВариантФормированияМаршрутаПолный(ВариантФормированияМаршрута); 
	
	Если упПрохождениеТочкиКлиентСервер.ОперацияПогрузки(ТипОперации) Тогда
				
		Если СтатусРаботы = сткСтатусыСтроки.Выполнена Тогда
				
			ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, АдресПогрузки, -КоличествоСоЗнаком);	
			Если ЗначениеЗаполнено(ТранспортноеСредство)
				 И ВариантМаршрутаПолный Тогда
				ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, ТранспортноеСредство, КоличествоСоЗнаком);				
			КонецЕсли; 
			
		ИначеЕсли СтатусРаботы = сткСтатусыСтроки.Отменена Тогда
			
			Если упПрохождениеТочкиКлиентСервер.ДействиеОтменяющееЗадание(ДействиеПриОтмене) Тогда
				ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, АдресПогрузки, -КоличествоСоЗнаком);				
				Если ВариантМаршрутаПолный Тогда
					ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, АдресРазгрузки, КоличествоСоЗнаком);					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
				
	ИначеЕсли упПрохождениеТочкиКлиентСервер.ОперацияРазгрузки(ТипОперации) Тогда
		
 		Если СтатусРаботы = сткСтатусыСтроки.Выполнена 
				ИЛИ РазделениеГрузовыхМест Тогда
			
			Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
				ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, ТранспортноеСредство, -КоличествоСоЗнаком);				
			КонецЕсли;
			ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, АдресРазгрузки, КоличествоСоЗнаком);				
			
		ИначеЕсли СтатусРаботы = сткСтатусыСтроки.Отменена Тогда
			
			Если ЗначениеЗаполнено(НовыйАдресРазгрузки) Тогда
				Если упПрохождениеТочкиКлиентСервер.ДействиеОтменяющееЗадание(ДействиеПриОтмене) Тогда
					ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, АдресРазгрузки, КоличествоСоЗнаком);				
					ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, НовыйАдресРазгрузки, -КоличествоСоЗнаком);				
				КонецЕсли;
			Иначе	
				// Происходит отмена без создания новой точки.
                    Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
					ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, ТранспортноеСредство, -КоличествоСоЗнаком);				
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
															
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуСостояниеЗаданий(ТаблицаДвижений, Задание, ГрузовоеМесто, Местоположение, Количество)
	Строка = ТаблицаДвижений.Добавить();
	Строка.Задание 			= Задание;
	Строка.ГрузовоеМесто 	= ГрузовоеМесто;
	Строка.Местоположение 	= Местоположение;
	Строка.Количество 		= Количество;
КонецПроцедуры	

Процедура ДобавитьСтрокуВТаблицуНепереданныеДокументы(ТаблицаДвижений, ЗаданиеНаПеревозку, Количество, КоличествоОтменено, КоличествоДобавлено)
	Строка = ТаблицаДвижений.Добавить();
	Строка.ЗаданиеНаПеревозку 	= ЗаданиеНаПеревозку;
	Строка.Количество 			= Количество;
	Строка.КоличествоОтменено 	= КоличествоОтменено;
	Строка.КоличествоДобавлено 	= КоличествоДобавлено;
КонецПроцедуры	

Процедура ДобавитьСтрокуВТаблицуПланПоЗаданиям(ТаблицаДвижений, Задание, ГрузовоеМесто, Местоположение, Выполнено, Количество, Отменено, ПричинаОтмены, СтрокаНомер)
	
	мсвСтрок = ТаблицаДвижений.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто, Местоположение", Задание, ГрузовоеМесто, Местоположение));
	Если мсвСтрок.Количество() > 0  Тогда
		Если мсвСтрок[0].СтрокаНомер <= СтрокаНомер Тогда
			Строка = мсвСтрок[0];		
		КонецЕсли;
	Иначе	
		Строка = ТаблицаДвижений.Добавить();	
	КонецЕсли;
	
	Если НЕ Строка = Неопределено Тогда
		Строка.Задание 			= Задание;
		Строка.ГрузовоеМесто 	= ГрузовоеМесто;
		Строка.Местоположение 	= Местоположение;
		Строка.Выполнено 		= Выполнено;
		Строка.Количество 		= Количество;
		Строка.Отменено 		= Отменено;
		Строка.ПричинаОтмены 	= ПричинаОтмены;
		Строка.СтрокаНомер	 	= СтрокаНомер;
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСтрокуВТаблицуИнкассацияДенежныхСредств(ТаблицаДвижений, ЗаявкаНаПеревозкуГруза, ГрузовоеМесто, Валюта, Сумма)
	Строка = ТаблицаДвижений.Добавить();
	Строка.ЗаявкаНаПеревозкуГруза 	= ЗаявкаНаПеревозкуГруза;
	Строка.ГрузовоеМесто 			= ГрузовоеМесто;
	Строка.Валюта 					= Валюта;
	Строка.СуммаПлан 				= 0;
	Строка.СуммаФакт 				= Сумма;
КонецПроцедуры	

Процедура ДобавитьСтрокуВТаблицуРазделениеГрузовыхМест(ТаблицаДвижений, ГрузовоеМесто, РодительИсходный, Родитель, Проблема, АдресРазгрузки)
	Строка = ТаблицаДвижений.Добавить();
	Строка.ГрузовоеМесто = ГрузовоеМесто;
	Строка.Родитель = Родитель;
	Строка.РодительИсходный = РодительИсходный;
	Строка.Проблема = Проблема;
	Строка.АдресРазгрузки = АдресРазгрузки;
КонецПроцедуры	

Процедура ДобавитьСтрокуВТаблицуОстаткиГрузовыхМест(ТаблицаДвижений, Операция, Задание, ГрузовоеМесто, Тара, СкладскаяЯчейка, Количество)
	
	Если упПрохождениеТочкиКлиентСервер.ОсновнаяОперацияДляВидаГрузаГруз(Операция) Тогда
		мсвЗадание = Задания.НайтиСтроки(Новый Структура("Задание", Задание));
		Если мсвЗадание.Количество() > 0  Тогда
			
			ЭтоМультимодальнаяПеревозка = мсвЗадание[0].ЭтоМультимодальнаяПеревозка;
			
			Если ЭтоМультимодальнаяПеревозка Тогда
				
				ЭтоПервоеЗвено = мсвЗадание[0].ЭтоПервоеЗвено;
				ЭтоПоследнееЗвено = мсвЗадание[0].ЭтоПоследнееЗвено;
				
				Если ЭтоПервоеЗвено Тогда
					
					Если Операция = Перечисления.упТипыОпераций.Разгрузка Тогда
						Строка = ТаблицаДвижений.Добавить();
						Строка.ГрузовоеМесто = ГрузовоеМесто;
						Строка.Тара = Тара;
						Строка.СкладскаяЯчейка = СкладскаяЯчейка;
						Строка.Количество = Количество;
					КонецЕсли;
					
				ИначеЕсли ЭтоПоследнееЗвено Тогда
					
					Если Операция = Перечисления.упТипыОпераций.Погрузка Тогда
						Строка = ТаблицаДвижений.Добавить();
						Строка.ГрузовоеМесто = ГрузовоеМесто;
						Строка.Тара = Тара;
						Строка.СкладскаяЯчейка = СкладскаяЯчейка;
						Строка.Количество = -Количество;
					КонецЕсли;
					
				Иначе	 
					
					Если Операция = Перечисления.упТипыОпераций.Разгрузка Тогда
						Строка = ТаблицаДвижений.Добавить();
						Строка.ГрузовоеМесто = ГрузовоеМесто;
						Строка.Тара = Тара;
						Строка.СкладскаяЯчейка = СкладскаяЯчейка;
						Строка.Количество = Количество;
					ИначеЕсли Операция = Перечисления.упТипыОпераций.Погрузка Тогда
						Строка = ТаблицаДвижений.Добавить();
						Строка.ГрузовоеМесто = ГрузовоеМесто;
						Строка.Тара = Тара;
						Строка.СкладскаяЯчейка = СкладскаяЯчейка;
						Строка.Количество = -Количество;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры	

Процедура ДобавитьСтрокуВТаблицуФактическиеМестоположенияТранспорта(ТаблицаДвижений, ТранспортноеСредство, Зона, Адрес, Дата)
	
	Строка = ТаблицаДвижений.Добавить();
	Строка.Дата 					= Дата;
	Строка.ТранспортноеСредство 	= ТранспортноеСредство;
	Строка.Зона 					= Зона;
	Строка.Адрес 					= Адрес;
			
КонецПроцедуры	

Процедура ДобавитьСтрокуВТаблицуПрерыванияГрузовыхПотоков(ТаблицаДвижений, Задание, ГрузовоеМесто, Количество, ГрузРазделен = Ложь)
		
	мсвСтрокиЗаданий = Задания.НайтиСтроки(Новый Структура("Задание",Задание));
	
	Если мсвСтрокиЗаданий.Количество() > 0 Тогда
		
		СтрокаПараметрыЗадания = мсвСтрокиЗаданий[0];
		
		Если Истина
			И СтрокаПараметрыЗадания.НомерВЦепиПоставокКонец > 0
			И Не СтрокаПараметрыЗадания.ЭтоПоследнееЗвено Тогда
			
			мсвСтрокиПрерывания = ТаблицаДвижений.НайтиСтроки(Новый Структура("ЗаявкаНаПеревозку, ГрузовоеМесто, НомерВЦепиПоставокКонец", СтрокаПараметрыЗадания.ЗаявкаНаПеревозку, ГрузовоеМесто, СтрокаПараметрыЗадания.НомерВЦепиПоставокКонец));
			
			Если мсвСтрокиПрерывания.Количество() = 0 Тогда
				НоваяСтрока = ТаблицаДвижений.Добавить();
				НоваяСтрока.ЗаявкаНаПеревозку = СтрокаПараметрыЗадания.ЗаявкаНаПеревозку;
				НоваяСтрока.ГрузовоеМесто = ГрузовоеМесто;
				НоваяСтрока.НомерВЦепиПоставокКонец = СтрокаПараметрыЗадания.НомерВЦепиПоставокКонец;
				НоваяСтрока.КоличествоГрузов = Количество;
				НоваяСтрока.Обработано = Ложь;
				НоваяСтрока.ГрузРазделен = ГрузРазделен;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
			
КонецПроцедуры

Процедура СпланироватьРаботыПоМаршруту(ИндексТекущейТочки = 0, ПересчитыватьПредыдущиеТочки = Истина, ПересчитыватьТекущуюТочку = Ложь, ДополнительныеПараметры = Неопределено, ПересчитыватьСледующиеТочки = Истина, ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия = Истина) Экспорт
	
	МодифицированаМаршрутФорма 	= Истина;
	МодифицированаРаботыФорма	= Истина;
	
	Если Маршрут.Количество() > 0 Тогда
		
		ВызыватьМаршрутизацию = Ложь;
		Если ЗначениеЗаполнено(ВидПеревозки) Тогда
			ВызыватьМаршрутизацию = ВидПеревозки.ОбращатьсяКМаршрутизаторуПриИзмененииМаршрутаКорректировкойРейса;
		КонецЕсли;
		
		упЗаданиеНаПеревозкуВызовСервера.СпланироватьЗадачиПоМаршруту(Маршрут, Работы, ИндексТекущейТочки,,, ВызыватьМаршрутизацию,
														ДополнительныеПараметры, ПересчитыватьПредыдущиеТочки, ПересчитыватьТекущуюТочку, 
														ПересчитыватьСледующиеТочки, 
														ПересчитыватьПлановоеВремяПосещенияТочекМаршрута, 
														ДопустимыйПериодРассогласованностиСФактическимиДанными,
														ПересчитыватьТекущуюТочкуКромеПлановогоПрибытия,
														ВидПеревозки,
														КоэффициентРасчетаВремениВПути,, Рейс);
		
		Для каждого текТочка Из Маршрут Цикл	

			ПопадаетВоВременноеОкноЗначениеДоИзменения = текТочка.ПопадаетВоВременноеОкно; 
			Если Не ЗначениеЗаполнено(текТочка.ВременноеОкноНачало) И Не ЗначениеЗаполнено(текТочка.ВременноеОкноОкончание) Тогда
				текТочка.ПопадаетВоВременноеОкно = Истина;
			ИначеЕсли Не ЗначениеЗаполнено(текТочка.ВременноеОкноНачало) И текТочка.ПлановоеУбытие - 60 <= текТочка.ВременноеОкноОкончание Тогда
				текТочка.ПопадаетВоВременноеОкно = Истина;
			ИначеЕсли Не ЗначениеЗаполнено(текТочка.ВременноеОкноОкончание) И текТочка.ПлановоеПрибытие + текТочка.ВремяОжиданияВТочке*3600 + 60 >= текТочка.ВременноеОкноНачало Тогда
				текТочка.ПопадаетВоВременноеОкно = Истина;
			ИначеЕсли текТочка.ПлановоеУбытие - 60 <= текТочка.ВременноеОкноОкончание И текТочка.ПлановоеПрибытие + текТочка.ВремяОжиданияВТочке*3600 + 60 >= текТочка.ВременноеОкноНачало Тогда
				текТочка.ПопадаетВоВременноеОкно = Истина;
			Иначе
				текТочка.ПопадаетВоВременноеОкно = Ложь;	
			КонецЕсли;
			
			Если НЕ ПопадаетВоВременноеОкноЗначениеДоИзменения = текТочка.ПопадаетВоВременноеОкно Тогда
				УстановитьФлагПопадаетВоВременноеОкноПоЗаданиям(текТочка, текТочка.ПопадаетВоВременноеОкно);	
			КонецЕсли;
			ЗаполнитьПоляПредставленийСтрокиМаршрута(текТочка);
		КонецЦикла; 
		Для каждого текРабота Из Работы Цикл
			ЗаполнитьПоляПредставленийСтрокиРабот(текРабота);
		КонецЦикла; 
		ПлановоеНачалоВыполнения    = Маршрут[0].ПлановоеПрибытие;	
		ПлановоеОкончаниеВыполнения = Маршрут[Маршрут.Количество() - 1].ПлановоеУбытие;
	Иначе
		ПлановоеНачалоВыполнения    = '00010101';
		ПлановоеОкончаниеВыполнения = '00010101';
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоляПредставленийСтрокиМаршрута(Знач текТочка) Экспорт 
	
	текТочка.ВременноеОкноПредставление 		 = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВременногоОкна(текТочка.ВременноеОкноНачало, текТочка.ВременноеОкноОкончание);
	текТочка.ВремяОжиданияВТочкеПредставление 	 = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(текТочка.ВремяОжиданияВТочке*3600);
	текТочка.ВремяОжиданияВТочкеПослеРаботПредставление = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(текТочка.ВремяОжиданияВТочкеПослеРабот*3600);
	текТочка.ВремяРаботПредставление 			 = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(текТочка.ВремяРабот*3600);
	текТочка.РасстояниеОтПредыдущейТочкиПредставление = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеРасстояния(текТочка.РасстояниеОтПредыдущейТочки);
	текТочка.ВремяОтПредыдущейТочкиПредставление = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(текТочка.ВремяОтПредыдущейТочки*3600);
	текТочка.ВремяОтдыхаВПутиОтПредыдущейТочкиПредставление = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(текТочка.ВремяОтдыхаВПутиОтПредыдущейТочки*3600);

КонецПроцедуры

Процедура ЗаполнитьПоляПредставленийСтрокиРабот(Знач СтрокаРабота) Экспорт
	
	СтрокаРабота.ВременноеОкноПредставление	= упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВременногоОкна(СтрокаРабота.ВременноеОкноНачало, СтрокаРабота.ВременноеОкноОкончание);
	СтрокаРабота.ВремяОжиданияПредставление	= упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(СтрокаРабота.ВремяОжидания*3600);
	СтрокаРабота.ВремяРаботПредставление	= упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(СтрокаРабота.ВремяРабот*3600);

КонецПроцедуры

Процедура ЗаполнитьРеквизитыПредставления()
	
	Для каждого СтрокаТочка Из Маршрут Цикл
		ПопадаетВоВременноеОкноЗначениеДоИзменения = СтрокаТочка.ПопадаетВоВременноеОкно;
		Если Не ЗначениеЗаполнено(СтрокаТочка.ВременноеОкноНачало) И Не ЗначениеЗаполнено(СтрокаТочка.ВременноеОкноОкончание) Тогда
			СтрокаТочка.ПопадаетВоВременноеОкно = Истина;
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТочка.ВременноеОкноНачало) И СтрокаТочка.ПлановоеУбытие - 60 <= СтрокаТочка.ВременноеОкноОкончание Тогда
			СтрокаТочка.ПопадаетВоВременноеОкно = Истина;
		ИначеЕсли Не ЗначениеЗаполнено(СтрокаТочка.ВременноеОкноОкончание) И СтрокаТочка.ПлановоеПрибытие + СтрокаТочка.ВремяОжиданияВТочке*3600 + 60 >= СтрокаТочка.ВременноеОкноНачало Тогда
			СтрокаТочка.ПопадаетВоВременноеОкно = Истина;
		ИначеЕсли СтрокаТочка.ПлановоеУбытие - 60 <= СтрокаТочка.ВременноеОкноОкончание И СтрокаТочка.ПлановоеПрибытие + СтрокаТочка.ВремяОжиданияВТочке*3600 + 60 >= СтрокаТочка.ВременноеОкноНачало Тогда
			СтрокаТочка.ПопадаетВоВременноеОкно = Истина;
		Иначе
			СтрокаТочка.ПопадаетВоВременноеОкно = Ложь;	
		КонецЕсли;
		Если НЕ ПопадаетВоВременноеОкноЗначениеДоИзменения = СтрокаТочка.ПопадаетВоВременноеОкно Тогда
				УстановитьФлагПопадаетВоВременноеОкноПоЗаданиям(СтрокаТочка, СтрокаТочка.ПопадаетВоВременноеОкно);	
		КонецЕсли;
		ЗаполнитьПоляПредставленийСтрокиМаршрута(СтрокаТочка);
	КонецЦикла;
	Для каждого СтрокаРабота Из Работы Цикл
		ЗаполнитьПоляПредставленийСтрокиРабот(СтрокаРабота);
	КонецЦикла; 
	
КонецПроцедуры

Процедура КонтрольДанныхЗадания(текСтрока, Отказ)
		
	Если Не ЗначениеЗаполнено(текСтрока.Задание) Тогда
		ТекстСообщения = НСтр("ru = 'Укажите задание на перевозку груза'");
		Путь = СтрШаблон("Объект.%1", ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Задания", текСтрока.НомерСтроки, "Задание")); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, Путь,, Отказ);	
		Возврат;
	КонецЕсли;	

	Если Не ЗначениеЗаполнено(текСтрока.ГрузовоеМесто) И ФормироватьПоГрузовымМестам Тогда
		ТекстСообщения = НСтр("ru = 'Укажите грузовое место'");
		Путь = СтрШаблон("Объект.%1", ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Задания", текСтрока.НомерСтроки, "ГрузовоеМесто"));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, Путь,, Отказ);	
		Возврат;	
	КонецЕсли;
	
	// проверка на дубли 
	//мсвСтрок = Задания.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто", текСтрока.Задание, текСтрока.ГрузовоеМесто));
	//Если мсвСтрок.Количество() > 1 Тогда
	//	ТекстСообщения = НСтр("ru = 'Указаны некорректные данные. Уже существует задание с таким же грузовым местом'");
	//	Путь = СтрШаблон("Объект.%1", ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Задания", текСтрока.НомерСтроки, "ГрузовоеМесто"));
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Ссылка, Путь,,Отказ);	
	//	Возврат;	
	//КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольДанныхМаршрута(текТочка, НомерСтроки, Отказ, сткИзмененныеПоля, Удалить = Ложь)
	
	Если Удалить Тогда
		текУдаляемаяТочка	= Маршрут.Получить(НомерСтроки - 1);
		
		мсвРаботыВТочке = Работы.НайтиСтроки(Новый Структура("Идентификатор", текУдаляемаяТочка.Идентификатор));
		Если мсвРаботыВТочке.Количество() > 0 Тогда
			ВывестиСообщениеПоТЧМаршруты(Нстр("ru = 'Невозможно удалить точку, так как по ней есть работы'"), Отказ, НомерСтроки, "Маршрут", "Адрес");
		КонецЕсли;
	Иначе
		мсвРаботыВТочке = Неопределено;
		Если сткИзмененныеПоля.Свойство("Адрес") Тогда
			мсвРаботыВТочке = Работы.НайтиСтроки(Новый Структура("Идентификатор", текТочка.Идентификатор));
			Если мсвРаботыВТочке.Количество() > 0  Тогда
				ВывестиСообщениеПоТЧМаршруты(Нстр("ru = 'Для текущей точки уже введены работы, нельзя менять адрес'"), Отказ, НомерСтроки, "Маршрут", "Адрес");
			КонецЕсли;
		КонецЕсли;
		Если сткИзмененныеПоля.Свойство("ТипТочки") Тогда
			Если мсвРаботыВТочке = Неопределено Тогда
				мсвРаботыВТочке = Работы.НайтиСтроки(Новый Структура("Идентификатор", текТочка.Идентификатор));
			КонецЕсли;
			Если мсвРаботыВТочке.Количество() > 0  Тогда
				ВывестиСообщениеПоТЧМаршруты(Нстр("ru = 'Для текущей точки уже введены работы, нельзя менять тип точки'"), Отказ, НомерСтроки, "Маршрут", "ТипТочки");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСтрокиИзМаршрутаПоЗаданиюНаПеревозку()
	
	УдалятьВсеСтрокиПоЗаданию	= Ложь;
	
	// Проверка, существуют ли еще строки по старому заданию
	мсвСтрок = Задания.НайтиСтроки(Новый Структура("Задание", сткЗначенияСтрокиЗаданийДоРедактирования.Задание));
	
	// Если удаляется последняя строка по заданию, то удалить все работы с заданием
	УдалятьВсеСтрокиПоЗаданию = мсвСтрок.Количество() = 1;
	
	мсвУдаляемыхСтрок 		= Работы.НайтиСтроки(Новый Структура("Задание", сткЗначенияСтрокиЗаданийДоРедактирования.Задание));
	Если Не мсвУдаляемыхСтрок.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	мсвИдентификаторыТочек 	= Новый Массив();
	
	Для каждого текСтрока Из мсвУдаляемыхСтрок Цикл
		текИдентификаторТочки = текСтрока.Идентификатор;
		Если мсвИдентификаторыТочек.Найти(текИдентификаторТочки) = Неопределено Тогда
			мсвИдентификаторыТочек.Добавить(текСтрока.Идентификатор);
		КонецЕсли;

		мсвАдресаПогрузки = АдресаПогрузкиПоРейсу.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто",текСтрока.Задание, текСтрока.ГрузовоеМесто));
		
		// Удалять все работы
		Если УдалятьВсеСтрокиПоЗаданию Тогда
			Работы.Удалить(текСтрока);
			
			Для каждого СтрокаАдрес Из мсвАдресаПогрузки Цикл
				АдресаПогрузкиПоРейсу.Удалить(СтрокаАдрес);
			КонецЦикла;
			
		// Удалять только работы с заданным грузовым местом	
		ИначеЕсли текСтрока.ГрузовоеМесто = сткЗначенияСтрокиЗаданийДоРедактирования.ГрузовоеМесто Тогда
			
			Если сткЗначенияСтрокиЗаданийДоРедактирования.КоличествоГрузов >= текСтрока.КоличествоГрузов  Тогда
				Работы.Удалить(текСтрока);
				Для каждого СтрокаАдрес Из мсвАдресаПогрузки Цикл
					АдресаПогрузкиПоРейсу.Удалить(СтрокаАдрес);
				КонецЦикла;
			Иначе
				текСтрока.КоличествоГрузов = текСтрока.КоличествоГрузов - сткЗначенияСтрокиЗаданийДоРедактирования.КоличествоГрузов;
			КонецЕсли;
						
		КонецЕсли;	

	КонецЦикла;
	
	текУстановленаТочкаПересчета 	= Ложь;
	
	мсвУдаляемыеТочки = Новый Массив;
	текВзятьСледующуюТочку = Ложь;
	
	// Пересчет параметров точек маршрута
	Для каждого текТочка Из Маршрут Цикл
		
		текТочкуУдалили = Ложь;
		текТочкаИдентификатор = текТочка.Идентификатор;
		
		Если НЕ мсвИдентификаторыТочек.Найти(текТочкаИдентификатор) = Неопределено Тогда
			мсвСтрокиРабот = Работы.НайтиСтроки(Новый Структура("Идентификатор", текТочкаИдентификатор));
			
			// Если в точке нет работ, то точку удалить
			Если мсвСтрокиРабот.Количество()=0 Тогда
				мсвУдаляемыеТочки.Добавить(текТочка);
				текВзятьСледующуюТочку 	= Истина;
				текТочкуУдалили 		= Истина;
			Иначе
				текТочка.ПересчитатьВременноеОкно	= Истина;
				текТочка.ПересчитатьПрибытиеУбытие	= Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если текВзятьСледующуюТочку Тогда
			Если НЕ текТочкуУдалили Тогда
				текТочка.ПересчитатьПрибытиеУбытие	= Истина;
				текВзятьСледующуюТочку = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого текТочка Из мсвУдаляемыеТочки Цикл
		Маршрут.Удалить(текТочка);	
	КонецЦикла;
			
КонецПроцедуры

Функция УдалитьСтрокуИзМаршрута(текРабота, мсвВыделенныеСтроки = Неопределено)
	
	текРезультат	= Истина;
	
	мсвСтрокиРаботПоЗаданию = Работы.НайтиСтроки(Новый Структура("Задание", текРабота.Задание));
	
	ЕстьСтрокиСЗаданиями					= Ложь;
	ЕстьСтрокиПогрузкиРазгрузки				= Ложь;
	ЕстьСтрокиСЗаданнымГрузовымМестом		= Ложь;
	
	мсвИдентификаторыСтрок		= Новый Массив;// Содержит идентификаторы строк содержащие изменяемое задание 
	
	Для каждого текСтрока Из мсвСтрокиРаботПоЗаданию Цикл
		
		текИдентификаторРаботы = текСтрока.ИдентификаторРаботы;
		
		// Если рассматриваемая строка тоже удаляется
		Если НЕ мсвВыделенныеСтроки.Найти(текИдентификаторРаботы) = Неопределено Тогда
			мсвИдентификаторыСтрок.Добавить(текИдентификаторРаботы);
			Продолжить;
		КонецЕсли;

		ЕстьСтрокиСЗаданиями = Истина;
		
		Если упПрохождениеТочкиКлиентСервер.ОсновнаяОперация(текСтрока.Операция) Тогда
			
			ЕстьСтрокиПогрузкиРазгрузки = Истина;
			
			Если текСтрока.ГрузовоеМесто = текРабота.ГрузовоеМесто Тогда
				ЕстьСтрокиСЗаданнымГрузовымМестом = Истина;
				Прервать;
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;

		мсвИдентификаторыСтрок.Добавить(текИдентификаторРаботы);
							
	КонецЦикла;
	
	Если ЕстьСтрокиСЗаданнымГрузовымМестом И ЕстьСтрокиСЗаданиями Тогда
		текРезультат = Ложь;
	КонецЕсли;

	
	// Если по заданию остались только доп. работы
	Если ЕстьСтрокиСЗаданиями И НЕ ЕстьСтрокиПогрузкиРазгрузки Тогда
		
		// Удалить их из маршрута
		Для каждого текИдентификатор Из мсвИдентификаторыСтрок Цикл
			мсвУдаляемыеРаботы	= Работы.НайтиСтроки(Новый Структура("ИдентификаторРаботы",текИдентификатор));
			Если мсвУдаляемыеРаботы.Количество() > 0 Тогда
				текУдаляемаяРабота = мсвУдаляемыеРаботы[0];
				Если НЕ текУдаляемаяРабота = Неопределено Тогда
					Работы.Удалить(Работы.Индекс(текУдаляемаяРабота));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат текРезультат;
	
КонецФункции

Процедура ДобавитьСтрокиВМаршрутПоЗаданиюНаПеревозку(текСтрока, РаспределитьПоНепройденнымТочкам = Ложь)
	
	ДобавлятьДопОперации = Ложь;
	мсвСтрок = Задания.НайтиСтроки(Новый Структура("Задание", текСтрока.Задание));
	ДобавлятьДопОперации = (мсвСтрок.Количество() = 1 И ИспользуютсяДополнительныеОперации);
	
	Если ПараметрыВводаИнформацииОГрузовыхМестах = Перечисления.упПараметрыВводаИнформацииОГрузовыхМестах.ВводитсяВЗаданииДоНачалаВыполненияРейса Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	упЗаданияКПланированиюОстатки.ГрузовоеМесто,
		|	упЗаданияКПланированиюОстатки.Тара,
		|	упЗаданияКПланированиюОстатки.КоличествоКВыполнениюОстаток КАК КоличествоГрузов
		|ИЗ
		|	РегистрНакопления.упЗаданияКПланированию.Остатки(, Задание = &Задание) КАК упЗаданияКПланированиюОстатки
		|ГДЕ
		|	упЗаданияКПланированиюОстатки.КоличествоКВыполнениюОстаток > 0";
		Запрос.УстановитьПараметр("Задание", текСтрока.Задание);
		текВыборка	= Запрос.Выполнить().Выбрать();
		мсвГрузов = Новый Массив;
		Пока текВыборка.Следующий() Цикл
			сткГрузовоеМесто = Новый Структура("ГрузовоеМесто, Тара, КоличествоГрузов", текВыборка.ГрузовоеМесто, текВыборка.Тара, текВыборка.КоличествоГрузов);
			мсвГрузов.Добавить(сткГрузовоеМесто);
		КонецЦикла;
	Иначе	
		сткГрузовоеМесто = Новый Структура("ГрузовоеМесто, Тара, КоличествоГрузов", текСтрока.ГрузовоеМесто, текСтрока.Тара, текСтрока.КоличествоГрузов);
		мсвГрузов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(сткГрузовоеМесто);
	КонецЕсли;
	ПравилоСвязиТиповГрузовВРейсе = текСтрока.Задание.ВидПеревозки.ПравилоСвязиТиповГрузовВРейсе;
	Если ЗначениеЗаполнено(ПравилоСвязиТиповГрузовВРейсе) Тогда
		ТаблицаЗависимых = упРейс.ЗависимыеЗаданияПоСпискуЗаданий(Задания.Выгрузить(,"Задание"));
	КонецЕсли; 
	СтруктураСвязанных = упРейс.СтруктураСвязанныхЗаданийДляЗадания(ПравилоСвязиТиповГрузовВРейсе, ТаблицаЗависимых, текСтрока.Задание);
	
	// накопление тары
	мсвТары = Новый Массив;
	мсвВТаре = Новый Массив;
	СтруктураТары = Неопределено;
	Если ПолучитьФункциональнуюОпцию("упВедетсяУчетТары") Тогда
		Для каждого текСтруктураГруза Из мсвГрузов Цикл
			Если ЗначениеЗаполнено(текСтруктураГруза.ГрузовоеМесто) Тогда
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(текСтруктураГруза.ГрузовоеМесто, "Тара") Тогда
					мсвТары.Добавить(текСтруктураГруза.ГрузовоеМесто);
				КонецЕсли;
				Если ЗначениеЗаполнено(текСтруктураГруза.Тара) Тогда
					мсвВТаре.Добавить(текСтруктураГруза.Тара);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли; 
	Если мсвТары.Количество() Или мсвВТаре.Количество() Тогда
		СтруктураТары = Новый Структура;
		СтруктураТары.Вставить("Тара", ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвТары));
		СтруктураТары.Вставить("ВТаре", ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвВТаре));
	КонецЕсли; 
			
	сткТочки =  упКорректировкаМаршрута.ДобавитьРаботыПоЗаданиюВМаршрут(Рейс, Маршрут, Работы, текСтрока.АдресОтправления, текСтрока.АдресПолучения, текСтрока.Задание, мсвГрузов,
		ДобавлятьДопОперации, ,ВидЗоныДляФормированияПредставленияРейса, РаспределитьПоНепройденнымТочкам, ВариантФормированияМаршрута, СтруктураТары, СтруктураСвязанных,,ЧасовойПояс);
	
	сткТочки.ТочкаПогрузки.ПересчитатьПрибытиеУбытие = Истина;
	
	Если ВариантФормированияМаршрута = Перечисления.упВариантыФормированияМаршрута.Полный Тогда
		сткТочки.ТочкаРазгрузки.ПересчитатьПрибытиеУбытие = Истина;	
	КонецЕсли;
		
	Если ЗначениеЗаполнено(сткТочки.ТочкаПогрузки) Тогда
		
		мсвАдресаПогрузки = АдресаПогрузкиПоРейсу.НайтиСтроки(Новый Структура("Задание, ГрузовоеМесто",текСтрока.Задание, текСтрока.ГрузовоеМесто));
		
		Если мсвАдресаПогрузки.Количество() = 0 Тогда
			НоваяСтрока = АдресаПогрузкиПоРейсу.Добавить();
			НоваяСтрока.Адрес = сткТочки.ТочкаПогрузки.Адрес;
			НоваяСтрока.Задание = текСтрока.Задание;
			НоваяСтрока.ГрузовоеМесто = текСтрока.ГрузовоеМесто;
			НоваяСтрока.Тара = текСтрока.Тара;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьДанныеРаботыНаСервере(сткИсходныеДанные, сткПересчитываемыеПоказатели)

	сткПересчитываемыеПоказатели.ТипОперации = упСервисныеФункцииВызовСервера.ЗначениеРеквизитаОбъекта(сткИсходныеДанные.Операция, "Порядок");
	Если сткПересчитываемыеПоказатели.Свойство("ВремяРабот") Тогда
		
		сткПересчитываемыеПоказатели.ВремяРабот = 0;
		
		текАдрес 	= Неопределено;
		текОперация = Неопределено;
			
		// Определение времени работы
		Если ПолучитьЗначение(сткИсходныеДанные, текАдрес, "Адрес")	И ПолучитьЗначение(сткИсходныеДанные, текОперация, "Операция")  Тогда
			Если текОперация = ПредопределенноеЗначение("Перечисление.упТипыОпераций.ДополнительнаяОперация") Тогда
				
				текЗаданиеНаПеревозкуГруза = Неопределено;
				текТипТочки				   = Неопределено;
				текДополнительнаяОперация  = Неопределено;
								
				Если ПолучитьЗначение(сткИсходныеДанные, текЗаданиеНаПеревозкуГруза, "Задание")	
						И ПолучитьЗначение(сткИсходныеДанные, текТипТочки, "ТипТочки")   
						И ПолучитьЗначение(сткИсходныеДанные, текДополнительнаяОперация, "ДополнительнаяОперация") Тогда
				
					сткПересчитываемыеПоказатели.ВремяРабот  = упЗаданиеНаПеревозку.ПолучитьВремяПоДопОперации(текЗаданиеНаПеревозкуГруза,текТипТочки, текДополнительнаяОперация);	
				
				КонецЕсли;
			Иначе
				текАдрес 			= Неопределено;
				текГрузовоеМесто	= Неопределено;
				текКоличествоГрузов = 0;
				текТара				= Неопределено;
				
				Если ПолучитьЗначение(сткИсходныеДанные, текАдрес, "Адрес")	
						И ПолучитьЗначение(сткИсходныеДанные, текГрузовоеМесто, "ГрузовоеМесто") Тогда
					ПолучитьЗначение(сткИсходныеДанные, текКоличествоГрузов, "КоличествоГрузов");
					ПолучитьЗначение(сткИсходныеДанные, текТара, "Тара");
					сткПересчитываемыеПоказатели.ВремяРабот  = упЗаданиеНаПеревозку.ПолучитьВремяРаботыПоГрузовомуМесту(текАдрес.ВидАдреса, текОперация, текГрузовоеМесто, сткИсходныеДанные.ФормироватьПоГрузовымМестам, текКоличествоГрузов, текТара); 	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	
	КонецЕсли;
	
	Если сткПересчитываемыеПоказатели.Свойство("ВременноеОкноНачало") Тогда
		текЗаданиеНаПеревозкуГруза 	= Неопределено;
		текТипТочки				   	= Неопределено;
		текОперация 				= Неопределено;
		
		Если ПолучитьЗначение(сткИсходныеДанные, текЗаданиеНаПеревозкуГруза, "Задание")	
			И ПолучитьЗначение(сткИсходныеДанные, текТипТочки, "ТипТочки")   
			И ПолучитьЗначение(сткИсходныеДанные, текОперация, "Операция") Тогда
						
			// Определение временного окна
			сткВременныеИнтервалы = упЗаданиеНаПеревозку.ПолучитьВременнойИнтервалЗадания(текТипТочки, текОперация, текЗаданиеНаПеревозкуГруза);
			
			сткПересчитываемыеПоказатели.ВременноеОкноНачало	= сткВременныеИнтервалы.ВременноеОкноНачало;
			сткПересчитываемыеПоказатели.ВременноеОкноОкончание	= сткВременныеИнтервалы.ВременноеОкноОкончание;
						
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПересчитатьДанныеРаботыНаСервере()

// Процедура - Пересчитывает данные точки на основании работ 
//
// Параметры:
//  Точка	 		- ДанныеФормыЭлементДерева	 - точка
//	УдаляемаяСтрока - ДанныеФормыЭлементДерева	 - работа(заполняется в случа удаления работы).
Процедура ПересчитатьВременноеОкноТочки(Точка, УдаляемаяСтрока = Неопределено)

	текМаршрутВременноеОкноНачало 		= '00010101';
	текМаршрутВременноеОкноОкончание 	= '00010101';
	
	мсвРаботы	= Работы.НайтиСтроки(Новый Структура("Идентификатор", Точка.Идентификатор)); 
	
	Для каждого текРабота Из мсвРаботы Цикл
		
		Если НЕ УдаляемаяСтрока = Неопределено И текРабота = УдаляемаяСтрока Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(текМаршрутВременноеОкноНачало) Тогда
			Если ЗначениеЗаполнено(текРабота.ВременноеОкноНачало) Тогда
				Если текМаршрутВременноеОкноНачало > текРабота.ВременноеОкноНачало Тогда
					текМаршрутВременноеОкноНачало = текРабота.ВременноеОкноНачало;
				КонецЕсли;
			КонецЕсли;
		Иначе
			текМаршрутВременноеОкноНачало = текРабота.ВременноеОкноНачало;	
		КонецЕсли;			
		
		Если ЗначениеЗаполнено(текМаршрутВременноеОкноОкончание)  Тогда
			Если ЗначениеЗаполнено(текРабота.ВременноеОкноОкончание) Тогда
				Если текМаршрутВременноеОкноОкончание < текРабота.ВременноеОкноОкончание Тогда
					текМаршрутВременноеОкноОкончание = текРабота.ВременноеОкноОкончание;
				КонецЕсли;
			КонецЕсли;
		Иначе
			текМаршрутВременноеОкноОкончание = текРабота.ВременноеОкноОкончание;	
		КонецЕсли;			
	КонецЦикла;
	
	Точка.ВременноеОкноНачало 		= текМаршрутВременноеОкноНачало;
	Точка.ВременноеОкноОкончание 	= текМаршрутВременноеОкноОкончание;
	
КонецПроцедуры // ПересчитатьВременноеОкноТочки()

Функция ПолучитьЗначение(текСтруктура, текЗначение, текКлюч)

	текРезультат = Ложь;
	
	Если текСтруктура.Свойство(текКлюч, текЗначение) И НЕ текЗначение = Неопределено И ЗначениеЗаполнено(текЗначение) Тогда
		текРезультат = Истина;
	КонецЕсли;
	
	Возврат текРезультат;

КонецФункции // ПолучитьЗначение()

Процедура ВывестиСообщениеПоТЧМаршруты(ТекстСообщения, Отказ, НомерСтроки, ИмяТабличнойЧасти, ИмяРеквизита, Параметр1 = "", Параметр2 = "", Параметр3 = "")
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Параметр1, Параметр2, Параметр3);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
	Ссылка,
	ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТабличнойЧасти, НомерСтроки, ИмяРеквизита),
	,
	Отказ);	

КонецПроцедуры

Функция ПолучитьВремяРаботПоАдресу(Адрес)
	
	Если ЗначениеЗаполнено(Адрес) Тогда
		ВремяРабот = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Адрес, "ВремяРаботВТочке");
	Иначе
		ВремяРабот = 0;
	КонецЕсли;
	
	Возврат ВремяРабот;
	
КонецФункции

Функция ПредшественникиСовпадают(стрПредшественники1,стрПредшественники2)
	Результат = Истина;
	
	Если НЕ стрПредшественники1 = ""
		ИЛИ НЕ стрПредшественники2 = "" Тогда
			
		мсвПредшественники1 = СтрРазделить(стрПредшественники1, ",");
		мсвПредшественники2 = СтрРазделить(стрПредшественники2,",");
		
		Если мсвПредшественники1.Количество() = мсвПредшественники2.Количество() Тогда
			Результат = ОбщегоНазначенияКлиентСервер.СпискиЗначенийИдентичны(мсвПредшественники1, мсвПредшественники2);
		Иначе	
			Результат = Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
		
КонецФункции

Процедура ЗаполнитьПериодДатойДвиженийПоМаршруту() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упМаршрутПоРейсу.Период
	|ИЗ
	|	РегистрСведений.упМаршрутПоРейсу КАК упМаршрутПоРейсу
	|ГДЕ
	|	упМаршрутПоРейсу.Регистратор = &Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	упРаботыПоРейсу.Период
	|ИЗ
	|	РегистрСведений.упРаботыПоРейсу КАК упРаботыПоРейсу
	|ГДЕ
	|	упРаботыПоРейсу.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Период = Выборка.Период;		
	Иначе
		Период = '00010101';
	КонецЕсли; 
		
КонецПроцедуры

Функция СтатистикаПоМаршруту() Экспорт
	
	сткРезультат = Новый Структура();
	
	КоличествоОтложенныхТочек = 0;
	КоличествоОтмененныхТочек = 0;
	КоличествоОтложенныхРабот = 0;
	
	Для каждого Строка Из МаршрутДоКорректировки Цикл
		Если Строка.Отменена Тогда
			КоличествоОтмененныхТочек = КоличествоОтмененныхТочек - 1;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из Маршрут Цикл
		Если Строка.Отменена Тогда
			КоличествоОтмененныхТочек = КоличествоОтмененныхТочек + 1;
		КонецЕсли;
		Если Строка.Отложена Тогда
			КоличествоОтложенныхТочек = КоличествоОтложенныхТочек + 1;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из Работы Цикл
		Если Строка.Отложена Тогда
			КоличествоОтложенныхРабот = КоличествоОтложенныхРабот + 1;
		КонецЕсли;
	КонецЦикла;
	
	сткРезультат.Вставить("КоличествоОтмененныхТочек", КоличествоОтмененныхТочек);
	сткРезультат.Вставить("КоличествоОтложенныхТочек", КоличествоОтложенныхТочек);
	сткРезультат.Вставить("КоличествоОтложенныхРабот", КоличествоОтложенныхРабот);
	
	Возврат сткРезультат;
	
КонецФункции

// Функция - Контейнер расформирован
//
// Параметры:
//  ТекстСообщения	 - Строка	 - перечисление заданий по заявкам на перевозку груза которых расформирован контейнер.
// 
// Возвращаемое значение:
//  Булево - Истина, если существует хотя бы один расформированный контейнер.
//
Функция КонтейнерРасформирован(ТекстСообщения) Экспорт
	
	Результат = Ложь;
	
	мсвЗадания = Новый Массив;
	
	мсвРаботыПоКонтейнерам = Работы.НайтиСтроки(Новый Структура("ЭтоКонтейнер", Истина));
	
	Для каждого СтрокаРабота Из мсвРаботыПоКонтейнерам Цикл
		мсвЗадания.Добавить(СтрокаРабота.Задание);
	КонецЦикла;
	
	мсвЗадания = ОбщегоНазначенияКлиентСервер.СвернутьМассив(мсвЗадания);

	Если мсвЗадания.Количество() > 0 Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	упЗаданиеНаПеревозкуГрузаТ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГрузаТ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.упЗаявкаНаПеревозкуГруза КАК упЗаявкаНаПеревозкуГрузаТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.упСтатусыРейсов.СрезПоследних(
		|			,
		|			) КАК УпСтатусыРейсов_СрезПоследнихТ
		|		ПО упЗаявкаНаПеревозкуГрузаТ.ДокументОснование = УпСтатусыРейсов_СрезПоследнихТ.Документ
		|	ПО упЗаявкаНаПеревозкуГрузаТ.Ссылка = упЗаданиеНаПеревозкуГрузаТ.ЗаявкаНаПеревозкуГруза
		|ГДЕ ИСТИНА
		|	И УпСтатусыРейсов_СрезПоследнихТ.Статус В (ЗНАЧЕНИЕ(Перечисление.упСтатусыРейса.Выполнен),
		|			ЗНАЧЕНИЕ(Перечисление.упСтатусыРейса.ВыполненЧастично),
		|			ЗНАЧЕНИЕ(Перечисление.упСтатусыРейса.Завершен))
		|	И упЗаданиеНаПеревозкуГрузаТ.Ссылка В (&Задания)
		|";
		
		Запрос.УстановитьПараметр("Задания", мсвЗадания);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда

			Результат = Истина;
			
			Выборка = РезультатЗапроса.Выбрать();
			
			мсвЗаданияРасформированКонтейнер = Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				мсвЗаданияРасформированКонтейнер.Добавить(Выборка.Ссылка);
			КонецЦикла; 
			
			Если мсвЗаданияРасформированКонтейнер.Количество() > 0 Тогда
				ТекстСообщения = СтрСоединить(мсвЗаданияРасформированКонтейнер, ", ");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции


#КонецОбласти

#КонецЕсли