
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	ОбновитьПолеHTML();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда = Неопределено)
	
	ОбновитьПолеHTML();
	HTMLДокумент = Адрес;
		
КонецПроцедуры

&НаСервере
Процедура ОбновитьПолеHTML()
	
	Попытка
		Адрес = ПолучитьАдрес();
	Исключение
	    ТекстСообщения = ОписаниеОшибки();
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдрес()
	
	ПараметрыЗапроса = "menu=false&header=false" + "&serie=" + упСЛК.Серия();
		
	Адрес = упСЛК.АдресКонсоли() + "/" + ? (ПараметрыЗапроса <> "", "?", "") + ПараметрыЗапроса;
	Возврат Адрес;
	
КонецФункции

#КонецОбласти

