
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТемператураОтПриИзменении(Элемент)
	
	Если Объект.ТемператураДо < Объект.ТемператураОт Тогда 
		Объект.ТемператураДо = Объект.ТемператураОт;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТемператураДоПриИзменении(Элемент)
	
	Если Объект.ТемператураДо < Объект.ТемператураОт Тогда 
		Объект.ТемператураОт = Объект.ТемператураДо;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры

#КонецОбласти