
#Область ПрограммныйИнтерфейс

// Процедура проводит первоначальное заполнение регистра
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	тбзТипыОбъектов = Новый ТаблицаЗначений;
	тбзТипыОбъектов.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
	тбзТипыОбъектов.Колонки.Добавить("Префикс", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(3)));
	НоваяСтрока = тбзТипыОбъектов.Добавить(); НоваяСтрока.ТипОбъекта = "Документ.упРейс";                         НоваяСтрока.Префикс = "RT";
	НоваяСтрока = тбзТипыОбъектов.Добавить(); НоваяСтрока.ТипОбъекта = "Документ.упЗаявкаНаПеревозкуГруза";       НоваяСтрока.Префикс = "ORD";
	НоваяСтрока = тбзТипыОбъектов.Добавить(); НоваяСтрока.ТипОбъекта = "Документ.упЗаявкаНаТС";                   НоваяСтрока.Префикс = "DO";
	
	НаборЗаписей = РегистрыСведений.упПрефиксыШтрихкодов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Для каждого Запись Из НаборЗаписей цикл
		СтрокаТаблицы = тбзТипыОбъектов.Найти(Запись.ТипОбъекта, "ТипОбъекта");
		Если СтрокаТаблицы <> Неопределено тогда
			тбзТипыОбъектов.Удалить(СтрокаТаблицы);
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = тбзТипыОбъектов.Найти(Запись.Префикс, "Префикс");
		Если СтрокаТаблицы <> Неопределено тогда
			тбзТипыОбъектов.Удалить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Если тбзТипыОбъектов.Количество() тогда
		Для каждого СтрокаТаблицы Из тбзТипыОбъектов цикл
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.ТипОбъекта = СтрокаТаблицы.ТипОбъекта;
			НоваяСтрока.Префикс    = СтрокаТаблицы.Префикс;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти