#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает массив блокируемых реквизитов.
//
// Возвращаемое значение:
//   Массив - Результат выполнения.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("СрокДоставки");
	Результат.Добавить("Масса");
	Результат.Добавить("Объем");
	Результат.Добавить("МассаНетто");
	Результат.Добавить("ОбъемНетто");
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли

