
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ТекущийМассив = Параметры.Список;
	ГеографическаяЗона = Параметры.Ссылка;
	Для каждого текЭлемент Из ТекущийМассив Цикл
		СписокВыбора.Добавить(текЭлемент,текЭлемент.display_name);	
	КонецЦикла;	
	
	Заголовок = НСтр("ru = 'Выберете один из вариантов ответа от сервисе геокодирования'");
	
	ИспользоватьКоэффициент = Ложь;
	КоэффициентАппроксимизации = 0.005;	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТекущиеДанные = ПолучитьДанныеДляВозврата();
	Закрыть(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбораЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ПолучитьДанныеДляВозврата();
	Закрыть(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Дополним выбранное значение данными.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   Структура   - Выбранные данные.
//
Функция ПолучитьДанныеДляВозврата()
	
	ТекущиеДанные = Элементы.СписокВыбора.ТекущиеДанные.Значение;
	ТекущиеДанные.Вставить("Ссылка",ГеографическаяЗона);
	
	Если ИспользоватьКоэффициент Тогда
		ТекущиеДанные.Вставить("Отклонение",КоэффициентАппроксимизации);
	Иначе
		ТекущиеДанные.Вставить("Отклонение",Неопределено);
	КонецЕсли;
	
	Возврат ТекущиеДанные;
	
КонецФункции // ПолучитьДанныеДляВозврата()

#КонецОбласти
