
#Область ИнтерфейсДляРаботыСПодсистемойВзаимодействия

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Взаимодействия.

// Возвращает партнера и контактных лиц сделки.
// 
// Параметры:
//  Ссылка  - ДокументСсылка.упКоммерческоеПредложение - документ, абонента которого необходимо получить.
//
// Возвращаемое значение:
//   Массив   - Ссылки - Масив ссылок.
//
Функция ПолучитьКонтакты(Ссылка) Экспорт
	
	//Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Неопределено;
	//КонецЕсли;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = ТекстЗапросаПоКонтактам();
	//Запрос.УстановитьПараметр("Предмет",Ссылка);
	//
	//НачатьТранзакцию();
	//Попытка
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если РезультатЗапроса.Пустой() Тогда
	//		Результат = Неопределено;
	//	Иначе
	//		Результат = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Контакт");
	//	КонецЕсли;
	//	
	//	ЗафиксироватьТранзакцию();
	//Исключение
	//	ОтменитьТранзакцию();
	//	ВызватьИсключение;
	//КонецПопытки;
	//
	//Возврат Результат;
	
КонецФункции

// Формируем текст запроса
//
// Параметры:
//  ТекстВременнаяТаблица  - Строка - Текст.
//  Объединить  - Булево - Объединить значение.
//
// Возвращаемое значение:
//   Строка   - Текстовое представление.
//
Функция ТекстЗапросаПоКонтактам(ТекстВременнаяТаблица = "", Объединить = Ложь) Экспорт
	
	//ШаблонВыбрать = ?(Объединить,"ВЫБРАТЬ РАЗЛИЧНЫЕ","ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ");
	//
	//ТекстЗапроса = "
	//|%ШаблонВыбрать%
	//|	" + ТекстВременнаяТаблица + "";
	//
	//ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ШаблонВыбрать%",ШаблонВыбрать);
	//
	//Если Объединить Тогда
	//	
	//	ТекстЗапроса = "
	//	| ОБЪЕДИНИТЬ ВСЕ
	//	|" + ТекстЗапроса;
	//	
	//КонецЕсли;
	//
	//Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти 

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой ЗапретРедактированияРеквизитовОбъектов.

// Возвращает описание блокируемых реквизитов.
//
// Возвращаемое значение:
//     Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//              где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы, связанного с
//              реквизитом.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	//БлокируемыеРеквизиты.Добавить("ТипГруза");
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции

#КонецОбласти 