
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Запонлим соответствие именами макетов.
//
// Возвращаемое значение:
//   Соответствие   - В соответствии сервису задаем имя макета и сервиса.
//
Функция ПолучитьСоответствиеСервисаЛегальности() Экспорт

	Соответствие = Новый Соответствие;
	
	// Google.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаGoogle","Google");
	Соответствие.Вставить(Перечисления.упТипыКарт.GoogleMaps,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.GoogleMaps,Структура);
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.Google,Структура);
	
	// Яндекс.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаЯндекс","Яндекс");
	Соответствие.Вставить(Перечисления.упТипыКарт.ЯндексКарты,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.ЯндексКарты,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.ЯндексМаршрутизация,Структура);
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.Яндекс,Структура);
	
	// СитиГИД.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаСитиГИД","СитиГИД");
	Соответствие.Вставить(Перечисления.упТипыКарт.СитиГИД,Структура);
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.СитиГИД,Структура);
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.СитиГИД,Структура);
	
	// OSM.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаOSM","Open Street Map");
	Соответствие.Вставить(Перечисления.упТипыКарт.OSM,Структура);
	
	// Graphhopper.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаGraphhopper","Graphhopper");
	Соответствие.Вставить(Перечисления.упТипыМаршрутизаторов.Graphhopper,Структура);
	
	// Nominatim.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаNominatim","Nominatim");
	Соответствие.Вставить(Перечисления.упТипыГеокодеров.Nominatim,Структура);

	// Dadata.
	Структура = Новый Структура("Макет,Имя","УсловияИспользованияСервисаDadata","Dadata");
	Соответствие.Вставить(Истина, Структура);

	Возврат Соответствие;
	
КонецФункции // ПолучитьСоответствиеСервисаЛегальности()

#КонецОбласти

#КонецЕсли