
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Вид <> Перечисления.упВидыКассовойТехники.IBox Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Логин");
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Вид = Перечисления.упВидыКассовойТехники.IBOX И (Не ЗначениеЗаполнено(РегистрационныйНомер) Или СтрДлина(РегистрационныйНомер) < 36) Тогда
		РегистрационныйНомер = Строка(Новый УникальныйИдентификатор);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли