#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мсвТопливныеКарты = Неопределено;
	Если Параметры.Свойство("ТопливныеКарты", мсвТопливныеКарты ) Тогда
		Для каждого Строка Из мсвТопливныеКарты  Цикл
			НоваяСтрока = ТаблицаСопоставленияТопливныхКарт.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьДанные(Истина);
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ЗаписатьДанные(ЗакрытьФорму = Ложь)
	
	Отказ = Ложь;
	
	ТекстОшибки = "";
	ЗаписатьДанныеНаСервере(ТекстОшибки, Отказ);
	Если Отказ Тогда
		ТекстСообщения = Нстр("ru = 'Не удалось записать данные, подробности см. журнал регистрации.'");
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);	
	КонецЕсли;
	
	Если Не Отказ И ЗакрытьФорму Тогда
		Закрыть(ТаблицаСопоставлений());
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеНаСервере(ТекстОшибки, Отказ)
	тбСопоставленияТопливныхКарт = ТаблицаСопоставленияТопливныхКарт.Выгрузить();
	тбСопоставленияТопливныхКарт.Колонки.Добавить("ИндексСтроки", Новый ОписаниеТипов("Число",
																 Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Неотрицательный)));
	Для каждого Строка Из тбСопоставленияТопливныхКарт Цикл
		Строка.ИндексСтроки = тбСопоставленияТопливныхКарт.Индекс(Строка);
	КонецЦикла;															 
	
	Обработки.упЗагрузкаДанныхОтТопливныхКомпаний.СформироватьТопливныеКарты(тбСопоставленияТопливныхКарт, Отказ);		
	Если НЕ Отказ Тогда
		Для каждого СтрокаТопливныеКарты Из тбСопоставленияТопливныхКарт Цикл
			Строка = ТаблицаСопоставленияТопливныхКарт.Получить(СтрокаТопливныеКарты.ИндексСтроки);
			Строка.ТопливнаяКарта = СтрокаТопливныеКарты.ТопливнаяКарта;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТаблицаСопоставлений()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаСопоставленияТопливныхКарт.Выгрузить());
КонецФункции


#КонецОбласти
