
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти
	
#Область ПрограммныйИнтерфейс

// Получить разрешенное значение. К текущему значению применяются ограничения кодом.
//
Функция ПолучитьРазрешенноеЗначение() Экспорт 
	
	Порог = 30;
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Порог = 90;
	КонецЕсли; 
	Если Значение <> 0 И Порог > Значение Тогда
		Значение = Порог;
	КонецЕсли;
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#КонецЕсли


