
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ТоварныйСоставГруза.Свернуть("Номенклатура, УпаковкаНоменклатуры, АналитическийРазрез, Цена, СтавкаНДС", "Количество, Сумма, СуммаБезНДС, СуммаНДС");
	
	ВидГруза = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипГруза, "ВидГруза");
	
	Тара = (ВидГруза = Перечисления.упВидыГрузов.Тара);
	
	Если ВидГруза = Перечисления.упВидыГрузов.Груз Тогда
		Если НЕ ЗначениеЗаполнено(Сумма) Тогда
			Сумма = ТоварныйСоставГруза.Итог("Сумма");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СуммаНДС) Тогда
			СуммаНДС = ТоварныйСоставГруза.Итог("СуммаНДС");
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда 
		Штрихкод = Код;
	КонецЕсли;	
	
	ДополнительныеСвойства.Вставить("Создание", Не ЗначениеЗаполнено(Ссылка));
				
КонецПроцедуры

#КонецОбласти  

#КонецЕсли