#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.упПрисоединениеОтсоединениеПрицепа.ВыполнитьКонтрольПрицепа(Ссылка,Отказ);
	
	ТЗПрицепы = Новый ТаблицаЗначений;
	ТЗПрицепы.Колонки.Добавить("Прицеп");
	ТЗПрицепы.Колонки.Добавить("ТранспортноеСредство");
	ТЗПрицепы.Колонки.Добавить("Операция");

	БлокировкаДанных = Новый БлокировкаДанных;
		
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упПрицепыТранспортныхСредств");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Прицеп", Прицеп);

	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение                                                      
		Отказ = Истина;
		Возврат;
	КонецПопытки;
		
	СтрТЗПрицепы = ТЗПрицепы.Добавить();
	СтрТЗПрицепы.Прицеп = Прицеп;
	СтрТЗПрицепы.ТранспортноеСредство = ТранспортноеСредство;
	СтрТЗПрицепы.Операция = Операция;
	ДополнительныеСвойства.Вставить("Прицепы", ТЗПрицепы);

	РеквизитыОбъекта = Новый Структура();
	РеквизитыОбъекта.Вставить("Дата", 	   ДатаОперации);	
	
	// Приcоединение/отсоединение прицепа
	упУчетТранспортныхСредств.СформироватьДвиженияПрицепыТС(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 

#КонецЕсли
