
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	упЗаявкаФормаДокумента.ПриСозданииНаСервереФормаДокумента(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	ПриСозданииПриЧтенииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()

	упЗаявкаФормаДокумента.ПриСозданииПриЧтенииНаСервереИнициализацияНовогоОбъектаФормаДокумента(ЭтаФорма, Объект, Параметры);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.ВидТранспортнойУслуги	 = Перечисления.упВидыТранспортныхУслуг.УслугиСпецтехники;
	КонецЕсли;
	
     упЗаявкаФормаДокумента.ПриСозданииПриЧтенииНаСервереИнициализацияРеквизитовФормыФормаДокумента(ЭтаФорма, Объект, Параметры);
		
	УстановитьПараметрыВыбораАдресаОтправления(ЭтаФорма);
	
	упВводНаОсновании.УстановитьВидимостьКоманд(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтоНовыйДокумент = ЗначениеЗаполнено(Объект.Ссылка);
	
	упЗаявкаФормаДокументаКлиент.ФормаДокументаПриОткрытии(ЭтаФорма, Отказ);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
			
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	упЗаявкаФормаДокумента.ОбработкаПроверкиЗаполненияНаСервереФормаДокумента(ЭтаФорма, Объект, Отказ, ПроверяемыеРеквизиты);
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	упЗаявкаФормаДокумента.ПередЗаписьюНаСервереФормаДокумента(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(НовыйСтатус) Тогда 
		ПроверяемыйСтатус = НовыйСтатус;
	Иначе
		ПроверяемыйСтатус = Статус;
	КонецЕсли;	
	
	Если Истина
		И ПроверяемыйСтатус <> ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.НеЗагружена") 
		И Объект.КоличествоРабочихСмен = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполено количество рабочих смен'"), Объект.Ссылка, "КоличествоРабочихСмен",, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	упЗаявкаФормаДокументаКлиент.ПослеЗаписиФормаДокумента(ЭтаФорма, Объект, ПараметрыЗаписи);
			
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	упЗаявкаФормаДокумента.ПослеЗаписиНаСервереФормаДокумента(ЭтаФорма, Объект, ТекущийОбъект, ПараметрыЗаписи);
	
	упВводНаОсновании.УстановитьВидимостьКоманд(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	упЗаявкаФормаДокументаКлиент.ОбработкаОповещенияФормаДокумента(ЭтаФорма, Объект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);

КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
    Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
        РезультатВыполнения = Неопределено;
        ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
        ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
    КонецЕсли;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура АдресОтправленияПриИзменении(Элемент)
	
	упЗаявкаФормаДокументаКлиент.АдресОтправленияПриИзмененииФормаДокумента(ЭтаФорма, Объект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)

	упЗаявкаФормаДокументаКлиент.ОтправительПриИзмененииФормаДокумента(ЭтаФорма, Объект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	сткОтбор = Новый Структура;
	сткОтбор.Вставить("Перевозчик", Истина);
	сткПараметры = Новый Структура("Отбор", сткОтбор);
	ОткрытьФорму("Справочник.упПартнеры.ФормаВыбора", сткПараметры, Элементы.Отправитель,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказчикПриИзменении(Элемент)
	
	упЗаявкаФормаДокументаКлиент.ЗаказчикПриИзмененииФормаДокумента(ЭтаФорма, Объект, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	Если ВедетсяВалютныйУчет Тогда
		УстановитьВалютуРеглУчета();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеВодителюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.ЗаданиеВодителю", НСтр("ru = 'Задание водителю'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыПлановыеДоходы

&НаКлиенте
Процедура ПлановыеДоходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если ВедетсяВалютныйУчет И НоваяСтрока И Не Копирование Тогда
		ТекущаяСтрока	= Элементы.ПлановыеДоходы.ТекущиеДанные;
		Если ВедетсяВалютныйУчет Тогда
			ТекущаяСтрока.Валюта 		= ВалютаРеглУчета;	
		Иначе
			ТекущаяСтрока.Валюта 		= ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");	
		КонецЕсли;

		ТекущаяСтрока.Количество = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьИтоговуюСуммуДоходы();
	УстановитьПредставлениеСуммовыхПоказателей();
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыПослеУдаления(Элемент)
	РассчитатьИтоговуюСуммуДоходы();
	//РассчитатьПроцентСкидкиИтого();
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыСкидкаПроцентПриИзменении(Элемент)
 	ПересчитатьСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыСуммаПриИзменении(Элемент)
 	ПересчитатьСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыЦенаПриИзменении(Элемент)
 	ПересчитатьСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыКоличествоПриИзменении(Элемент)
 	ПересчитатьСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыСкидкаСуммаПриИзменении(Элемент)
 	ПересчитатьСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыСтавкаНДСПриИзменении(Элемент)
 	ПересчитатьСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеДоходыСтатьяДоходовПриИзменении(Элемент)
	ТекущаяСтрока	= Элементы.ПлановыеДоходы.ТекущиеДанные;
	СтатьяДоходов	= ТекущаяСтрока.СтатьяДоходов;
	Если ЗначениеЗаполнено(СтатьяДоходов) Тогда
		ТекущаяСтрока.СтавкаНДС = упСервисныеФункцииВызовСервера.ЗначениеРеквизитаОбъекта(СтатьяДоходов, "СтавкаНДС");
		ПересчитатьСтроку(Элемент);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьВидПеревозки(Команда)
	
	Если Ложь
		Или Объект.Ссылка.Пустая() 
		Или Модифицированность 
	Тогда 
		ТекстВопроса =
			НСтр("ru = 'Документ не записан. Выполнение команды
			           |""Подобрать вид перевозки"" возможно только после записи данных.
			           |
			           |Документ будут записан.'");
		Обработчик = Новый ОписаниеОповещения("ПодобратьВидПеревозкиПослеОтветаНаВопросЗаписать", ЭтотОбъект);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	ПодобратьВидПеревозкиНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНаправлениеДеятельности(Команда)
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда 
		ТекстВопроса =
			НСтр("ru = 'Документ не записан. Выполнение команды
			           |""Подобрать направление деятельности"" возможно только после записи данных.
			           |
			           |Документ будут записан.'");
		Обработчик = Новый ОписаниеОповещения("ПодобратьНаправлениеДеятельностиПослеОтветаНаВопросЗаписать", ЭтотОбъект);
		ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	
	ПодобратьНаправлениеДеятельностиНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВременноеОкноОтправления(Команда)
	
	упСервисныеФункцииКлиент.РедактироватьПериод(Объект, Новый Структура("ДатаНачала, ДатаОкончания", "ОтправлениеГрузаС", "ОтправлениеГрузаПо"));
	
КонецПроцедуры

&НаКлиенте
Процедура УточнитьПоГрафикуРаботыТочкиОтправления(Команда)
	
	Если ЗначениеЗаполнено(Объект.ГрафикРаботыАдресаОтправления) Тогда
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("ГрафикРаботы" , Объект.ГрафикРаботыАдресаОтправления);
		сткПараметры.Вставить("НачалоПериода", Объект.ОтправлениеГрузаС);
		сткПараметры.Вставить("КонецПериода" , Объект.ОтправлениеГрузаПо);
		сткПараметры.Вставить("ЦветФона"     , Элементы.ГруппаОтправление.ЦветФона); 
		
		ОткрытьФорму("Обработка.упИнтерфейсУправленияВременем.Форма.ФормаВыбораВременногоОкна", сткПараметры,,,,,Новый ОписаниеОповещения("ИзменитьВремяОтправленияЗавершение", ЭтаФорма), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусНовая(Команда)
	
	Если Статус = ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.НеЗагружена") Тогда 
		Если УстановитьСтатусНоваяСервер() Тогда 
			ОповеститьОбИзменении(Объект.Ссылка);
		Иначе
			ПоказатьОповещениеПользователя(НСтр("ru = 'Статус не изменен'"),, НСтр("ru = 'Не удалось провести документ'"), БиблиотекаКартинок.Ошибка32);
		КонецЕсли;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Статус заявки должен быть ""Новая""'"), Объект.Ссылка, "Статус");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусКВыполнению(Команда)
	
	Если ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		Если УстановитьСтатусКВыполнениюСервер() Тогда 
			ОповеститьОбИзменении(Объект.Ссылка);
		Иначе
			ПоказатьОповещениеПользователя(НСтр("ru = 'Статус не изменен'"),, НСтр("ru = 'Не удалось провести документ'"), БиблиотекаКартинок.Ошибка32);
		КонецЕсли;
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Статус не изменен'"),, НСтр("ru = 'Не заполнен вид перевозки'"), БиблиотекаКартинок.Ошибка32);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусСогласована(Команда)
	
	Если Ложь
		Или Статус = ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.Новая") 
		Или Статус = ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.НеСогласована") 
	Тогда 
		Если УстановитьСтатусСогласованаСервер() Тогда 
			ОповеститьОбИзменении(Объект.Ссылка);
		Иначе
			ПоказатьОповещениеПользователя(НСтр("ru = 'Статус не изменен'"),, НСтр("ru = 'Не удалось провести документ'"), БиблиотекаКартинок.Ошибка32);
		КонецЕсли;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Статус заявки должен быть ""Новая"" или ""Не согласована""'"), Объект.Ссылка, "Статус");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтменена(Команда)
	
	Если Истина
		И Статус <> ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.Выполнена")
		И Статус <> ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаПеревозкуГруза.ВыполненаЧастично") 
	Тогда 
		Если УстановитьСтатусОтмененаСервер() Тогда 
			ОповеститьОбИзменении(Объект.Ссылка);
		Иначе
			ПоказатьОповещениеПользователя(НСтр("ru = 'Статус не изменен'"),, НСтр("ru = 'Не удалось провести документ'"), БиблиотекаКартинок.Ошибка32);
		КонецЕсли;
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Заявка выполнена, отмена невозможна'"), Объект.Ссылка, "Статус");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТиповымиСтатьямиДоходов(Команда)
	
	ОповещениеЗаполнения = Новый ОписаниеОповещения("ЗаполнитьТиповымиСтатьямиДоходовКлиент",ЭтаФорма);
	упСервисныеФункцииКлиент.ВопросОСохраненииИзмененныхДанных(ЭтаФорма, ОповещениеЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДоходы(Команда)
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		РассчитатьДоходыНаСервере();
		РассчитатьИтоговуюСуммуДоходы();
		УстановитьПредставлениеСуммовыхПоказателей();
		//РассчитатьПроцентСкидкиИтого();
	Иначе	
		ТекстОшибки = НСтр("ru='Не задано соглашение с клиентом'");	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект.Ссылка, "Объект.Соглашение");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДоходыСРасшифровкой(Команда)
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		мсвПриемников = РассчитатьДоходыСРасшифровкойНаСервере();
		РассчитатьИтоговуюСуммуДоходы();
		//РассчитатьПроцентСкидкиИтого();
		УстановитьПредставлениеСуммовыхПоказателей();
		Для каждого Приемник Из мсвПриемников Цикл
			Приемник.Приемник.Показать("Расшифровка расчетов");	
		КонецЦикла;
	Иначе	
		ТекстОшибки = НСтр("ru='Не задано соглашение с клиентом'");	
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,Объект.Ссылка,"Объект.Соглашение");
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	 УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
    ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПредставлениеСуммовыхПоказателей() Экспорт
	
	Если ВедетсяВалютныйУчет Тогда
		ПлановыеДоходыСНДСПредставление = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеСуммыСВалютой(Объект.СуммаДоходы, ВалютаУпрУчета);
		ПлановыеДоходыНДСПредставление  = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеСуммыСВалютой(Объект.СуммаДоходыНДС, ВалютаУпрУчета);
		СкидкаПредставление             = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеСуммыСВалютой(Объект.СуммаДоходыСкидка, ВалютаУпрУчета);
	Иначе	
		ПлановыеДоходыСНДСПредставление = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеСуммыСВалютой(Объект.СуммаДоходы);
		ПлановыеДоходыНДСПредставление  = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеСуммыСВалютой(Объект.СуммаДоходыНДС);
		СкидкаПредставление             = упСервисныеФункцииКлиентСервер.СформироватьПредставлениеСуммыСВалютой(Объект.СуммаДоходыСкидка);
	КонецЕсли;  
	СкидкаПредставление = СтрШаблон("%1 (%2%%)", Объект.СуммаДоходыСкидка, ?(Объект.СуммаДоходы = 0, 0, Окр(Объект.СуммаДоходыСкидка / Объект.СуммаДоходы *  100, 2)));
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьЭлементы() Экспорт

	Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда 
		Если Ложь
			ИЛИ Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Отменена
			ИЛИ Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Отказ 
		Тогда 
			ТолькоПросмотр = Истина;
			
		ИначеЕсли Ложь 
				Или Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.СформированыЗадания
				ИЛИ Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.ВключенаВРейс
				ИЛИ Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Выполняется 
				ИЛИ Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Выполнена
				ИЛИ Статус = Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.ВыполненаЧастично
		Тогда
			мсвСвойств = Новый Массив;
			мсвСвойств.Добавить(Новый Структура("Ключ, Значение", "ТолькоПросмотр", Истина));
			мсвСвойств.Добавить(Новый Структура("Ключ, Значение", "Доступность", Ложь));
		
			мсвИсключений = Новый Массив;
			мсвИсключений.Добавить("ГруппаСтатус"); 
			упСервисныеФункцииКлиентСервер.ИзменитьЗначениеСвойстваЭлементаФормыСПодчиненными(Элементы.ГруппаШапка, мсвСвойств, мсвИсключений);
		
			упСервисныеФункцииКлиентСервер.ИзменитьЗначениеСвойстваЭлементаФормыСПодчиненными(Элементы.ГруппаПеревозка, мсвСвойств);
			упСервисныеФункцииКлиентСервер.ИзменитьЗначениеСвойстваЭлементаФормыСПодчиненными(Элементы.ГруппаПлановыеДоходы, мсвСвойств);
			
		КонецЕсли;	
	КонецЕсли;	
	
	Если Истина
		И НЕ ТолькоПросмотр
		И ЗначениеЗаполнено(Объект.Ссылка)
		И ВедетсяРаботаВРазныхЧасовыхПоясах 
	Тогда
		ТолькоПросмотр = НЕ упСервисныеФункции.СовпадаютЧасовойПоясПользователяИДокумента(Объект.ЧасовойПояс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПеревозкиПриИзменении(Элемент)
	
	ВидПеревозкиПриИзмененииНаСервере();
	
	ЭтоНовыйДокумент = ЗначениеЗаполнено(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ВидПеревозкиПриИзмененииНаСервере()
	
	упЗаявкаФормаДокумента.ВидПеревозкиПриИзмененииНаСервере(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуПоВидуПеревозки() Экспорт
	
	ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза  = Ложь;
			
	Если ЗначениеЗаполнено(Объект.ВидПеревозки) Тогда
		сткЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ВидПеревозки, "ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза");
		ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза = сткЗначенияРеквизитов.ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза;	
	КонецЕсли;
	
	упРаботаСоСтатусами.УстановитьКнопкиСтатусаЗаявкиНаПеревозкуГруза(Объект.Ссылка, Статус, Элементы, ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза);
		
КонецПроцедуры

&НаСервере
Функция УстановитьСтатусНоваяСервер()
	
	Возврат ИзменитьСтатусЗаявки(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Новая);
	
КонецФункции

&НаСервере
Функция УстановитьСтатусКВыполнениюСервер()
	
	сткВозврата = упЗаданиеНаПеревозку.РазрешеноПеревестиКВыполнению(Статус, упСервисныеФункцииВызовСервера.ЗначениеРеквизитаОбъекта(Объект.ВидПеревозки, "ТребуетсяСогласованиеЗаявкиНаПеревозкуГруза"));
	Если сткВозврата.Результат Тогда
	    Возврат ИзменитьСтатусЗаявки(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.КВыполнению);
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(сткВозврата.ТекстОшибки, Объект.Ссылка, "Статус");
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция УстановитьСтатусСогласованаСервер()
	
	Если Объект.ВидПеревозки.АвтоматическиПередаватьСогласованныеЗаявкиКИсполнению Тогда 
		Возврат ИзменитьСтатусЗаявки(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.КВыполнению);
	Иначе	
		Возврат ИзменитьСтатусЗаявки(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Согласована);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция УстановитьСтатусОтмененаСервер()
	
	Возврат ИзменитьСтатусЗаявки(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Отменена);
	
КонецФункции

&НаСервере
Функция ИзменитьСтатусЗаявки(СтатусЗаявки)
	
	Возврат упЗаявкаФормаДокумента.ИзменитьСтатусЗаявки(ЭтаФорма, Объект, СтатусЗаявки);
	
КонецФункции

&НаСервере
Процедура ИзменилсяСтатус() Экспорт
	упЗаявкаФормаДокумента.ИзменилсяСтатус(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
// Процедура заполнения таблицы "ПлановыеДоходы" типовыми статьями.
//
Процедура ЗаполнитьТиповымиСтатьямиДоходовКлиент(Результат, ДополнительныеПараметры) Экспорт
	Если Объект.ПлановыеДоходы.Количество() > 0 Тогда
		ОбработчикОповещенияПоказатьВопрос = Новый ОписаниеОповещения("ВопросОПерезаполненииПлановыхДоходов", ЭтаФорма);
		ПоказатьВопрос(ОбработчикОповещенияПоказатьВопрос, НСтр("ru='Таблица ""Плановые доходы"" будет перезаполнена. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьТиповымиСтатьямиДоходовНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТиповымиСтатьямиДоходовНаСервере()
	
	упЗаявкаФормаДокумента.ЗаполнитьТиповымиСтатьямиДоходовНаСервере(ЭтаФорма, Объект);
				
КонецПроцедуры

&НаКлиенте
// Продолжение процедуры (см. выше).
//
Процедура ВопросОПерезаполненииПлановыхДоходов(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТиповымиСтатьямиДоходовНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере	
Процедура ПодобратьВидПеревозкиНаСервере()
	
	Объект.ВидПеревозки = Справочники.упВидыПеревозок.ПодобратьВидПеревозки(Объект.Ссылка);
	ВидПеревозкиПриИзмененииНаСервере();
	
КонецПроцедуры // ПодобратьВидПеревозкиНаСервере()

&НаСервере	
Процедура ПодобратьНаправлениеДеятельностиНаСервере()
	
	Объект.НаправлениеДеятельности = Справочники.упНаправленияДеятельности.ПодобратьНаправлениеДеятельности(Объект.Ссылка);
	
КонецПроцедуры // ПодобратьНаправлениеДеятельностиНаСервере()

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#Область ОповещенияПоСобытиям

&НаКлиенте
// Процедура изменения признака общего груза после утвердительного ответа.
//
Процедура ПодобратьВидПеревозкиПослеОтветаНаВопросЗаписать(Ответ, ПараметрыВыполнения) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;

	ПодобратьВидПеревозкиНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры // ПодобратьВидПеревозкиПослеОтветаНаВопросЗаписать()

&НаКлиенте
// Процедура изменения признака общего груза после утвердительного ответа.
//
Процедура ПодобратьНаправлениеДеятельностиПослеОтветаНаВопросЗаписать(Ответ, ПараметрыВыполнения) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Записать() Тогда
		Возврат;
	КонецЕсли;
		
	ПодобратьНаправлениеДеятельностиНаСервере();
	
	Модифицированность = Истина;
	
КонецПроцедуры // ПодобратьНаправлениеДеятельностиПослеОтветаНаВопросЗаписать()

&НаКлиенте
// Процедура изменения время отправления после утвердительного ответа.
//
Процедура ИзменитьВремяОтправленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат <> КодВозвратаДиалога.Отмена Тогда
		Объект.ОтправлениеГрузаС  = Результат.НачалоПериода;
		Объект.ОтправлениеГрузаПо = Результат.КонецПериода;
		Модифицированность = Истина;		
	КонецЕсли;
	
КонецПроцедуры // ИзменитьВремяОтправленияЗавершение()

&НаКлиенте
Функция ПолучитьИмяПоля(ИмяПоля)
	Возврат СтрЗаменить(ИмяПоля, "ПлановыеДоходы","");
КонецФункции

&НаСервере
Процедура УстановитьВалютуРеглУчета()
	ВалютаРеглУчета = упСервисныеФункцииВызовСервера.ВалютаРегламентированногоУчетаОбъекта(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(Элемент)
	ТекущаяСтрока	= Элементы.ПлановыеДоходы.ТекущиеДанные;
	СтруктураДанные	= Новый Структура("Ссылка, Соглашение", Объект.Ссылка, Объект.Соглашение);
	упОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСтрокуПриИзмененииЗначения(ТекущаяСтрока,ПолучитьИмяПоля(Элемент.Имя),СтруктураДанные);
КонецПроцедуры


&НаСервере
Процедура РассчитатьДоходыНаСервере()
	упТарификацияВызовСервера.Рассчитать(Объект);
КонецПроцедуры


&НаСервере
Функция РассчитатьДоходыСРасшифровкойНаСервере()
	ТабличныйДокумент            = Новый ТабличныйДокумент;
	сткПриемникТабличныйДокумент = Новый Структура("Приемник, ЗапрашиваемыйУровеньСообщений",ТабличныйДокумент,2);
	
	мсвПриемников = Новый Массив();
	мсвПриемников.Добавить(сткПриемникТабличныйДокумент);
	
	сткТрассировка = упСервисныеФункцииКлиентСервер.Новый_СтруктураТрассировки(мсвПриемников, "РасчетыПоПравиламРасчета");
	
	упТарификацияВызовСервера.Рассчитать(Объект, , сткТрассировка);
	
	Возврат мсвПриемников;
	
КонецФункции

#Область Взаиморасчеты

&НаКлиенте
Процедура ЗагрузитьВзаиморасчетыСПартнерами() Экспорт
	упЗаявкаФормаДокументаКлиент.ЗагрузитьВзаиморасчетыСПартнерами(ЭтаФорма, Объект);
	Если ЭтаФорма.ПодключитьОбработчикОжиданияВзаиморасчеты Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьЗагрузкуВзаиморасчетов", 1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьЗагрузкуВзаиморасчетов() Экспорт
	Результат = ПолучитьИзВременногоХранилища(ВзаиморасчетыАдресХранилища);
	Если НЕ Результат = Неопределено Тогда
		ОтключитьОбработчикОжидания("Подключаемый_ПроверитьЗагрузкуВзаиморасчетов");		
		упЗаявкаФормаДокументаКлиент.ЗаполнитьФормуВзаиморасчетами(ЭтаФорма, Результат);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПараметрыВыбораАдресаОтправления(ЭтаФорма)
	
	упСервисныеФункцииКлиентСервер.УстановитьПараметрВыбораПоляФормы(ЭтаФорма.Элементы.АдресОтправления, "ГеографическаяЗона", ЭтаФорма.Объект.ЗонаОтправления, Не ЗначениеЗаполнено(ЭтаФорма.Объект.ЗонаОтправления));
	
КонецПроцедуры

Процедура РассчитатьИтоговуюСуммуДоходы() Экспорт
	сткСоответствиеРеквизитов = Новый Структура();
	сткСоответствиеРеквизитов.Вставить("СуммаДоходы",			"Сумма");
	сткСоответствиеРеквизитов.Вставить("СуммаДоходыСкидка",	"СкидкаСумма");
	сткСоответствиеРеквизитов.Вставить("СуммаДоходыНДС",		"СуммаНДС");
	упОбработкаТабличнойЧастиКлиентСервер.ПересчитатьИтогиПоСтрокам(Объект, "ПлановыеДоходы", сткСоответствиеРеквизитов, ЭтаФорма.ВедетсяВалютныйУчет);
КонецПроцедуры

#КонецОбласти
