
#Область ОбработчикиСобытийФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭтапыЭтапПриИзменении(Элемент)
	
	текСтрока = Элементы.Этапы.ТекущиеДанные;
	Если ЗначениеЗаполнено(текСтрока.Этап) И текСтрока.Этап = ПредопределенноеЗначение("Перечисление.упЭтапыСхемыВыбораПеревозчика.ЗаявкаТекущемуПеревозчику") И текСтрока.РазыгрыватьТендер Тогда
		текСтрока.РазыгрыватьТендер = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти 
