
#Область ПрограммныйИнтерфейс

// Проверка наличия лицензии.
//
Процедура ПроверитьЛицензиюСеанса() Экспорт
	
	//МенеджерОбъектов = упСЛК.МенеджерОбъектов();
	//МенеджерОбъектов.ПроверитьЛицензиюСеанса(Истина);
	//
КонецПроцедуры

// Получает доступные модули.
//
// Возвращаемое значение:
//  Произвольный - Результат выполнения.
//
Функция ДоступныеМодули() Экспорт
	
	Возврат Неопределено;
	
	Возврат упСЛК.СоздатьОбъект().ДоступныеМодули();
	
	//сткВозврат = Новый Структура;
	//сткВозврат.Вставить("УправлениеПеревозками", Ложь);
	//сткВозврат.Вставить("УправлениеТранспортом", Истина);
	//сткВозврат.Вставить("СпутниковыйМониторинг", Ложь);
	//
	//Возврат сткВозврат;
	
КонецФункции

#КонецОбласти