
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПредупреждатьОбОкончанииСрокаДействияПриИзменении(Элемент)

	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументВыдаетсяПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	// Нет.
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если Объект.СрокДействия = ПредопределенноеЗначение("Перечисление.упСрокДействияДокумента.ФиксированныйСрок") Тогда 
		Элементы.ПериодДействия.Доступность                        = Истина;
		Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность = Истина;
	ИначеЕсли Объект.СрокДействия = ПредопределенноеЗначение("Перечисление.упСрокДействияДокумента.НеограниченныйСрок") Тогда 
		Элементы.ПериодДействия.Доступность                        = Ложь;
		Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность = Ложь;
	Иначе	
		Элементы.ПериодДействия.Доступность                        = Ложь;
		Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность = Истина;
	КонецЕсли;	

	Элементы.ГруппаИнтервалПредупреждения.Доступность = Объект.ПредупреждатьОбОкончанииСрокаДействия И Элементы.ПредупреждатьОбОкончанииСрокаДействия.Доступность;
	Если Объект.ДокументВыдается = ПредопределенноеЗначение("Перечисление.упОбъектДокументовТСВодителей.ТранспортноеСредство") Тогда 
		Элементы.КоличествоТС.Доступность        = Истина;
		Элементы.КоличествоВодителей.Доступность = Ложь;
	ИначеЕсли Объект.ДокументВыдается = ПредопределенноеЗначение("Перечисление.упОбъектДокументовТСВодителей.Водитель") Тогда 
		Элементы.КоличествоТС.Доступность        = Ложь;
		Элементы.КоличествоВодителей.Доступность = Истина;
	ИначеЕсли Объект.ДокументВыдается = ПредопределенноеЗначение("Перечисление.упОбъектДокументовТСВодителей.ТСВодитель") Тогда 
		Элементы.КоличествоТС.Доступность        = Истина;
		Элементы.КоличествоВодителей.Доступность = Истина;
	Иначе	
		Элементы.КоличествоТС.Доступность        = Ложь;
		Элементы.КоличествоВодителей.Доступность = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
