
#Область ВызовИзСКД

// Возвращает строку представления временного периода.
// 
// Параметры:
//  ВременноеОкноНачало - Дата - Период.
//  ВременноеОкноОкончание - Дата - Период.
// 
// Возвращаемое значение:
//   Строка - Результат выполнения.
//
Функция СформироватьПредставлениеВременногоОкнаГлобальный(ВременноеОкноНачало, ВременноеОкноОкончание) Экспорт
	
	ОткрытоеНачало    = (ВременноеОкноНачало = Дата('00010101'));
	ОткрытоеОкончание = (ВременноеОкноОкончание = Дата('00010101'));
	Представление = "";
	Если ОткрытоеНачало И ОткрытоеОкончание Тогда
		Представление = НСтр("ru = 'неизвестно'");
	ИначеЕсли ОткрытоеНачало И Не ОткрытоеОкончание Тогда
		Представление = НСтр(СтрШаблон("ru = 'по %1'", Формат(ВременноеОкноОкончание, "Л=ru_RU; ДФ='dd.MM.yy ЧЧ:mm'")));
	ИначеЕсли Не ОткрытоеНачало И ОткрытоеОкончание Тогда
		Представление = НСтр(СтрШаблон("ru = 'с %1'", Формат(ВременноеОкноНачало, "Л=ru_RU; ДФ='dd.MM.yy ЧЧ:mm'")));
	Иначе
		НачалоДня = НачалоДня(ВременноеОкноНачало);
		Если НачалоДня = НачалоДня(ВременноеОкноОкончание) Тогда
			Представление = НСтр(СтрШаблон("ru = '%1 с %2 по %3'", Формат(НачалоДня, "Л=ru_RU; ДФ='dd.MM.yy'"), 
			                                                       Формат(ВременноеОкноНачало, "Л=ru_RU; ДФ='ЧЧ:mm'"),
			                                                       Формат(ВременноеОкноОкончание, "Л=ru_RU; ДФ='ЧЧ:mm'")));
		Иначе
			Представление = НСтр(СтрШаблон("ru = 'с %1 по %2'", Формат(ВременноеОкноНачало, "Л=ru_RU; ДФ='dd.MM.yy ЧЧ:mm'"), Формат(ВременноеОкноОкончание, "Л=ru_RU; ДФ='dd.MM.yy ЧЧ:mm'")));
		КонецЕсли;
	КонецЕсли;
	
	Возврат Представление;	
	
КонецФункции	

// Функция возвращает представление времени.
//
// Параметры:
//  Время - Дата - Период.
// 
// Возвращаемое значение:
//   Строка - Результат выполнения.
//
Функция СформироватьПредставлениеВремениГлобальный(Время) Экспорт
	
	Возврат упСервисныеФункцииКлиентСервер.СформироватьПредставлениеВремени(Время);
	
КонецФункции

// Функция возвращает представление расстояния.
//
// Параметры:
//  Расстояние - Число - Данные расстояния.
// 
// Возвращаемое значение:
//   Строка - Результат выполнения.
//
Функция СформироватьПредставлениеРасстоянияГлобальный(Расстояние) Экспорт
	
	Возврат упСервисныеФункцииКлиентСервер.СформироватьПредставлениеРасстояния(Расстояние);
	
КонецФункции // СформироватьПредставлениеРасстояния()


#КонецОбласти 

