
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыУправленияРемонтами = Параметры.ПараметрыУправленияРемонтами;
	Если ПараметрыУправленияРемонтами <> Неопределено Тогда 
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ПараметрыУправленияРемонтами);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("СрокОтсчетаСреднесуточногоПробега", СрокОтсчетаСреднесуточногоПробега);
		сткПараметры.Вставить("СпособПланированияРемонтныхРабот" , СпособПланированияРемонтныхРабот);
		сткПараметры.Вставить("СрокПредупрежденияОТОДней"        , СрокПредупрежденияОТОДней);
		сткПараметры.Вставить("СрокПредупрежденияОТОПробег"      , СрокПредупрежденияОТОПробег);
		сткПараметры.Вставить("СрокПредупрежденияОТОМоточасы"    , СрокПредупрежденияОТОМоточасы);
		Закрыть(сткПараметры);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Заполните обязательные настройки!'"));
	КонецЕсли;
	
КонецПроцедуры // ЗавершитьРедактирование()

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры // Отмена()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти 
