#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрытьТекущуюФорму	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НЕ ЗакрытьТекущуюФорму;	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КнопкаВыбратьНажатие(Элемент)
	ВыбраноЗначение();
КонецПроцедуры

&НаКлиенте
Процедура СписокСкладыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбраноЗначение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ВыбраноЗначение()
	ТекущиеДанные = Элементы.СписокСклады.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ОповеститьОВыборе(ТекущиеДанные.Ссылка)
	Иначе
		ОповеститьОВыборе(ПредопределенноеЗначение("Справочник.упСклады.ПустаяСсылка"));
	КонецЕсли;
	сткВозврата =Новый Структура;
	сткВозврата.Вставить("ИмяФормыПерехода", "ФормаВводаЗаправки");
	ЗакрытьТекущуюФорму = Истина;
	Закрыть(сткВозврата);
КонецПроцедуры

	
#КонецОбласти
