#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
		ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
		упРаспределениеРасходов.ЗаполнитьДоходыРасходы(ЭтотОбъект, Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьРасходы(ЗаполнитьРасходыПоРейсам = Истина, ЗаполнитьРасходыПоТС = Истина, ЗаполнитьРасходыФинансовыйРезультат = Истина, сткПараметры = Неопределено) Экспорт
	
	РеквизитыОбъекта = Новый Структура("Дата,
								|ПериодРаспределенияЗатратНачало,
								|ПериодРаспределенияЗатратОкончание,
								|Валюта,
								|СтатьяРасходов, 
								|АналитическийРазрез, 
								|ПравилоРаспределенияПоРейсам, 
								|ПравилоРаспределенияПоТС, 
								|ПравилоРаспределенияНаФинансовыйРезультат, 
								|ПрочиеРасходы, 
								|Организация, 										
								|Подразделение,
								|НаправлениеДеятельности,
								|РасходыПоРейсам,
								|РасходыПоТС,
								|РезультатыФинансовыйРезультат");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	
	ВедетсяВалютныйУчет	   = ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет",                 ВедетсяВалютныйУчет);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоРейсам",            ЗаполнитьРасходыПоРейсам);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыПоТС",                ЗаполнитьРасходыПоТС);
	ДополнительныеСвойства.Вставить("ЗаполнитьРасходыФинансовыйРезультат", ЗаполнитьРасходыФинансовыйРезультат);
	
	Отказ = Ложь;
	упРаспределениеРасходов.РаспределитьПрочиеРасходы(ДополнительныеСвойства, ЭтотОбъект.Ссылка, РеквизитыОбъекта, Отказ, сткПараметры);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	РеквизитыОбъекта = Новый Структура("Дата,
								|Организация,
								|Подразделение,
								|Валюта,
								|СтатьяРасходов");
	
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
	РеквизитыОбъекта.Вставить("НаправлениеДеятельности", Справочники.упНаправленияДеятельности.ПустаяСсылка());
	РеквизитыОбъекта.Вставить("СпособВводаРасходов",     Перечисления.упСпособыВводаФактическихРасходов.РасходыПоНесколькимРейсам);
	РеквизитыОбъекта.Вставить("Дата", ПериодРаспределенияЗатратОкончание);
	

	// Формируются фактические расходы
	упРаспределениеРасходов.СформироватьРасходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	// Формируются прочие расходы.
	упУправлениеЗапасами.СформироватьДвиженияПрочиеРасходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	Движения.Записать();

	// Контроль остатков прочих расходов.
	упРаспределениеРасходов.ПроконтролироватьПрочиеРасходы(ДополнительныеСвойства, Ссылка, РеквизитыОбъекта, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли 