
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокМакетов = Элементы.ИмяМакета.СписокВыбора;
	ЗаполнитьМакетыИзМетаданных(СписокМакетов, Метаданные.Справочники);
	ЗаполнитьМакетыИзМетаданных(СписокМакетов, Метаданные.Документы);
	ЗаполнитьМакетыИзМетаданных(СписокМакетов, Метаданные.Обработки);
	ДобавитьМакетыВСписок(СписокМакетов, Метаданные.ОбщиеМакеты, "ОбщийМакет", НСтр("ru = 'Общий макет'"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьМакетыИзМетаданных(СписокМакетов, КоллекцияМетаданных)
	
	Для Каждого ЭлементОбъектМД Из КоллекцияМетаданных Цикл
		ДобавитьМакетыВСписок(СписокМакетов, ЭлементОбъектМД.Макеты, ЭлементОбъектМД.ПолноеИмя(), ЭлементОбъектМД.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьМакетыВСписок(СписокМакетов, Макеты, ИмяОбъекта, ПредставлениеОбъекта)
	
	Для Каждого ЭлементМакет Из Макеты Цикл
		Если ЭтоПечатнаяФорма(ЭлементМакет.Имя) Тогда
			ИмяМакета = СокрЛП(ИмяОбъекта) + "." + СокрЛП(ЭлементМакет.Имя);
			ПредставлениеМакета = СокрЛП(ЭлементМакет.Синоним) + " (" + СокрЛП(ПредставлениеОбъекта) + ")";
			СписокМакетов.Добавить(ИмяМакета, ПредставлениеМакета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПечатнаяФорма(ИмяМакета)
	
	Возврат 0 < Найти(ИмяМакета, "ПФ_MXL");
	
КонецФункции

#КонецОбласти