#Область ОбработчикиСобытийФормы
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ЗаполнитьНаименование()
	Объект.Наименование = ПолучитьНаименование();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНаименование() Экспорт

	Возврат ПолучитьНаименованиеНаСервере(Объект.Номер, Объект.Дата);
		
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНаименованиеНаСервере(Номер, Дата)
	Возврат Справочники.упЭкземплярыДокументов.ПолучитьНаименование(Номер, Дата);
КонецФункции

#КонецОбласти
