
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// +++.17/06/05-11:25:00.<УП>
	Если ВидФормы = "ФормаЗаписи" И сшпФункциональныеОпции.ТипОбмена() = Перечисления.упТипОбмена.Web Тогда 
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаЗаписиДоступная";
	КонецЕсли;		
	// ---.17/06/05-11:25:00.<УП>
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли


