
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЖурналОшибок(Команда)
	
	ОтборПоУровню = Новый СписокЗначений;
	ОтборПоУровню.Добавить("Ошибка", "Ошибка");
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Уровень", ОтборПоУровню);
	// ПараметрыФормы.Вставить("Событие", "упСобытия_ОбработатьСобытие");
	ПараметрыФормы.Вставить("Данные", Запись.ДокументОснование);
	ПараметрыФормы.Вставить("ДатаНачала", Запись.ДатаНачалаОбработки);
	ПараметрыФормы.Вставить("ДатаОкончания", Запись.ДатаОтработки);
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма", ПараметрыФормы);
	Закрыть();

КонецПроцедуры
	
#КонецОбласти