
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЗадания = Параметры.ИдентификаторЗадания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьПроцентВыполнения", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПроцентВыполнения()
	
	ВсеЗаданияВыполнены = Истина;
	ВсеЗаданияВыполнены = ОбновитьИндикаторыВыполненияФоновыхЗаданийНаСервере();
	
	Если ВсеЗаданияВыполнены Тогда 
		ОтключитьОбработчикОжидания("ОбновитьПроцентВыполнения");
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьИндикаторыВыполненияФоновыхЗаданийНаСервере()
	
	ЗаданияВыполнены = Ложь;
	
	ОписаниеТиповЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный));
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторЗадания);
	Если Задание = Неопределено Или Задание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда 
		ЗаданияВыполнены = Истина;
		Индикатор = 100;
		
	Иначе
		мсвСообшений = Задание.ПолучитьСообщенияПользователю(Истина);
		Если мсвСообшений <> Неопределено Тогда
			Если мсвСообшений.Количество() Тогда
				Для Каждого текСообщение Из мсвСообшений Цикл
					Текст = текСообщение.Текст;
					Если Лев(Текст, 3) = "###" Тогда 
						КоличествоВыполнено = ОписаниеТиповЧисло.ПривестиЗначение(СтрЗаменить(Текст, "###", ""));
						Индикатор = Макс(Индикатор, КоличествоВыполнено);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаданияВыполнены Тогда
		ФоновыеЗадания.ОжидатьЗавершения(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Задание), 1000);
	КонецЕсли;
	
	Возврат ЗаданияВыполнены;
	
КонецФункции

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры

#КонецОбласти 
