#Область ПрограммныйИнтерфейс

#Область ФормированиеДвижений

// Процедура формирует записи по регистру "упОперацииСистемыПлатон"
//
// Параметры:
//  ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на объект.
//	Движения - КоллекцияДвижений - Коллекция движений документа.
//	Реквизиты - Структура - Реквизиты объект.
//	Отказ - Булево - выполнить фиксирование изменений.
//
Процедура СформироватьДвиженияОперацииСистемыПлатон(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
			
	ДвиженияОперацииСистемыПлатон = Движения.упОперацииСистемыПлатон;
	ДвиженияОперацииСистемыПлатон.Записывать = Истина;

	ДвижениеОперацииСистемыПлатон	= ДвиженияОперацииСистемыПлатон.Добавить();
	ЗаполнитьЗначенияСвойств(ДвижениеОперацииСистемыПлатон, Реквизиты);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
