
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГрафикРаботы = Параметры.ГрафикРаботы;
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода = Параметры.КонецПериода;
	Если Параметры.Свойство("ЦветФона") Тогда
		Элементы.СписокВременныхОкон.ЦветФона = Параметры.ЦветФона;
		//Если Параметры.ПараметрЦветаФона = 0 Тогда
		//	Элементы.СписокВременныхОкон.ЦветФона = Метаданные.ЭлементыСтиля.упЦветФонаГруппыОтправления.Значение;
		//ИначеЕсли Параметры.ПараметрЦветаФона = 1 Тогда
		//	Элементы.СписокВременныхОкон.ЦветФона = Метаданные.ЭлементыСтиля.упЦветФонаГруппыПолучения.Значение;
		//КонецЕсли;
	КонецЕсли;
	СписокВременныхОкон.Загрузить(Обработки.упИнтерфейсУправленияВременем.ПолучитьВременныеОкнаДоступности(ГрафикРаботы, НачалоПериода, КонецПериода));
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВременныхОконВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	текСтрока = СписокВременныхОкон.НайтиПоИдентификатору(Значение);
	Если текСтрока <> Неопределено Тогда
		сткВозврат = Новый Структура("НачалоПериода, КонецПериода");
		ЗаполнитьЗначенияСвойств(сткВозврат, текСтрока);
		Закрыть(сткВозврат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти 