#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Не ОбменДанными.Загрузка Тогда
		ТаблицаНабора = ЭтотОбъект.Выгрузить();
		
		// очищаем зеркала старых строк
		ЭтотОбъект.Прочитать();
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			ЗеркальныйНаборЗаписей = РегистрыСведений.упНесовместимыеВидыНоменклатуры.СоздатьНаборЗаписей();
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры1.Установить(СтрокаНабора.ВидНоменклатуры2);
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры2.Установить(СтрокаНабора.ВидНоменклатуры1);
			ЗеркальныйНаборЗаписей.Отбор.Партнер.Установить(СтрокаНабора.Партнер);
			ЗеркальныйНаборЗаписей.ОбменДанными.Загрузка = Истина;
			ЗеркальныйНаборЗаписей.Записать();
		КонецЦикла;
		
		// добавляем зеркала новых строк
		ЭтотОбъект.Загрузить(ТаблицаНабора);
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			ЗеркальныйНаборЗаписей = РегистрыСведений.упНесовместимыеВидыНоменклатуры.СоздатьНаборЗаписей();
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры1.Установить(СтрокаНабора.ВидНоменклатуры2);
			ЗеркальныйНаборЗаписей.Отбор.ВидНоменклатуры2.Установить(СтрокаНабора.ВидНоменклатуры1);
			ЗеркальныйНаборЗаписей.Отбор.Партнер.Установить(СтрокаНабора.Партнер);
			ЗеркальнаяСтрока = ЗеркальныйНаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗеркальнаяСтрока, СтрокаНабора); 
			ЗеркальнаяСтрока.ВидНоменклатуры1 = СтрокаНабора.ВидНоменклатуры2;
			ЗеркальнаяСтрока.ВидНоменклатуры2 = СтрокаНабора.ВидНоменклатуры1;
			ЗеркальнаяСтрока.Партнер = СтрокаНабора.Партнер;
			ЗеркальныйНаборЗаписей.ОбменДанными.Загрузка = Истина;
			ЗеркальныйНаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли; 
	

КонецПроцедуры
#КонецОбласти