
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РеквизитыОбъекта = Новый Структура();
	РеквизитыОбъекта.Вставить("Организация", 		Организация);
	РеквизитыОбъекта.Вставить("Подразделение", 		Подразделение);
	РеквизитыОбъекта.Вставить("СтатьяРасходов", 		СтатьяРасходов);
	РеквизитыОбъекта.Вставить("НачалоПериода", 		НачалоПериода);
	РеквизитыОбъекта.Вставить("АналитическийРазрез", 	АналитическийРазрез);
	РеквизитыОбъекта.Вставить("НаправлениеДеятельности", 	НаправлениеДеятельности);
	РеквизитыОбъекта.Вставить("Валюта", 			Валюта);
	РеквизитыОбъекта.Вставить("Сумма", 			Сумма);
	РеквизитыОбъекта.Вставить("СуммаНДС", 			СуммаНДС);
	РеквизитыОбъекта.Вставить("СуммаВалюта", 		СуммаВалюта);
	РеквизитыОбъекта.Вставить("СуммаВалютаНДС", 		СуммаВалютаНДС);
	
	ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
	ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
	ДополнительныеСвойства.Вставить("ПрочиеРасходы", ПрочиеРасходы.Выгрузить());
	ДополнительныеСвойства.Вставить("РезультатРаспределения", РезультатыРаспределения.Выгрузить());
	
	// Формируются движения по регистру "Прочие расходы"
	упРаспределениеРасходов.СформироватьРасходыБудущихПериодов(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
	
#КонецЕсли