
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	сткПараметры = Новый Структура;
	сткПараметры.Вставить("ВидТранспортнойУслуги", ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.ОперацииСКонтейнерами"));
	
	ОткрытьФорму("Обработка.упРМПланированиеРейсов.Форма", сткПараметры, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти