
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокСсылок = Новый СписокЗначений;
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Водитель);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.ВодительЭкспедитор);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Врач);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Курьер);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Логист);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Механик);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Оператор);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Прочее);
	СписокСсылок.Добавить(Перечисления.упТипыСотрудников.Экспедитор);
	Если ПолучитьФункциональнуюОпцию("упВедетсяРаботаЧерезТорговыхПредставителей") Тогда
		СписокСсылок.Добавить(Перечисления.упТипыСотрудников.ТорговыйПредставитель);
	КонецЕсли;
	СписокИсключений = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТипыСотрудников.Ссылка
	|ИЗ
	|	Перечисление.упТипыСотрудников КАК ТипыСотрудников
	|ГДЕ
	|	ТипыСотрудников.Ссылка В(&Список)
	|	И НЕ ТипыСотрудников.Ссылка В (&СписокИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыСотрудников.Порядок";
	Запрос.УстановитьПараметр("Список",           СписокСсылок);
	Запрос.УстановитьПараметр("СписокИсключений", СписокИсключений);
	
	ДанныеВыбора = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти