#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Не ОбменДанными.Загрузка Тогда
		ТаблицаНабора = ЭтотОбъект.Выгрузить();
		
		// очищаем зеркала старых строк
		ЭтотОбъект.Прочитать();
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			ЗеркальныйНаборЗаписей = РегистрыСведений.упЗональныеНастройкиМаршрутизации.СоздатьНаборЗаписей();
			ЗеркальныйНаборЗаписей.Отбор.ЗонаПолучения.Установить(СтрокаНабора.ЗонаОтправления);
			ЗеркальныйНаборЗаписей.Отбор.ЗонаОтправления.Установить(СтрокаНабора.ЗонаПолучения);
			ЗеркальныйНаборЗаписей.ОбменДанными.Загрузка = Истина;
			ЗеркальныйНаборЗаписей.Записать();
		КонецЦикла;
		
		// добавляем зеркала новых строк
		ЭтотОбъект.Загрузить(ТаблицаНабора);
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			Если СтрокаНабора.ЗонаОтправления = СтрокаНабора.ЗонаПолучения Тогда
				Продолжить;
			КонецЕсли; 
			ЗеркальныйНаборЗаписей = РегистрыСведений.упЗональныеНастройкиМаршрутизации.СоздатьНаборЗаписей();
			ЗеркальныйНаборЗаписей.Отбор.ЗонаПолучения.Установить(СтрокаНабора.ЗонаОтправления);
			ЗеркальныйНаборЗаписей.Отбор.ЗонаОтправления.Установить(СтрокаНабора.ЗонаПолучения);
			ЗеркальнаяСтрока = ЗеркальныйНаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗеркальнаяСтрока, СтрокаНабора); 
			ЗеркальнаяСтрока.ЗонаПолучения = СтрокаНабора.ЗонаОтправления;
			ЗеркальнаяСтрока.ЗонаОтправления = СтрокаНабора.ЗонаПолучения;
			ЗеркальныйНаборЗаписей.ОбменДанными.Загрузка = Истина;
			ЗеркальныйНаборЗаписей.Записать();
		КонецЦикла;
		
		// Запрещаем удаление строки с пустыми измерениями
		// Пришлось отключить из-за того, что менеджер записи сначала делает удаление
		//Если Ложь
		//	Или (Истина
		//		И Отбор.ЗонаОтправления.Использование
		//		И Не Отбор.ЗонаПолучения.Использование
		//		И Не ЗначениеЗаполнено(Отбор.ЗонаОтправления.Значение))
		//	Или (Истина
		//		И Отбор.ЗонаПолучения.Использование
		//		И Не Отбор.ЗонаОтправления.Использование
		//		И Не ЗначениеЗаполнено(Отбор.ЗонаПолучения.Значение)) 
		//	Или (Истина
		//		И Отбор.ЗонаПолучения.Использование
		//		И Отбор.ЗонаОтправления.Использование
		//		И Не ЗначениеЗаполнено(Отбор.ЗонаПолучения.Значение) 
		//		И Не ЗначениеЗаполнено(Отбор.ЗонаОтправления.Значение)) 
		//	И ЭтотОбъект.Выгрузить().НайтиСтроки(Новый Структура("ЗонаОтправления, ЗонаПолучения", Справочники.упГеографическиеЗоны.ПустаяСсылка(), Справочники.упГеографическиеЗоны.ПустаяСсылка())).Количество() = 0
		//Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нельзя удалять строку с пустыми зонами отправления и получения'"),,,, Отказ);
		//КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти