#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность()
	УстановитьДоступностьСуммированныйУчет();
	УстановитьДоступностьНесколькоВодителей();
КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьДоступностьСуммированныйУчет()
	//Элементы.ПродолжительностьРабочегоВремениОднаНеделя.Доступность = Объект.ВестиСуммированныйУчет;
	Элементы.ПродолжительностьРабочегоВремениДвеНедели.Доступность 	= Объект.ВестиСуммированныйУчет;
КонецПроцедуры

Процедура УстановитьДоступностьНесколькоВодителей()
	//Элементы.ПродолжительностьРабочегоВремениДень.Доступность = НЕ Объект.НесколькоВодителей;
	//Элементы.ПерерывОбедОтдыхКоличество.Доступность = НЕ Объект.НесколькоВодителей;
КонецПроцедуры

&НаКлиенте
Функция РассчитатьКоличествоОбеденныхПерерывов()
	
	ДлительностьДня 	= Объект.ПродолжительностьРабочегоВремениДеньЧ*60;
	ПериодичностьОбед 	= Объект.ПерерывОбедОтдыхПериодичностьЧ*60;
	ДлительностьОбед 	= Объект.ПерерывОбедОтдыхПродолжительностьМ;
	НовыйОбед = ПериодичностьОбед;
	
	нКоличество = 0;
	
	Для нСчетчик = 1 По ДлительностьДня Цикл
		Если нСчетчик = НовыйОбед Тогда
			нКоличество = нКоличество + 1;
			НовыйОбед = (НовыйОбед+ДлительностьОбед) + ПериодичностьОбед;
		КонецЕсли;
	КонецЦикла;
	
	Возврат нКоличество;
	
КонецФункции

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ВестиСуммированныйУчетПриИзменении(Элемент)
	Если НЕ Объект.ВестиСуммированныйУчет Тогда
		Объект.ПродолжительностьРабочегоВремениОднаНеделяЧ 	= 0;
		Объект.ПродолжительностьРабочегоВремениДвеНеделиЧ 	= 0;
	КонецЕсли;
	УстановитьДоступностьСуммированныйУчет();
КонецПроцедуры

&НаКлиенте
Процедура НесколькоВодителейПриИзменении(Элемент)
	Если Объект.НесколькоВодителей Тогда
		Объект.ПродолжительностьРабочегоВремениДеньЧ = 24;
		Объект.ПерерывОбедОтдыхКоличество = РассчитатьКоличествоОбеденныхПерерывов();
	КонецЕсли;
	УстановитьДоступностьНесколькоВодителей();
КонецПроцедуры

&НаКлиенте
Процедура ПерерывОбедОтдыхПериодичностьПриИзменении(Элемент)
	Если Объект.НесколькоВодителей Тогда
		Объект.ПерерывОбедОтдыхКоличество = РассчитатьКоличествоОбеденныхПерерывов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	упСервисныеФункцииКлиентСервер.УстановитьКартинкуКомментария(Элементы.ГруппаДополнительно, Объект.Комментарий);
КонецПроцедуры

#КонецОбласти