#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мсвДанные = Неопределено;
	Если Параметры.Свойство("ГСМ", мсвДанные) Тогда
		Для каждого Строка Из мсвДанные  Цикл
			НоваяСтрока = ТаблицаСопоставленияГСМ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьДанные(Истина);
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ЗаписатьДанные(ЗакрытьФорму = Ложь)
	
	Если ЗакрытьФорму Тогда
		Закрыть(ТаблицаСопоставлений());
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ТаблицаСопоставлений()
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаСопоставленияГСМ.Выгрузить());
КонецФункции

#КонецОбласти
