#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЭтотОбъект.Значение Тогда
		ИспользуетсяУправлениеПеревозками = упСервисныеФункции.ПолучитьЗначениеКонстанты("упИспользуетсяГлобальнаяПодсистемаУправлениеПеревозками");
		
		Если Не ИспользуетсяУправлениеПеревозками Тогда
			Константы.упУказываютсяФактическиеРасходыПоРейсу.Установить(Ложь);
			Константы.упВестиУчетРасчетовСЗаказчиками.Установить(Ложь);
			Константы.упИспользуетсяЗагрузкаДанныхИзСистемыПлатон.Установить(Ложь);
			Константы.упВедетсяВалютныйУчет.Установить(Ложь);
			Константы.упИспользоватьВиртуальныеТранспортныеСредства.Установить(Ложь);
			Константы.упИспользуютсяДополнительныеСотрудникиВРейсе.Установить(Ложь);
			Константы.упИспользуетсяУчетДорожныхПроисшествий.Установить(Ложь);
			Константы.упИспользуетсяУчетШтрафов.Установить(Ложь);
			Константы.упРазрешитьВыпискуОдногоПутевогоЛистаНаНесколькоРейсов.Установить(Ложь);
			Константы.упИспользуетсяЗагрузкаДанныхИзФайловТахографа.Установить(Ложь);
			Константы.упИспользуетсяЗагрузкаДанныхОтТопливныхКомпаний.Установить(Ложь);
			Константы.упИспользуетсяУчетПодразделений.Установить(Ложь);
			Константы.упИспользуетсяУчетДополнительногоОборудования.Установить(Ложь);
			Константы.упИспользуетсяУчетРасходовНаТС.Установить(Ложь);
			Константы.упИспользуютсяИндивидуальныеГрафикиРаботыСотрудников.Установить(Ложь);
		КонецЕсли;
		
		Константы.упИспользуютсяРемонтыИТОТС.Установить(Ложь);
		Константы.упИспользуетсяУчетГСМ.Установить(Ложь);
		Константы.упИспользуютсяЛимитыРасходаГСМ.Установить(Ложь);
		Константы.упИспользуетсяУчетПутевыхЛистов.Установить(Ложь);
		Константы.упИспользуетсяУчетШинУзловИАгрегатов.Установить(Ложь);
		Константы.упИспользуетсяУчетГСМ.Установить(Ложь);
		Константы.упВедетсяУчетДокументовТранспортныхСредствВодителей.Установить(Ложь);
		Константы.упИспользуетсяУчетМатериалов.Установить(Ложь);
		Константы.упВестиОтдельныйУчетПоказанийОдометровТранспортныхСредств.Установить(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
