
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Рейс) Тогда
		Маршрут.Параметры.УстановитьЗначениеПараметра("Рейс", Параметры.Рейс);
	Иначе	
	    Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
Процедура МаршрутВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	текДанные	= Элемент.ТекущиеДанные;
	Закрыть(Новый Структура("АдресТочки, ИдентификаторТочки, НомерСтроки", текДанные.Адрес, текДанные.Идентификатор, текДанные.СтрокаНомер));
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 
