
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОшибки = "";
	Отказ = Ложь;
	
	ПараметрыФормы = Новый Структура("Ключ", ПараметрКоманды);
	СтатусДокумента = ПредопределенноеЗначение("Перечисление.упСтатусыПутевогоЛиста.Возвращен");
	РезультатПроверки = ПолучитьФорму("Документ.упПутевойЛист.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка).ПолучитьРезультатПроверкиФормы(СтатусДокумента);
	
	Отказ = РезультатПроверки.Отказ;
	ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
	
	Если НЕ Отказ Тогда		
		ВернутьПутевойЛистНаСервере(ПараметрКоманды, ОписаниеОшибки, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Путевой лист успешно возвращен.'"),, ОписаниеОшибки, БиблиотекаКартинок.Успешно32);			
		Оповестить("ИзменилсяСтатус", ,ПараметрКоманды);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Путевой лист не возвращен.'"),, ОписаниеОшибки, БиблиотекаКартинок.Ошибка32);			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВернутьПутевойЛистНаСервере(ПутевойЛист, ОписаниеОшибки, Отказ)
	упПутевойЛистУчетГСМ.ВернутьПутевойЛист(ПутевойЛист, ОписаниеОшибки, Отказ);
КонецПроцедуры

#КонецОбласти 