#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ДоступныеТипыТС.Свернуть("ТипТС", "КоличествоМакс");
	Если Не ЗначениеЗаполнено(ДоступныеРесурсы) Тогда
		ЭтотОбъект.ДоступныеРесурсы = Справочники.упПравилаДоступностиРесурсов.ДоступныВсе;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Справочники.упПартнеры.ЗаписатьИерархиюПартнера(Ссылка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли




