#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЭтотОбъект.Значение Тогда
		Константы.упИспользуетсяАндроидКлиент.Установить(Ложь);
		Константы.упИспользуетсяУчетДорожныхПроисшествий.Установить(Ложь);
		Константы.упОпределятьАвтоматическиНаправлениеДвиженияТранспортногоСредства.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
