
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.упТранспортныеСредства);
    Элементы.ФормаГрупповоеИзменениеОбъектов.Видимость = МожноРедактировать;
	Если ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.ВнешниеПользователи") Тогда
		текПользователь = Справочники.Пользователи.ПустаяСсылка();
	Иначе
		текПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", текПользователь);
	Справочники.упТранспортныеСредства.ДобавитьУсловноеОформлениеКолонкиСостояниеТС(Список);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
// Процедура - обработчик команды "ГрупповоеИзменениеОбъектов".
//
Процедура ГрупповоеИзменениеОбъектов(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры // ГрупповоеИзменениеОбъектов()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти 
