
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Процедура проверяет корректность заполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЗначениеЗаполнено(ПрефиксШтрихкода) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	упТипыРегламентныхДокументов.Ссылка
		|ИЗ
		|	Справочник.упТипыРегламентныхДокументов КАК упТипыРегламентныхДокументов
		|ГДЕ
		|	упТипыРегламентныхДокументов.Ссылка <> &Ссылка
		|	И упТипыРегламентныхДокументов.ПрефиксШтрихкода = &ПрефиксШтрихкода";
		Запрос.УстановитьПараметр("Ссылка",           Ссылка);
		Запрос.УстановитьПараметр("ПрефиксШтрихкода", ПрефиксШтрихкода);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Данный префикс штрихкода назначен другому типу документов - %1'"), Выборка.Ссылка), Ссылка,, "Объект.ПрефиксШтрихкода", Отказ);
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли