
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор"                          , Новый Структура("ЗаявкаНаПеревозкуГруза", ПараметрКоманды));
	ПараметрыФормы.Вставить("КлючВарианта"                   , "СоставГрузаПоЗаявкеНаПеревозкуКонтекст");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии"        , Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОткрытьФорму("Отчет.упСоставГрузовыхМестПоЗаявкеНаПеревозку.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		"ЗаявкаНаПеревозкуГруза=" + ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти