#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТранспортноеСредство = Неопределено;
	ЭтоПрицеп = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ЭтоПрицеп", Ложь);
	
	Если НЕ ЭтоПрицеп Тогда
		ТранспортноеСредство = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "ТранспортноеСредство");
		Если ТранспортноеСредство <> Неопределено Тогда
			ЭтоПрицеп = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТранспортноеСредство, "Прицеп");
		КонецЕсли;
	КонецЕсли;

	Если ЭтоПрицеп Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"
		|ВЫБРАТЬ
		|	упСпособыРасчетаНадбавокГСМ.Ссылка КАК Ссылка
		|ИЗ
		|	Перечисление.упСпособыРасчетаНадбавокГСМ КАК упСпособыРасчетаНадбавокГСМ
		|ГДЕ упСпособыРасчетаНадбавокГСМ.Ссылка <> ЗНАЧЕНИЕ(Перечисление.упСпособыРасчетаНадбавокГСМ.РасходВЛитрахЗаОперацию)
		|";

		Выборка = Запрос.Выполнить().Выбрать();
		ДанныеВыбора = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка);	
		КонецЦикла; 
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
