
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Рейс 		= Параметры.Рейс;
	Водитель	= Параметры.Водитель;
	тбзЗаявкиНаПеревозкуГруза = Документы.упРейс.ПолучитьСписокЗаявокНаПеревозкуГрузаПоРейсу(Параметры.Рейс);
	Для каждого текСтрока Из тбзЗаявкиНаПеревозкуГруза Цикл
		текСтрокаСписка = Список.Добавить();
		ЗаполнитьЗначенияСвойств(текСтрокаСписка, текСтрока);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого текСтрока Из Список Цикл
		текСтрока.Флаг = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого текСтрока Из Список Цикл
		текСтрока.Флаг = Ложь;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетыИнкассатора(Команда)
	
	ТекстОшибки = "";
	Отказ = Ложь;
	мсвОтчетыИнкассаторов = СформироватьОтчетыИнкассатораНаСервере(ТекстОшибки, Отказ);
	сткВозврата = Новый Структура("ТекстОшибки, Отказ, мсвОтчетыИнкассаторов",ТекстОшибки, Отказ, мсвОтчетыИнкассаторов);
	Оповестить("СформированыОтчетыИнкассаторов", сткВозврата);
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция СформироватьОтчетыИнкассатораНаСервере(ТекстОшибки, Отказ)
	
	тбзЗаявки = Список.Выгрузить(Новый Структура("Флаг", Истина));
	Возврат Документы.упРейс.СформироватьОтчетыИнкассатора(тбзЗаявки.ВыгрузитьКолонку("Ссылка"), Рейс, Водитель, ТекстОшибки, Отказ);
	
КонецФункции

#КонецОбласти