
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
		Кнопки =РежимДиалогаВопрос.ОКОтмена;
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("МассивДокументов", ПараметрКоманды);
		СтруктураПараметров.Вставить("Источник", ПараметрыВыполненияКоманды.Источник);
		Оповещение = Новый ОписаниеОповещения("УстановитьСтатусОтмены", ЭтотОбъект, СтруктураПараметров);
		
		ПараметрыФормы = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыФормы.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		ПараметрыФормы.Заголовок = НСтр("ru = 'Исменение статуса'");
		
		Текст = 
		НСтр("ru = 'Установка статуса ""Отменена"",
		|является необратимой операцией.
		|
		|Продолжить?'");
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, Текст, Кнопки, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтмены(Результат, ПараметрКоманды) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Значение = КодВозвратаДиалога.ОК Тогда
			
			упРаботаСоСтатусамиКлиент.УстановитьСтатусДокументам(ПараметрКоманды.МассивДокументов, ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.Отменена"));
			
			Для каждого СсылкаНаЗаявку Из ПараметрКоманды Цикл	
				Структура = Новый Структура("Статус, Ссылка",ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.Отменена"),СсылкаНаЗаявку);
				Оповестить("СменаСтатуса",Структура, ПараметрКоманды.Источник);
			КонецЦикла;
			
		КонецЕсли; // При "Отмена" ничего не делаем.
		
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.упЗаявкаНаРемонтИТОТС"));
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 

