
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ПараметрыФормы = Новый Структура("ПутевойЛист", ПараметрКоманды);	
	//ОткрытьФорму("Обработка.упРМДиспетчераГаража.Форма.ВводДанныхОЗаправке", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ПараметрыФормы = Новый Структура("Ключ", ПараметрКоманды);
	ПараметрыФормы.Вставить("ЗаправкиСливыГСМ",Истина);
	ОткрытьФорму("Документ.упПутевойЛист.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти 