
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
		Кнопки =РежимДиалогаВопрос.ОКОтмена;
		
		Оповещение = Новый ОписаниеОповещения("УстановитьСтатусОтмены", ЭтотОбъект, ПараметрКоманды );
		
		ПараметрыФормы = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыФормы.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		ПараметрыФормы.Заголовок = НСтр("ru = 'Исменение статуса'");
		
		Текст = 
		НСтр("ru = 'Установка статуса ""Отклонена"",
		|является необратимой операцией.
		|
		|Продолжить?'");
		
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, Текст, Кнопки, ПараметрыФормы);

	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусОтмены(Результат, ПараметрКоманды) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Значение = КодВозвратаДиалога.ОК Тогда
			
			упРаботаСоСтатусамиКлиент.УстановитьСтатусДокументам(ПараметрКоманды, ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаТС.Отклонена"));
			
		КонецЕсли; // При "Отмена" ничего не делаем.
		
	КонецЕсли;
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.упЗаявкаНаТС"));
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 

