
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = СокрЛП(ПараметрКоманды)+".csv";
	Фильтр = НСтр("ru = 'Универсальный текстовый формат'; en = 'Comma-Separated Values'")+ "(*.csv)|*.csv|" + НСтр("ru = 'Текстовый файл'; en = 'Text'")+ "(*.txt)|*.txt";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ИмяФайла = ДиалогОткрытияФайла.ПолноеИмяФайла;
		
		ФорматЗаголовкаДляCSV = СохранитьТаблицуВCSVФайл(ИмяФайла,ПараметрКоманды);
		
		ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяФайла,КодировкаТекста.ANSI);            
		ТекстовыйФайлЗапись.ЗаписатьСтроку(ФорматЗаголовкаДляCSV); 
		ТекстовыйФайлЗапись.Закрыть();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция СохранитьТаблицуВCSVФайл(ПолноеИмяФайла,ГеографическаяЗона)
	
	ИнформацияПоКолонкам = ГеографическаяЗона.Полигон.Выгрузить();
	
	ФорматЗаголовкаДляCSV = "";
	Разделитель = Символы.Таб;
	Для каждого ТекущаяКолонка Из ИнформацияПоКолонкам.Колонки Цикл
		ФорматЗаголовкаДляCSV = ФорматЗаголовкаДляCSV + ТекущаяКолонка.Имя + Разделитель;
	КонецЦикла;
	
	ФорматЗаголовкаДляCSV = ФорматЗаголовкаДляCSV + Символы.ПС;
	
	Для каждого тбчСтрока Из ИнформацияПоКолонкам Цикл
		ПредставлениеДолгота = ПредставлениеКоординаты(тбчСтрока.Долгота);
		ПредставлениеШирота = ПредставлениеКоординаты(тбчСтрока.Широта);
		ФорматЗаголовкаДляCSV = ФорматЗаголовкаДляCSV + тбчСтрока.НомерСтроки + Разделитель + ПредставлениеДолгота + Разделитель + ПредставлениеШирота + Символы.ПС;
	КонецЦикла;
	
	Возврат ФорматЗаголовкаДляCSV;
	
	
КонецФункции // СохранитьТаблицуВCSVФайл()

&НаСервере
// Преобразует значение координаты в строку.
//
// Параметры:
//	Координата - число - Координата.
//
// Возвращаемое значение:
//	Строка - представление координаты в формате сервиса.
//
Функция ПредставлениеКоординаты(Координата)
	
	Возврат Формат(Координата, "ЧЦ=9; ЧДЦ=6; ЧРД=.; ЧН=0; ЧГ=");
	
КонецФункции

#КонецОбласти