
#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПросмотрСпискомПриИзменении(Элемент)
	
	УстановитьОтборПоСкладу();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыПриАктивизацииСтроки(Элемент)

	ПодключитьОбработчикОжидания("УстановитьОтборПоСкладуКлиент", 0.3, Истина);
	
КонецПроцедуры // СкладыПриАктивизацииСтроки()

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
// Процедура - обработчик команды "ГрупповоеИзменениеОбъектов"
//
Процедура ГрупповоеИзменениеОбъектов(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры // ГрупповоеИзменениеОбъектов()

#КонецОбласти

#Область СлужебныеПроцедурыФункции



&НаСервере
Процедура УстановитьОтборПоСкладу()
	
	Если Элементы.Склады.ВыделенныеСтроки.Количество() = 1 Тогда 
		ТекущийСклад = Элементы.Склады.ТекущаяСтрока;
		
		//Если ОтображатьАдресаВоВложенныхЗонах Тогда 
		//	ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВИерархии;
		//Иначе	
			ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно;
		//КонецЕсли;	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", ТекущийСклад, ВидСравненияСКД,, Не ПросмотрСписком);
	Иначе 	
		спзСкладов = Новый СписокЗначений;
		спзСкладов.ЗагрузитьЗначения(Элементы.Склады.ВыделенныеСтроки);
	
		//Если ОтображатьАдресаВоВложенныхЗонах Тогда 
		//	ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
		//Иначе	
			ВидСравненияСКД = ВидСравненияКомпоновкиДанных.ВСписке;
		//КонецЕсли;	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Владелец", спзСкладов, ВидСравненияСКД,, Не ПросмотрСписком);
	КонецЕсли;	
		
	Элементы.Склады.Доступность = Не ПросмотрСписком;
	
КонецПроцедуры // УстановитьОтборПоСкладу()

&НаКлиенте
Процедура УстановитьОтборПоСкладуКлиент()
	
	УстановитьОтборПоСкладу();
	
КонецПроцедуры // УстановитьОтборПоСкладуКлиент()

#КонецОбласти


