
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.ЗаполнитьКоллекциюСвойств(Параметры.СписокЗон, СписокЗон);
	Для каждого текЗона Из СписокЗон Цикл
		текЗона.ПометкаНовое = текЗона.Пометка;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Переопределение текущего элемента таблицы формы для изменения активизации поля при первичной загрузке.
	Элементы.СписокЗон.ТекущийЭлемент =  Элементы.СписокЗонЗона;

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокЗонПриАктивизацииПоля(Элемент)
	
	текСтрока = Элементы.СписокЗон.ТекущиеДанные;
	текЭлемент = Элементы.СписокЗон.ТекущийЭлемент;
	Если текЭлемент.Имя = "СписокЗонПометкаНовое" Тогда
		текСтрока.ПометкаНовое = Не текСтрока.ПометкаНовое;
		Модифицированность = Истина;
		// изменяем текущий элемент для возможности его повторной активизации
		Элементы.СписокЗон.ТекущийЭлемент = Элементы.СписокЗонЗона;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
   Закрыть(СписокЗон);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти 