
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Проверка заполнения реквизитов.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не (ВидСобытия = Перечисления.упВидыСобытийМониторинга.СобытиеAndroidКлиента И НастраиваемоеСобытиеAndroidКлиента) Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ИнициирующиеМониторингДействия");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли