#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
 
// Процедура возвращает массив недоступных элементов.
//
// Возвращаемое значение:
//   Массив - Результат выполнения.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	БлокируемыеРеквизиты = Новый Массив;
	
	Для каждого текРек из Метаданные.Справочники.упМоделиТС.Реквизиты цикл
		Если НЕ текРек.Имя = "Комментарий" тогда
			БлокируемыеРеквизиты.Добавить(текРек.Имя);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат БлокируемыеРеквизиты;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Возвращает ссылку на основйно вид ГСМ транспортного средства.
//
// Параметры:
//  ТранспортноеСредство - СправочникСсылка - Ссылка на элемент.
//  ОписаниеОшибки - Строка - Описание.
//  Отказ - Булево - Применить изменения.
//
// Возвращаемое значение:
//   Массив - Результат выполнения.
//
Функция ПолучитьВидГСМПоУмолчанию(ТранспортноеСредство, ОписаниеОшибки, Отказ) Экспорт
	
	текРезультат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упМоделиТСНормыРасходаГСМ.ВидГСМ
	|ИЗ
	|	Справочник.упТранспортныеСредства КАК упТранспортныеСредства
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.упМоделиТС.НормыРасходаГСМ КАК упМоделиТСНормыРасходаГСМ
	|		ПО упТранспортныеСредства.Модель = упМоделиТСНормыРасходаГСМ.Ссылка
	|ГДЕ
	|	упТранспортныеСредства.Ссылка = &ТранспортноеСредство
	|	И упМоделиТСНормыРасходаГСМ.Основной";
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	текВыборка	= Запрос.Выполнить().Выбрать();
	Если текВыборка.Следующий() Тогда
		текРезультат = текВыборка.ВидГСМ;	
	Иначе
		Отказ = Истина;
		ОписаниеОшибки = Нстр("ru = 'Для ТС:%1 не задан основной вид ГСМ'");
		ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ОписаниеОшибки, ТранспортноеСредство);
	КонецЕсли;
	
	
	Возврат текРезультат;
		
КонецФункции

#КонецОбласти

#КонецЕсли