
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидТранспортнойУслуги", Перечисления.упВидыТранспортныхУслуг.ОперацииСКонтейнерами, ВидСравненияКомпоновкиДанных.Равно);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МобильныйКлиент", "Видимость", ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент"));
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Печать
	
	упВводНаОсновании.УстановитьВидимостьКоманд(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СформированыЗаявкиНаТС" Тогда
		Если ТипЗнч(Параметр) = Тип("Массив") Тогда
			Для каждого текЗаявкаНаТС Из Параметр Цикл
				ОткрытьФорму("Документ.упЗаявкаНаТС.ФормаОбъекта", Новый Структура("Ключ", текЗаявкаНаТС), Источник);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СформированыОтчетыИнкассаторов" Тогда
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			текОтказ = Параметр.Отказ;
			Если текОтказ Тогда
				ТекстСообщения = Нстр("ru = 'Для расчета показателя:%1 не задана организация'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, );
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Параметр.ТекстОшибки);														
			КонецЕсли;
			мсвОтчетыИнкассаторов = Параметр.мсвОтчетыИнкассаторов;
			Для каждого текОтчетИнкассатора Из мсвОтчетыИнкассаторов Цикл
				ОткрытьФорму("Документ.упОтчетИнкассатора.Форма.ФормаДокумента", Новый Структура("Ключ", текОтчетИнкассатора), Источник);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);

КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)

	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);

КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

#КонецОбласти