
#Область ОбработчикиСобытийФормы
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	мсвТипыСотрудников = Новый Массив;
	мсвТипыСотрудников.Добавить(ПредопределенноеЗначение("Перечисление.упТипыСотрудников.Водитель"));
	мсвТипыСотрудников.Добавить(ПредопределенноеЗначение("Перечисление.упТипыСотрудников.ВодительЭкспедитор"));
	Отбор = Новый Структура("ТипСотрудника", мсвТипыСотрудников);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Справочник.упСотрудники.ФормаВыбора", ПараметрыФормы, Элемент, УникальныйИдентификатор);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции
	
#КонецОбласти


