#Область ПрограммныйИнтерфейс

// Определить объекты метаданных, в модулях менеджеров которых ограничивается возможность
// редактирования реквизитов с помощью экспортной функции ПолучитьБлокируемыеРеквизитыОбъекта.
//
// Параметры:
//   Объекты - Соответствие - в качестве ключа указать полное имя объекта метаданных,
//               подключенного к подсистеме "Запрет редактирования реквизитов объектов";
//               В качестве значения - пустую строку.
//
// Пример:
//   Объекты.Вставить(Метаданные.Документы.ЗаказПокупателя.ПолноеИмя(), "");
//
// В модулях менеджеров указанных объектов должна быть размещена функция, возвращающая значение:
//  Массив - содержит строки в формате ИмяРеквизита[;ИмяЭлементаФормы,...]
//           где ИмяРеквизита - имя реквизита объекта, ИмяЭлементаФормы - имя элемента формы,
//           связанного с реквизитом.
//  
// Пример функции в модулях менеджеров указанных объектов:
//
//// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
//Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
//	
//	Результат = Новый Массив;
//	Результат.Добавить("Владелец");
//	
//	Возврат Результат;
//	
//КонецФункции
//
Процедура ПриОпределенииОбъектовСЗаблокированнымиРеквизитами(Объекты) Экспорт
	
	//Справочники
	Объекты.Вставить(Метаданные.Справочники.упВидыПеревозок.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упГрузовыеМеста.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упГруппыДоступаПартнеров.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упГруппыТарифов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упДатчики.ПолноеИмя(), "");
	
	Объекты.Вставить(Метаданные.Справочники.упКалибровочныеГрафики.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упНормыРасходаГСМ.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПакетыДокументовТС.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПакетыРегламентныхДокументов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПериодыПланирования.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПравилаДоступностиГеографическихЗон.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПравилаДоступностиРесурсов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПравилаРаспределенияРасходов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПравилаРасчета.ПолноеИмя(), "");
	
	Объекты.Вставить(Метаданные.Справочники.упПроблемы.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упРасписанияПериодическихРейсов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упСхемыМультимодальныхПеревозок.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упТипыГрузов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упТипыСобытий.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упПравилаПодбораПеревозчиковНаРейсы.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упТипыСобытийМониторинга.ПолноеИмя(), "");
	
	Объекты.Вставить(Метаданные.Справочники.упТипыТС.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упМоделиТС.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упТранспортныеСредства.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Справочники.упСотрудники.ПолноеИмя(), "");
	
	//Документы
	Объекты.Вставить(Метаданные.Документы.упУстановкаЗначенийПоказателейРасчета.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Документы.упУстановкаПравилРасчетаДоходовИРасходов.ПолноеИмя(), "");
	Объекты.Вставить(Метаданные.Документы.упДокументТранспортногоСредстваВодителя.ПолноеИмя(), "");	
	Объекты.Вставить(Метаданные.Документы.упЗаправкаСливГСМ.ПолноеИмя(), "");	
	Объекты.Вставить(Метаданные.Документы.упКорректировкаОстатковГСМ.ПолноеИмя(), "");	
	Объекты.Вставить(Метаданные.Документы.упРаспределениеПрочихРасходов.ПолноеИмя(), "");	
	Объекты.Вставить(Метаданные.Документы.упРаспределениеПрямыхРасходов.ПолноеИмя(), "");
	
КонецПроцедуры

#КонецОбласти
