
#Область ПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// +++.13/06/05-11:00:00.<УП>
	ЭтаСтрока = ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент;
	Если ЭтаСтрока = Неопределено Тогда
		ПоказатьОповещениеПользователя("Укажите строку для отмены...");
	ИначеЕсли ТипЗнч(ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент) = ТИП("ТаблицаФормы") Тогда
	// ---.13/06/05-11:00:00.<УП>
	Для Каждого ключЗаписи из ПараметрыВыполненияКоманды.Источник.Элементы.Список.ВыделенныеСтроки цикл
		сшпРаботаСДанными.ОбработатьЗаписьОчереди(ключЗаписи, "ОбработкаОтменена");
	КонецЦикла;
	// +++.13/06/05-11:00:00.<УП>
	КонецЕсли;
	// ---.13/06/05-11:00:00.<УП>
КонецПроцедуры

#КонецОбласти
