
#Область ОбработчикиСобытийФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ЗаполнитьИдентификаторыОбмена(Команда)
	
	ТекстВопроса = НСтр("ru = 'Заполнить регистр сведений идентификации предопределенными значениями?'; en = 'Do you want to continue?'");
	Обработчик = Новый ОписаниеОповещения("ЗаполнитьРегистрИдентификацииЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Обработчик, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура вызывается при ответе на вопрос о необходимости заполнения регистра.
//
Процедура ЗаполнитьРегистрИдентификацииЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда  
		сшпМодульОбработкиДанных.ЗаполнитьРегистрИдентификацииПредопределеннымиЗначениями();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьРегистрИдентификацииЗавершение()

#КонецОбласти 
