
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПараметров = Справочники.упТранспортныеСредства.ПолучитьСписокПараметровОтбора();
	ПараметрыВыбора = Новый Структура;
	Для Каждого ИмяКлюча Из СписокПараметров Цикл
		Если Параметры.Свойство(ИмяКлюча) Тогда
			ЗначениеПараметр = Параметры[ИмяКлюча];
			Если ЗначениеПараметр=Неопределено Тогда
				Продолжить;
			Иначе
				ПараметрыВыбора.Вставить(ИмяКлюча, Параметры[ИмяКлюча]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	УстановитьПараметрыДляФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ЗаписанТранспортноеСредство" Тогда
		Если ТипЗнч(Параметр)=ТИП("Структура") Тогда
			Если Параметр.Свойство("ЭтоНовый") Тогда
				Если Параметр.ЭтоНовый Тогда
					Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
					Список.УсловноеОформление.Элементы.Очистить();
					УстановитьПараметрыДляФормы();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыДляФормы()

	Справочники.упТранспортныеСредства.УстановитьОтборПриВыбореПоПараметрам(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, ПараметрыВыбора);
	Справочники.упТранспортныеСредства.ДобавитьУсловноеОформлениеКолонкиСостояниеТС(Список);

КонецПроцедуры // УстановитьПараметрыДляФормы()

#КонецОбласти 