#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

Функция ДоступныеСтатусыЗаданийДляОснования() Экспорт
	
	Результат = Новый СписокЗначений;
	Результат.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Выполнено);
	Результат.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Выполняется);
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
