
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// контейнеры создаются из отдельного списка
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.ЛегковойАвтомобиль);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.ГрузовойАвтомобиль);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Водный);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Воздушный);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Железнодорожный);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Автобус);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Спецтехника);
	
КонецПроцедуры
