
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор, ЗаголовокФормы", Новый Структура("ТипРасчета",ПредопределенноеЗначение("Перечисление.упТипРасчета.Топливо")), "Шкалы температурных коэффициентов");
	ОткрытьФорму("Справочник.упОценочнаяШкала.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "Топливо", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти 