#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	ЭтаФорма.ПереключательЗапрещенныеМоделиТС 	= ?(Объект.СписокЗапрещенныхМоделейТС, 1, 0);
	ЭтаФорма.ПереключательЗапрещенныеТС 		= ?(Объект.СписокЗапрещенныхТС, 1, 0);
	ЭтаФорма.ПереключательЗапрещенныеВодители 	= ?(Объект.СписокЗапрещенныхВодителей, 1, 0);
		
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
	упСервисныеФункцииКлиентСервер.УстановитьПараметрВыбораПоляФормы(Элементы.ДоступныеВодителиВодитель, "ТипСотрудника", упПравилаДоступностиРесурсов.ПолучитьСписокДоступныхТиповСотрудников());	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		ТолькоПросмотр = Истина;
		Элементы.ПереключательЗапрещенныеВодители.ТолькоПросмотр 	= Истина;
		Элементы.ПереключательЗапрещенныеМодели.ТолькоПросмотр 		= Истина;
		Элементы.ПереключательЗапрещенныеТС.ТолькоПросмотр 			= Истина;
	КонецЕсли;

	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СписокЗапрещенныхМоделейТС 	= ?(ПереключательЗапрещенныеМоделиТС = 1, 	Истина, Ложь);
	Объект.СписокЗапрещенныхТС 			= ?(ПереключательЗапрещенныеТС = 1, 		Истина, Ложь);
	Объект.СписокЗапрещенныхВодителей 	= ?(ПереключательЗапрещенныеВодители = 1, 	Истина, Ложь);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Обработчик подсистемы запрета редактирования реквизитов объектов.
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПереключательЗапрещенныеМоделиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры           

&НаКлиенте
Процедура ПереключательЗапрещенныеТСПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПереключательЗапрещенныеВодителиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область  СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов.
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов.

#КонецОбласти
