// Модуль описания оберток для получения значений функциональных опции. 
// При использовании конфигурации на платформе 8.1 необходимо заменить обращение к функциональным опциям на получение значений одноименных констант.
// Использование функциональных опций позволяет кэшировать наиболее востребованные значения в памяти рабочего потока.

#Область ПрограммныйИнтерфейс

// Функция - Формат сериализации
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпФорматСериализации".
//
Функция ФорматСериализации() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпФорматСериализации");
КонецФункции

// Функция - Использовать СШП
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпИспользоватьСШП".
//
Функция ИспользоватьСШП() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпИспользоватьСШП");
КонецФункции

// Функция - Отключить потоки
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпОтключитьПотоки".
//
Функция ОтключитьПотоки() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпОтключитьПотоки");
КонецФункции

// Функция - Версия обработчиков
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпВерсияОбработчиков".
//
Функция ВерсияОбработчиков() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпВерсияОбработчиков");
КонецФункции

// Функция - Формат сообщения
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпФорматСообщения".
//
Функция ФорматСообщения() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпФорматСообщения");
КонецФункции

// Функция - Адрес адаптера ESB
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпАдресАдаптераESB".
//
Функция АдресАдаптераESB() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпАдресАдаптераESB");
КонецФункции

// Функция - Имя сервиса ESB
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпИмяСервисаESB".
//
Функция ИмяСервисаESB() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпИмяСервисаESB");
КонецФункции

// Функция - Имя точки подключения ESB
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпИмяТочкиПодключенияESB".
//
Функция ИмяТочкиПодключенияESB() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпИмяТочкиПодключенияESB");
КонецФункции

// Функция - Тип используемого коннектора ESB
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпТипИспользуемогоКоннектораESB".
//
Функция ТипИспользуемогоКоннектораESB() экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпТипИспользуемогоКоннектораESB");
КонецФункции

Функция АвтоматическийСтартОбработчиков() Экспорт
	Возврат ПолучитьФункциональнуюОпцию("сшпАвтоматическийСтартОбработчиков");
КонецФункции

#КонецОбласти

#Область УправлениеПеревозками
// +++.17/06/05-11:25:00.<УП>

// Функция - Тип обмена
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "упТипОбмена".
//
Функция ТипОбмена() экспорт
	Возврат ПолучитьФункциональнуюОпцию("упТипОбмена");
КонецФункции

// Функция - Пользователь сервиса
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "упПользовательWebСервиса".
//
Функция ПользовательСервиса() экспорт
	Возврат ПолучитьФункциональнуюОпцию("упПользовательWebСервиса");
КонецФункции

// Функция - Пароль сервиса
//
// Параметры:
// 
// Возвращаемое значение:
//	Значение функциональной опции "упПарольWebСервиса".
//
Функция ПарольСервиса() экспорт
	Возврат ПолучитьФункциональнуюОпцию("упПарольWebСервиса");
КонецФункции

// ---.17/06/05-11:25:00.<УП>
#КонецОбласти
