#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	тбзПеревозчики = Справочники.упПартнеры.ПолучитьСписокПеревозчиков(Параметры.Рейс);
	Для каждого текСтрока Из тбзПеревозчики Цикл
		текСтрокаСписка = Список.Добавить();
		ЗаполнитьЗначенияСвойств(текСтрокаСписка, текСтрока);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьЗаявкиНаТС(Команда)
	
	мсвЗаявкиНаТС = СформироватьЗаявкиНаТСНаСервере();
	Если ОткрытьСформированныеЗаявки Тогда 
		Оповестить("СформированыЗаявкиНаТС", мсвЗаявкиНаТС);
	Иначе	
		Оповестить("СформированыЗаявкиНаТС", Новый Массив);
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	
	Для каждого текСтрока Из Список Цикл
		текСтрока.Флаг = Истина;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для каждого текСтрока Из Список Цикл
		текСтрока.Флаг = Ложь;
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция СформироватьЗаявкиНаТСНаСервере()
	тбзПеревозчики 	= Список.Выгрузить(Новый Структура("Флаг", Истина));
	Возврат Документы.упРейс.СформироватьЗаявкиНаТС(тбзПеревозчики, Параметры.Рейс, Истина);
КонецФункции

#КонецОбласти