
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
		// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
		
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	 УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтображениеВид();
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	УстановитьОтображениеВид();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура ФиксироватьСрокПолезногоИспользованияПриИзменении(Элемент)
	
		
	Если Объект.ФиксироватьСрокПолезногоИспользования Тогда
		Объект.ЭксплуатационнаяНормаКм 		= 0;
		Объект.ЭксплуатационнаяНормаМотоЧасы 	= 0;
		Объект.ИзмерятьНормуВМотоЧасах 		= Ложь;
	Иначе	
		Объект.СрокПолезногоИспользования = 0;
	КонецЕсли;
	
	УстановитьОтображениеВид();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ МЕХАНИЗМА СВОЙСТВ

// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Выполнить установку видимости для реквизитов шин.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//   Нет.
//
Функция УстановитьОтображениеВид()
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.упВидыАгрегатов.Шины") Тогда
		Элементы.грпШина.Видимость = Истина;
	Иначе
		Элементы.грпШина.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.ФиксироватьСрокПолезногоИспользования Тогда
		Элементы.СрокПолезногоИспользования.Видимость 	= Истина;
		Элементы.Группа1.Видимость 					= Ложь;
		Элементы.ИзмерятьНормуВМотоЧасах.Видимость 		= Ложь;
	Иначе	
		Элементы.СрокПолезногоИспользования.Видимость 	= Ложь;
		Элементы.Группа1.Видимость 					= Истина;
		Элементы.ИзмерятьНормуВМотоЧасах.Видимость 		= Истина;	
	КонецЕсли;

КонецФункции // УстановитьОтображениеВид()

&НаКлиенте
Процедура СтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если Объект.ФиксироватьСрокПолезногоИспользования Тогда
		СтандартнаяОбработка = Ложь;
		мсвВариантыРасходов = Новый Массив;
		мсвВариантыРасходов.Добавить(ПредопределенноеЗначение("Перечисление.упВариантыРасходов.Косвенные"));
		мсвВариантыРасходов.Добавить(ПредопределенноеЗначение("Перечисление.упВариантыРасходов.РасходыБудущихПериодов"));
		сткОтбор = Новый Структура("ВариантРасходов", мсвВариантыРасходов);
		сткПараметры = Новый Структура("Отбор", сткОтбор);
		ОткрытьФорму("Справочник.упСтатьиДоходовРасходов.Форма.ФормаСписка", сткПараметры, Элемент, УникальныйИдентификатор);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

