#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстОшибки		= Параметры.ТекстОшибки;
	ЗакрытьТекущуюФорму	= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НЕ ЗакрытьТекущуюФорму;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КнопкаВыходНажатие(Элемент)
	ЗакрытьТекущуюФорму = Истина;
	Закрыть();
КонецПроцедуры

#КонецОбласти
