
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Статус = ПредопределенноеЗначение("Перечисление.упСтатусыЗадачНаОтправкуФайлов.Новая");
		Объект.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		Объект.ВидЗапросаНаОтправкуФайлов = Перечисления.упВидыЗапросовНаОтправкуФайлов.ОтчетПоЗадолженностямВодителя;
		Объект.ИсточникСозданияОбъекта = упСервисныеФункцииКлиентСервер.ИсточникСозданияОбъекта();
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриСозданииПриЧтенииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьДоступность()
	
	Если Объект.Статус = Перечисления.упСтатусыЗадачНаОтправкуФайлов.ФайлОтправлен Тогда
		Элементы.Статус.ТолькоПросмотр = Истина;
		Элементы.Файл.ТолькоПросмотр   = Истина;
		Элементы.Трекер.ТолькоПросмотр = Истина;
	КонецЕсли; 

КонецПроцедуры
 

#КонецОбласти
