
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокПараметров = Справочники.упТипыТС.ПолучитьСписокПараметровОтбора();
	ПараметрыВыбора = Новый Структура;
	Для Каждого ИмяКлюча Из СписокПараметров Цикл
		Если Параметры.Свойство(ИмяКлюча) Тогда
			ЗначениеПараметр = Параметры[ИмяКлюча];
			Если ЗначениеПараметр=Неопределено Тогда
				Продолжить;
			Иначе
				ПараметрыВыбора.Вставить(ИмяКлюча, Параметры[ИмяКлюча]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Параметры.Отбор.Свойство("ВидТранспорта") Тогда
		ПараметрыВыбора.Вставить("ВидТранспорта", Параметры.Отбор.ВидТранспорта);
	КонецЕсли;
	УстановитьПараметрыДляФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия="ЗаписанТипТС" Тогда
		Если ТипЗнч(Параметр)=ТИП("Структура") Тогда
			Если Параметр.Свойство("ЭтоНовый") Тогда
				Если Параметр.ЭтоНовый Тогда
					Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
					УстановитьПараметрыДляФормы();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыДляФормы()

	Если ЗначениеЗаполнено(ПараметрыВыбора.ВидПеревозки) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Справочники.упТипыТС.ПолучитьДоступныеТипыТС(ПараметрыВыбора), ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	Если Не ПараметрыВыбора.Свойство("ВидТранспорта") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидТранспорта", Перечисления.упВидыТранспорта.Контейнер, ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;

КонецПроцедуры // УстановитьПараметрыДляФормы()

#КонецОбласти 