#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЧасовойПоясСеанса = упСервисныеФункции.ТекущийЧасовойПояс();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьЧасовойПояс(Команда)
	УстановитьЧасовойПоясСеансаНаСервере();
	СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения(Ложь);
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьЧасовойПоясСеансаНаСервере()
	мсвПараметров = Новый Массив;
	мсвПараметров.Добавить("упЧасовойПояс");
	упСервисныеФункции.УстановкаПараметровСеанса(мсвПараметров, ЧасовойПоясСеанса);
КонецПроцедуры

#КонецОбласти
