
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ТипИсходногоДействия = Неопределено;
	Если Параметры.Отбор.Свойство("ТипИсходногоДействия", ТипИсходногоДействия) Тогда 
		СтандартнаяОбработка = Ложь;
		
		СписокСсылок = Новый СписокЗначений;
		СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Пользователь);
		СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.ГруппаПользователей);	
		СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Строка);
		Если ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьРейса")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаРейса")  Тогда
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Автор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Организация);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаданияНаПеревозкуГруза") 
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаданияНаПеревозку")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьЗаявкиНаПеревозкуГруза")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаПеревозку") Тогда				
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Автор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоОтправителя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоПолучателя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Организация);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Отправитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Получатель);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПрохождениеТочки") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоОтправителя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоПолучателя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Отправитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Получатель);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПодтвержденияЗаявкиНаТС") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаЗаявкиНаТС") Тогда 	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПредложенияПеревозчика") Тогда 
			//СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			//СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьПутевогоЛиста")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеСтатусаПутевогоЛиста") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);	
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Организация);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ЗаписьСобытияМониторинга") Тогда 
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Автор);
		ИначеЕсли ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеМаршрутаПоРейсу")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеРаботПоРейсу")
			ИЛИ ТипИсходногоДействия = ПредопределенноеЗначение("Перечисление.упТипыДействийСобытий.ИзменениеЭкипажаПоРейсу") Тогда 
			
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Перевозчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Заказчик);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоЗаказчика);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоОтправителя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.КонтактноеЛицоПолучателя);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Отправитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Получатель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Водитель);
			СписокСсылок.Добавить(Перечисления.упВидыПолучателейСообщений.Экспедитор);
			
		КонецЕсли;
		
		ДанныеВыбора = СписокСсылок;
		
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти