
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПорядокИсполненияЗаявки = ПорядокИсполненияЗаявки(ПараметрКоманды);
	
	Если ПорядокИсполненияЗаявки = ПредопределенноеЗначение("Перечисление.упПорядокИсполненияЗаявок.ПутевымЛистом") Тогда
		
		ОписаниеОшибки = "";
		Отказ = Ложь;
		ПутевойЛист = СформироватьПутевойЛистНаСервере(ПараметрКоманды, Отказ);
		
		Если НЕ Отказ Тогда
			ПараметрыФормы = Новый Структура("Ключ", ПутевойЛист);
			ОткрытьФорму("Документ.упПутевойЛист.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
		Иначе
			ТекстОшибки = НСтр("ru = 'Путевой лист не сформирован.'");
			упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
		КонецЕсли;
	Иначе	
		
		ОписаниеОшибки = Нстр("ru = 'Запрещено формировать путевой лист по заявке с порядком исполнения ""рейсом""'");
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ОписаниеОшибки, Истина);	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПутевойЛистНаСервере(мсвЗаявкиНаПеревозкуГруза, Отказ)
	ПутевойЛист = упПутевойЛистУчетГСМ.СформироватьПутевойЛистПоЗаявкамНаПеревозкуГрузов(мсвЗаявкиНаПеревозкуГруза, , ,Отказ);
	Возврат ПутевойЛист;
КонецФункции

&НаСервере
Функция ПорядокИсполненияЗаявки(мсвЗаявок)
	
	ствПорядкиИсполнения = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(мсвЗаявок, "ПорядокИсполненияЗаявки");
	
	Результат = Перечисления.упПорядокИсполненияЗаявок.ПутевымЛистом;
	
	Для каждого ПорядкиИсполнения Из ствПорядкиИсполнения Цикл
		Если ПорядкиИсполнения.Значение = Перечисления.упПорядокИсполненияЗаявок.Рейсом Тогда
			Результат = Перечисления.упПорядокИсполненияЗаявок.Рейсом;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции

#КонецОбласти 
