#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ИспользуетсяУчетДополнительногоОборудования 	= ПолучитьФункциональнуюОпцию("упИспользуетсяУчетДополнительногоОборудования");
	ИспользуетсяУчетШинУзловИАгрегатов			= ПолучитьФункциональнуюОпцию("упИспользуетсяУчетШинУзловИАгрегатов");
	
	ШаблонПредставления = Нстр("ru = '%1 %2 от %3'");
	КомментарийТипаОперации = "";
	ИндексТипаОперации = Перечисления.упТипыОперацийВводаНачальныхОстатков.Индекс(Данные.ТипОперацииВводаНачальныхОстатков);
	Если ИндексТипаОперации <> -1 Тогда
		КомментарийТипаОперации = Данные.ТипОперацииВводаНачальныхОстатков.Метаданные().ЗначенияПеречисления.Получить(ИндексТипаОперации).Комментарий;	
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(КомментарийТипаОперации) Тогда
		КомментарийТипаОперации = Нстр("ru = 'Ввод начальных остатков'")
	КонецЕсли;
	Представление = СтрШаблон(ШаблонПредставления, КомментарийТипаОперации, Данные.Номер, Данные.Дата);
	
	СтандартнаяОбработка = Ложь;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ТипОперацииВводаНачальныхОстатков");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами.
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
    Результат = Новый Массив;
    Результат.Добавить("Организация");
    Результат.Добавить("Склад");
    Результат.Добавить("Валюта");
    Возврат Результат;
КонецФункции

#КонецОбласти

#Область Проведение

// Заполнение дополнительных свойств документа.
//
Процедура ИнициализироватьДанныеДокумента(ДокументОбъект, ДополнительныеСвойства) Экспорт
	
	ИмяТабличнойЧасти  = "Материалы";
	ИмяТаблицыОстатков = "ОстаткиМатериалов";
	ТипОперацииВводаНачальныхОстатков = ДокументОбъект.ТипОперацииВводаНачальныхОстатков;
	Склад = ДокументОбъект.Склад;
		
	Если ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиАгрегатовНаСкладах Тогда
		ИмяТабличнойЧасти  = "Агрегаты";
		ИмяТаблицыОстатков = "ОстаткиАгрегатов";
		
		тбзОстатки = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
		тбзОстатки.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.упСклады"));
		Для каждого Строка Из тбзОстатки Цикл
			Строка.Склад = Склад;
		КонецЦикла;
		
	ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиМатериаловНаСкладах Тогда	
		ИмяТабличнойЧасти  = "Материалы";			
		ИмяТаблицыОстатков = "ОстаткиМатериалов";
		
		тбзОстатки = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
		тбзОстатки.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.упСклады"));
		Для каждого Строка Из тбзОстатки Цикл
			Строка.Склад = Склад;
		КонецЦикла;
		
	ИначеЕсли ТипОперацииВводаНачальныхОстатков = Перечисления.упТипыОперацийВводаНачальныхОстатков.ОстаткиОборудованияНаСкладах Тогда		
		
		
		ИмяТабличнойЧасти  = "ДополнительноеОборудование";
		ИмяТаблицыОстатков = "ОстаткиАгрегатов";     
		
		тбзОстатки = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить();
		тбзОстатки.Колонки.Добавить("Склад",   Новый ОписаниеТипов("СправочникСсылка.упСклады"));
		тбзОстатки.Колонки.Добавить("Агрегат", Новый ОписаниеТипов("СправочникСсылка.упДополнительноеОборудование"));
		Для каждого Строка Из тбзОстатки Цикл
			Строка.Склад   = Склад;
			Строка.Агрегат = Строка.ДополнительноеОборудование;
		КонецЦикла;

	КонецЕсли;
	
	ДополнительныеСвойства.Вставить(ИмяТаблицыОстатков, тбзОстатки);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
