#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗакрытьТекущуюФорму	= Ложь;
	
	ИспользуютсяДополнительныеОперации 	= ПолучитьФункциональнуюОпцию("упИспользуютсяДополнительныеОперации");
	ИспользуетсяУчетМатериалов			= ПолучитьФункциональнуюОпцию("упИспользуетсяУчетМатериалов");
	
	Если ИспользуетсяУчетМатериалов Тогда
		НоваяСтрока = СписокПриемникиСливаТоплива.Добавить();
		НоваяСтрока.ПриемникСливаТоплива 	= "Склад ГСМ";
		НоваяСтрока.Идентификатор 			= "СкладГСМ";
	КонецЕсли;
	
	НоваяСтрока = СписокПриемникиСливаТоплива.Добавить();
	НоваяСтрока.ПриемникСливаТоплива 	= "Транспортное средство";
	НоваяСтрока.Идентификатор 			= "ТранспортноеСредство";
	
	Если ИспользуютсяДополнительныеОперации  Тогда
		НоваяСтрока = СписокПриемникиСливаТоплива.Добавить();
		НоваяСтрока.ПриемникСливаТоплива 	= "Дополнительное оборудование";
		НоваяСтрока.Идентификатор 			= "ДополнительноеОборудование";		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = НЕ ЗакрытьТекущуюФорму;	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КнопкаВыбратьНажатие(Элемент)
	ВыбраноЗначение();
КонецПроцедуры

&НаКлиенте
Процедура СписокПриемникиСливаТопливаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбраноЗначение();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ВыбраноЗначение()
	ТекущиеДанные = Элементы.СписокПриемникиСливаТоплива.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ОповеститьОВыборе(ТекущиеДанные.Идентификатор);
	Иначе
		ОповеститьОВыборе(Неопределено);
	КонецЕсли;
	сткВозврата =Новый Структура;
	сткВозврата.Вставить("ИмяФормыПерехода", 			"ФормаВводаЗаправки");
	сткВозврата.Вставить("ИдентификаторПриемникаСлива", ТекущиеДанные.Идентификатор);
	ЗакрытьТекущуюФорму = Истина;
	Закрыть(сткВозврата);
КонецПроцедуры
	
#КонецОбласти
