
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособРаспределения = Перечисления.упСпособыРаспределенияРасходов.ПропорциональноПараметру Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Формула");
	ИначеЕсли СпособРаспределения = Перечисления.упСпособыРаспределенияРасходов.УказатьФормулуРаспределения Тогда 
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Параметр");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли