
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если упСервисныеФункции.ЭтоВызовПослеОткрытияФормы(ЭтаФорма) Тогда
		ПриСозданииПриЧтенииНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииПриЧтенииНаСервере()
	мсвСтилей = Новый Массив;
	Если ЗначениеЗаполнено(Объект.СтильМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильМаркера);
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.СтильВыделенногоМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильВыделенногоМаркера);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.СтильВыбранногоМаркера) Тогда
		мсвСтилей.Добавить(Объект.СтильВыбранногоМаркера);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.СтильВершиныГрафа) Тогда
		мсвСтилей.Добавить(Объект.СтильВершиныГрафа);
	КонецЕсли;
	
	Если мсвСтилей.Количество() Тогда
		соотКартинки = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(мсвСтилей, "ХранилищеЗначения, Картинка");
		Для каждого текЗначение Из соотКартинки Цикл
			сткРеквизитов = текЗначение.Значение;
			Если текЗначение.Ключ = Объект.СтильМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераИзХранилища;
				Иначе
					КартинкаМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераКартинка;
				КонецЕсли;
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВыделенногоМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВыделенногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераИзХранилища;
				Иначе
					КартинкаВыделенногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераКартинка;
				КонецЕсли;		
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВыбранногоМаркера Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВыбранногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераИзХранилища;
				Иначе
					КартинкаВыбранногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераКартинка;
				КонецЕсли;	
			КонецЕсли;
			Если текЗначение.Ключ = Объект.СтильВершиныГрафа Тогда
				Если сткРеквизитов.Картинка = Перечисления.упКартинкиМаркеров.ВыбратьИзФайла Тогда
					КартинкаВершиныГрафаИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения.Получить(), УникальныйИдентификатор);
					Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаИзХранилища;
				Иначе
					КартинкаВершиныГрафа = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
					Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаКартинка;
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПриСозданииПриЧтенииНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтильМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераИзХранилища;
		Иначе
			КартинкаМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыМаркера.ТекущаяСтраница  = Элементы.СтраницаМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВыделенногоМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВыделенногоМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВыделенногоМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВыделенногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераИзХранилища;
		Иначе
			КартинкаВыделенногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВыделенногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыделенногоМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВыбранногоМаркераПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВыбранногоМаркера) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВыбранногоМаркера);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВыбранногоМаркераИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераИзХранилища;
		Иначе
			КартинкаВыбранногоМаркера = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВыбранногоМаркера.ТекущаяСтраница  = Элементы.СтраницаВыбранногоМаркераКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтильВершиныГрафаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.СтильВершиныГрафа) Тогда
		сткРеквизитов = ПолучитьЗначенияРеквизитовНаСервере(Объект.СтильВершиныГрафа);
		Если сткРеквизитов.Картинка = ПредопределенноеЗначение("Перечисление.упКартинкиМаркеров.ВыбратьИзФайла") Тогда
			КартинкаВершиныГрафаИзХранилища = ПоместитьВоВременноеХранилище(сткРеквизитов.ХранилищеЗначения, УникальныйИдентификатор);
			Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаИзХранилища;
		Иначе
			КартинкаВершиныГрафа = упРаботаСКартамиКлиентСервер.ПолучитьКартинку(сткРеквизитов.Картинка);
			Элементы.СтраницыВершиныГрафа.ТекущаяСтраница  = Элементы.СтраницаВершиныГрафаКартинка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначенияРеквизитовНаСервере(СтильМаркера)
	
	сткРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтильМаркера, "ХранилищеЗначения, Картинка");
	сткРеквизитов.ХранилищеЗначения = сткРеквизитов.ХранилищеЗначения.Получить();
	
	Возврат сткРеквизитов;
	
КонецФункции // ПолучитьЗначенияРеквизитовНаСервере()

#КонецОбласти 