#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоПодразделению();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	УстановитьОтборПоПодразделению();
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	Отказ = Ложь;
	ИзмененыЭлементы = Ложь;
	ЗаполнитьСтруктурноеПодразделениеПользователей(ПараметрыПеретаскивания.Значение, Строка, Отказ, СтандартнаяОбработка, ИзмененыЭлементы);

	Если ИзмененыЭлементы Тогда
		Элементы.СписокПользователей.Обновить();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьОтборПоПодразделению()
	
	СтруктурныеПодразделения = Элементы.Список.ВыделенныеСтроки;
	СписокПользователей.Параметры.УстановитьЗначениеПараметра("Подразделение", 
																?(СтруктурныеПодразделения = Неопределено, 
																  ПредопределенноеЗначение("Справочник.упСтруктураПредприятия.ПустаяСсылка"),
																  СтруктурныеПодразделения));

КонецПроцедуры
	
&НаСервере
Процедура ЗаполнитьСтруктурноеПодразделениеПользователей(мсвПользователи, СтруктурноеПодразделение, Отказ, СтандартнаяОбработка, ИзмененыЭлементы)
	
	Для каждого ЭлементПользователь Из мсвПользователи Цикл
		Если ТипЗнч(ЭлементПользователь) = Тип("СправочникСсылка.Пользователи") Тогда
			СтандартнаяОбработка = Ложь;
			ПодразделениеПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементПользователь, "Подразделение");
			Если НЕ ПодразделениеПользователя = СтруктурноеПодразделение Тогда
				ПользовательОбъект = ЭлементПользователь.ПолучитьОбъект();
				ПользовательОбъект.Подразделение = СтруктурноеПодразделение;
				Попытка
					ПользовательОбъект.Записать();	
					ИзмененыЭлементы = Истина;
				Исключение
					ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
						ТекстОшибки = ОписаниеОшибки();
					КонецЕсли;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭлементПользователь,,,Отказ);
					ЗаписьЖурналаРегистрации("Ошибка при смене подразделения", УровеньЖурналаРегистрации.Ошибка, ,ЭлементПользователь, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
				КонецПопытки;

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
