#Область ОбработчикиСобытий

// Процедура ЗаполнитьУчетОтсрочки
// заполняет реквизит УчетОтсрочки значением  "ПоКалендарнымДням"
// у всех ранее не заполненных элементов
// при переходе на версию "3.0.4.10"
Процедура ЗаполнитьУчетОтсрочки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	упСхемыОплатыУслуг.Ссылка
	               |ИЗ
	               |	Справочник.упСхемыОплатыУслуг КАК упСхемыОплатыУслуг
	               |ГДЕ
	               |	упСхемыОплатыУслуг.ПометкаУдаления = ЛОЖЬ
	               |	И упСхемыОплатыУслуг.УчетОтсрочки = ЗНАЧЕНИЕ(Перечисление.упСпособыУчетаОтсрочки.ПустаяСсылка)";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		спрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		спрОбъект.УчетОтсрочки = Перечисления.упСпособыУчетаОтсрочки.ПоКалендарнымДням ;
		спрОбъект.Записать();
	
	КонецЦикла; 	
	

КонецПроцедуры

#КонецОбласти 
 