#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СуммаПроцентов = ЭтапыОплаты.Итог("ПроцентОплаты");
	
	Если НЕ СуммаПроцентов = 100 Тогда
		Отказ = Истина;
		ТекстСообщения = Нстр("ru = 'Суммарный процент оплаты должен быть равен 100%'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,"Объект",Отказ);
		Событие = Нстр("ru = 'Ошибка при проверке заполнения схемы оплаты труда'");
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,, , ТекстСообщения);    
	КонецЕсли;
	
	Если УчетОтсрочки = ПредопределенноеЗначение("Перечисление.упСпособыУчетаОтсрочки.ПоРабочимДням") Тогда
		ПроверяемыеРеквизиты.Добавить("ПроизводственныйКалендарь") 
	КонецЕсли; 

КонецПроцедуры
#КонецОбласти 	
#КонецЕсли
