#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Параметры.Отбор.Свойство("ВидТранспорта") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ВидТранспорта", Перечисления.упВидыТранспорта.Контейнер, ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды "ГрупповоеИзменениеОбъектов".
//
Процедура ГрупповоеИзменениеОбъектов(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры // ГрупповоеИзменениеОбъектов()
	
#КонецОбласти