
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор"                          , Новый Структура("Рейс", ПараметрКоманды));
	ПараметрыФормы.Вставить("КлючВарианта"                   , "АнализСкоростиДвиженияПоДаннымДатчиковКонтекст");
	ПараметрыФормы.Вставить("СформироватьПриОткрытии"        , Истина);
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОткрытьФорму("Отчет.упАнализСкоростиДвиженияПоДаннымДатчиков.Форма", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		"Рейс=" + ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры


#КонецОбласти