
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Запись.ТипТО = Перечисления.упТипыТО.Периодическое Тогда
		Если Запись.ПробегС > Запись.ПробегПо И ЗначениеЗаполнено(Запись.ПробегПо) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение конечной границы интервала контроля пробега превышает начальное значение.'"),,, "Запись.ПробегПо", Отказ);
		ИначеЕсли Запись.МоточасыС > Запись.МоточасыПо И ЗначениеЗаполнено(Запись.МоточасыПо) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение конечной границы интервала контроля моточасов превышает начальное значение.'"),,, "Запись.МоточасыПо", Отказ);			
		ИначеЕсли Запись.СрокС > Запись.СрокПо И ЗначениеЗаполнено(Запись.СрокПо) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Значение конечной границы интервала контроля срока превышает начальное значение.'"),,, "Запись.СрокПо", Отказ);			
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("ЗаписьИзФормы", Истина);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипТОПриИзменении(Элемент)

	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Если Запись.ТипТО = ПредопределенноеЗначение("Перечисление.упТипыТО.Периодическое") Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПериодическоеТО;
	Иначе	
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаРазовоеТО;
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти 