
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыЗагрузки = Новый Структура("ВидОбъекта, ТипОбъекта, Сценарий", "Документы","упЗаявкаНаПеревозкуГруза", "СозданиеЗаявокНаПеревозку");
	
	Уникальность = ?(ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ОкноКлиентскогоПриложения"), Новый УникальныйИдентификатор, ПараметрыВыполненияКоманды.Уникальность);
	
	ОткрытьФорму("Обработка.ЗагрузкаДанныхИзФайла.Форма", ПараметрыЗагрузки, ПараметрыВыполненияКоманды.Источник, Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 