
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	текДвижениеДокументов = СформироватьДвижениеДокументовРейса(ПараметрКоманды, ТекстОшибки, Отказ);
	
	Если Не Отказ Тогда
		ОткрытьФорму("Документ.упДвижениеДокументовРейса.Форма.ФормаДокумента", Новый Структура("Ключ", текДвижениеДокументов), ПараметрыВыполненияКоманды.Источник);
	Иначе
		Если ТекстОшибки = "" Тогда
			ТекстОшибки = НСтр("ru = 'Документ не сформирован.'");		    
		КонецЕсли; 
		//ПоказатьПредупреждение(, ТекстОшибки);
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьДвижениеДокументовРейса(Рейс, ТекстОшибки, Отказ)
	
	Возврат Документы.упДвижениеДокументовРейса.СформироватьДвижениеДокументовРейса(Рейс, ТекстОшибки, Отказ);
	
КонецФункции

#КонецОбласти 