
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНачала = Параметры.ДатаНачала;
	ДатаОкончания = Параметры.ДатаОкончания;
	ОбъектТекущий = Параметры.ОбъектТекущий;
	ТекущийПользователь = Параметры.ТекущийПользователь;
	ТипИзмеренияПланировщика = Параметры.ТипИзмеренияПланировщика;
	Если Параметры.Новая Тогда
		ДатаНачалаИсходная = ДатаНачала;
		ДатаОкончанияИсходная = ДатаОкончания;
	Иначе
		ДатаНачалаИсходная = Неопределено;
		ДатаОкончанияИсходная = Неопределено;
	КонецЕсли;
	Если Параметры.Свойство("Цвет") Тогда
		Цвет = Параметры.Цвет;
	Иначе
		Цвет = Новый Цвет(0,128,0);
	КонецЕсли;
	Если Параметры.Свойство("Описание") Тогда
		Описание = Параметры.Описание;	
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Отказ = Ложь;
	Если ПроверитьЗаполнение() Тогда
		ЗаполнитьГрафикРаботНаСервере(Отказ);
		Если НЕ Отказ Тогда
			Закрыть(Истина);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод(Команда)
	упСервисныеФункцииКлиент.РедактироватьПериод(ЭтаФорма, Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания"));
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	Если Цвет.Вид <> ВидЦвета.Абсолютный Тогда 
		Цвет = ОсновнойЦветПриИзмененииНаСервере(Цвет);
	КонецЕсли;	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ОсновнойЦветПриИзмененииНаСервере(Цвет)
	
	Возврат упСервисныеФункцииКлиентСервер.ПреобразоватьЦветВАбсолютный(Цвет);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьГрафикРаботНаСервере(Отказ)
	
	РезультатЗакрытия = Новый Структура();
	РезультатЗакрытия.Вставить("Цвет", упСервисныеФункцииКлиентСервер.ЦветВHexСтр(Цвет));
	РезультатЗакрытия.Вставить("Описание", Описание);
	РезультатЗакрытия.Вставить("ДатаНачала", ДатаНачала);
	РезультатЗакрытия.Вставить("ДатаОкончания", ДатаОкончания);
	Обработки.упРМПланированиеГрафиковРаботы.ЗаполнитьГрафикРаботыПоОбъекту(ОбъектТекущий, Объект.ТипИзмеренияПланировщика, ДатаНачалаИсходная, ДатаОкончанияИсходная, ДатаНачала, ДатаОкончания, Описание, ТекущийПользователь, , упСервисныеФункцииКлиентСервер.ЦветВHexСтр(Цвет), Отказ);
	
КонецПроцедуры


#КонецОбласти
