#Область ОбработчикиСобытий
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("упИспользуетсяАндроидКлиент") Тогда
		Если ЭтотОбъект.Количество() Тогда
			текДата = ТекущаяДатаСеанса();
			Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
				СтрокаНабора.ДатаЗаписи = текДата;
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ТипЗнч(Отбор.Регистратор.Значение) = Тип("ДокументСсылка.упРейс") Тогда
		// ДиагностикаУП Для борьбы с некорректным заполнением предшественников
		ТаблицаНабора = Выгрузить();
		Для ИндексСтроки = 0 По ТаблицаНабора.Количество() - 1 Цикл
			ОбратныйИндекс = ТаблицаНабора.Количество() - 1 - ИндексСтроки;
			СтрокаНабора = ТаблицаНабора[ОбратныйИндекс];
			Для ИндексПотомка = 0 По ОбратныйИндекс - 1 Цикл
				СтрокаПотомка = ТаблицаНабора[ИндексПотомка];
				Если Ложь
					Или СтрокаПотомка.Отменена
					Или СтрокаПотомка.Пройдена
				Тогда
					Продолжить;
				КонецЕсли; 
				Если Найти(СтрокаПотомка.Предшественники, СтрокаНабора.Идентификатор) > 0 Тогда
					Сообщение = НСтр("ru = 'При записи маршрута по рейсу " + СтрокаПотомка.Рейс + " документом " + Отбор.Регистратор.Значение + " обнаружено некорректное заполнение предшественников'");
					Сообщение = Сообщение + " (" + СтрокаПотомка.СтрокаНомер + "->" + СтрокаНабора.СтрокаНомер + ")";
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение,,,, Отказ);
				КонецЕсли; 
			КонецЦикла; 
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти