
#Область ОбработчикиСобытийФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

// Нет.

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
// Процедура - обработчик команды "ГрупповоеИзменениеОбъектов"
//
Процедура ГрупповоеИзменениеОбъектов(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры // ГрупповоеИзменениеОбъектов()

&НаКлиенте
Процедура УстановитьОсновногоКонтрагента(Команда)
	
	текСтрока = Элементы.Список.ТекущиеДанные;
	Если текСтрока <> Неопределено Тогда
	   	УстановитьОсновногоКонтрагентаНаСервере(текСтрока.Ссылка);
		ОповеститьОбИзменении(текСтрока.Ссылка);
	КонецЕсли; 
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОсновногоКонтрагентаНаСервере(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	упКонтрагенты.Партнер КАК Партнер
	|ПОМЕСТИТЬ втПартнер
	|ИЗ
	|	Справочник.упКонтрагенты КАК упКонтрагенты
	|ГДЕ
	|	упКонтрагенты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	упКонтрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.упКонтрагенты КАК упКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втПартнер КАК втПартнер
	|		ПО упКонтрагенты.Партнер = втПартнер.Партнер
	|			И (упКонтрагенты.Основной)
	|			И (упКонтрагенты.Ссылка <> &Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втПартнер.Партнер
	|ИЗ
	|	втПартнер КАК втПартнер";
	Запрос.УстановитьПараметр("Ссылка" , Контрагент);
	Результат = Запрос.ВыполнитьПакет();
	КоличествоТаблиц = Результат.Количество();
	Если Не Результат[КоличествоТаблиц - 2].Пустой() Тогда
		Выборка = Результат[КоличествоТаблиц - 1].Выбрать();
		Выборка.Следующий();
		Партнер = Выборка.Партнер;
		
		НачатьТранзакцию();
		
		БлокировкаДанных = Новый БлокировкаДанных;
		
		ЭлементБлокировки = БлокировкаДанных.Добавить("Справочник.упКонтрагенты");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Партнер", Партнер);
		
		Попытка
			БлокировкаДанных.Заблокировать();
		Исключение
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
				ТекстОшибки = ОписаниеОшибки();
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			ЗаписьЖурналаРегистрации("ОшибкаБлокировки", УровеньЖурналаРегистрации.Ошибка, ,Контрагент, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
			Возврат;
		КонецПопытки;

		Выборка = Результат[КоличествоТаблиц - 2].Выбрать();
		Пока Выборка.Следующий() Цикл
			текКонтрагент = Выборка.Контрагент;
			текКонтрагентОбъект = текКонтрагент.ПолучитьОбъект();
			текКонтрагентОбъект.Основной = Ложь;
			текКонтрагентОбъект.Записать();
		КонецЦикла; 
		
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	текКонтрагентОбъект = Контрагент.ПолучитьОбъект();
	текКонтрагентОбъект.Основной = Истина;
	текКонтрагентОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти 


