
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	КонтролироватьКоординатыВодителяПриПрохожденииТочки = ЗначениеЗаполнено(Запись.ДопустимоеОтклонение);
	
	УстановитьДоступность(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КонтролироватьКоординатыВодителяПриПрохожденииТочкиПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноГрупповоеВыполнениеРаботПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрещеноОтчитыватьсяОРаботахПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьЗадачиСГрузомВТареПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешеноДосрочноеУбытиеИзТочкиМаршрутаПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступность(Открытие = Ложь)

	Если КонтролироватьКоординатыВодителяПриПрохожденииТочки Тогда 
		Элементы.ДопустимоеОтклонение.Доступность = Истина;
		Если Не Открытие Тогда 
			Запись.ДопустимоеОтклонение = 0;
		КонецЕсли;
	Иначе	
		Элементы.ДопустимоеОтклонение.Доступность = Ложь;
	КонецЕсли;
	
	Если Запись.ЗапрещеноОтчитыватьсяОРаботах Тогда
		Элементы.РазрешеноГрупповоеВыполнениеРабот.Доступность = Ложь;
	ИначеЕсли Запись.РазрешеноГрупповоеВыполнениеРабот Тогда
		Элементы.ЗапрещеноОтчитыватьсяОРаботах.Доступность = Ложь;
	Иначе
		Элементы.РазрешеноГрупповоеВыполнениеРабот.Доступность = Истина;
		Элементы.ЗапрещеноОтчитыватьсяОРаботах.Доступность     = Истина;
	КонецЕсли; 
	
	Элементы.СпособГруппировкиРабот.Доступность = Запись.ГруппироватьЗадачиСГрузомВТаре;
	Элементы.ВидДоступаДействиеДосрочноеУбытиеИзТочкиМаршрута.Доступность = Запись.РазрешеноДосрочноеУбытиеИзТочкиМаршрута;
	
КонецПроцедуры

#КонецОбласти 



