#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Заполняет дерево работ по переданному рейсу. 
//
Процедура ЗаполнитьДеревоРаботПоРейсу(ИзменитьТолькоВыполненные = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	сткДопПараметры = Новый Структура();
	сткДопПараметры.Вставить("ЗаданияПоРейсам", ЗаданияПоРейсам);
	упПрохождениеТочки.ЗаполнитьДеревоРаботПоРейсу(дрвРаботыПоТекущемуРейсу, , ТекущийРейс, Ложь, сткДопПараметры);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ЗаполнитьСписокРейсов() Экспорт
	
	Отказ = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	упПрохождениеТочки.ЗаполнитьСписокРейсовПоПолучателю(СписокРейсов, ЗаданияПоРейсам, Партнеры, Период.ДатаНачала, Период.ДатаОкончания, Отказ);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьТоварныйСостав(ПрохождениеТочки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварныйСоставГруза.Ссылка КАК Ссылка,
	|	ТоварныйСоставГруза.НомерСтроки КАК НомерСтроки,
	|	ТоварныйСоставГруза.АдресРазгрузки КАК АдресРазгрузки,
	|	ТоварныйСоставГруза.АналитическийРазрез КАК АналитическийРазрез,
	|	ТоварныйСоставГруза.ЕдиныйГруз КАК ЕдиныйГруз,
	|	ТоварныйСоставГруза.Количество КАК Количество,
	|	ТоварныйСоставГруза.Номенклатура КАК Номенклатура,
	|	ТоварныйСоставГруза.Проблема КАК Проблема,
	|	ТоварныйСоставГруза.СтавкаНДС КАК СтавкаНДС,
	|	ТоварныйСоставГруза.Сумма КАК Сумма,
	|	ТоварныйСоставГруза.СуммаБезНДС КАК СуммаБезНДС,
	|	ТоварныйСоставГруза.СуммаНДС КАК СуммаНДС,
	|	ТоварныйСоставГруза.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
	|	ТоварныйСоставГруза.Цена КАК Цена,
	|	ПРЕДСТАВЛЕНИЕ(ТоварныйСоставГруза.ЗаданиеНаПеревозкуГруза) КАК ЗаданиеНаПеревозкуГруза,
	|	ТоварныйСоставГруза.ГрузовоеМестоРодитель КАК ГрузовоеМесто,
	|	ТоварныйСоставГруза.КоличествоГрузов КАК КоличествоГрузов,
	|	ТоварныйСоставГруза.Выполнена КАК Выполнена,
	|	ТоварныйСоставГруза.НовыйТовар КАК НовыйТовар
	|ИЗ
	|	Документ.упПрохождениеТочки.ТоварныйСоставГруза КАК ТоварныйСоставГруза
	|ГДЕ
	|	ИСТИНА
	|	И ТоварныйСоставГруза.Ссылка = &ПрохождениеТочки
	|	И ТоварныйСоставГруза.ЗаданиеНаПеревозкуГруза В(&ЗаданияНаПеревозкуГруза)";


	Запрос.УстановитьПараметр("ЗаданияНаПеревозкуГруза", ЗаданияПоРейсам.Скопировать(Новый Структура("Рейс", ТекущийРейс)).ВыгрузитьКолонку("Задание"));
	Запрос.УстановитьПараметр("ПрохождениеТочки", ПрохождениеТочки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если товарный состав грузовых мест в прохождении не менялся.
	Если РезультатЗапроса.Пустой() Тогда
		Запрос.Текст = 
		"
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	УпПрохождениеТочки_РаботыТ.ГрузовоеМесто КАК ГрузовоеМесто,
		|	УпПрохождениеТочки_РаботыТ.КоличествоГрузов КАК КоличествоГрузов,
		|	УпПрохождениеТочки_РаботыТ.Задание КАК ЗаданиеНаПеревозкуГруза,
		|	УпПрохождениеТочки_РаботыТ.Выполнена КАК Выполнена,
		|	УпПрохождениеТочки_РаботыТ.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ втГрузовыеМеста
		|ИЗ
		|	Документ.упПрохождениеТочки.Работы КАК УпПрохождениеТочки_РаботыТ
		|ГДЕ ИСТИНА
		|	И УпПрохождениеТочки_РаботыТ.Задание В (&ЗаданияНаПеревозкуГруза)
		|	И УпПрохождениеТочки_РаботыТ.Ссылка = &ПрохождениеТочки
		|	И НЕ (УпПрохождениеТочки_РаботыТ.ГрузовоеМесто В (ЗНАЧЕНИЕ(Справочник.упГрузовыеМеста.ПустаяСсылка)))
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	втГрузовыеМеста.НомерСтроки КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(Справочник.упАдреса.ПустаяСсылка) КАК АдресРазгрузки,
		|	ЗНАЧЕНИЕ(Справочник.упАналитическиеРазрезы.ПустаяСсылка) КАК АналитическийРазрез,
		|	ЛОЖЬ КАК ЕдиныйГруз,
		|	ТоварныйСоставГруза.Количество КАК Количество,
		|	ТоварныйСоставГруза.Номенклатура КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.упПроблемы.ПустаяСсылка) КАК Проблема,
		|	ТоварныйСоставГруза.СтавкаНДС КАК СтавкаНДС,
		|	ТоварныйСоставГруза.Сумма КАК Сумма,
		|	ТоварныйСоставГруза.СуммаБезНДС КАК СуммаБезНДС,
		|	ТоварныйСоставГруза.СуммаНДС КАК СуммаНДС,
		|	ТоварныйСоставГруза.УпаковкаНоменклатуры КАК УпаковкаНоменклатуры,
		|	ТоварныйСоставГруза.Цена КАК Цена,
		|	ПРЕДСТАВЛЕНИЕ(втГрузовыеМеста.ЗаданиеНаПеревозкуГруза) КАК ЗаданиеНаПеревозкуГруза,
		|	ТоварныйСоставГруза.Ссылка КАК ГрузовоеМесто,
		|	втГрузовыеМеста.КоличествоГрузов КАК КоличествоГрузов,
		|	втГрузовыеМеста.Выполнена КАК Выполнена,
		|	ЛОЖЬ КАК НовыйТовар
		|ИЗ
		|	Справочник.упГрузовыеМеста.ТоварныйСоставГруза КАК ТоварныйСоставГруза
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втГрузовыеМеста КАК втГрузовыеМеста
		|	ПО втГрузовыеМеста.ГрузовоеМесто = ТоварныйСоставГруза.Ссылка
		|";

	КонецЕсли;
	
	тбзРезультат = Запрос.Выполнить().Выгрузить();
		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(тбзРезультат);
	
КонецФункции


#КонецЕсли
