#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура выполняет первоначальное заполнение состояний транспортных средств
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Элемент = Справочники.упСостоянияТС.Свободно.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Свободно;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияТС.ВРейсе.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.ВРейсе;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияТС.Ремонт.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Ремонт;
	Элемент.Записать();
	
	Элемент = Справочники.упСостоянияТС.Недоступно.ПолучитьОбъект();
	Элемент.ТипСостоянияТС = Перечисления.упТипыСостоянийТС.Недоступно;
	Элемент.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПервоначальноеЗаполнение()

#КонецОбласти

#КонецЕсли