#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Истина
		И НЕ РасходыНаРейсы 
		И НЕ РасходыНаТранспорт 
		И НЕ ФинансовыйРезультат
	Тогда
		ТекстСообщения = Нстр("ru = 'Должен быть включен хотя бы один признак распределяемых расходов ""Рейсы"", ""Транспорт"" или ""Финансовый результат""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"ГруппаОбщее",,Отказ);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

#КонецЕсли