#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = Ложь;
	ТекстОшибки = "";
	текПрохождениеТочки = СформироватьПрохождениеТочкиНаСервере(ПараметрКоманды, ТекстОшибки, Отказ);
	
	Если Не Отказ Тогда
		ОткрытьФорму("Документ.упПрохождениеТочки.Форма.ФормаДокумента", Новый Структура("Ключ", текПрохождениеТочки), ПараметрыВыполненияКоманды.Источник);
	Иначе
		Если ТекстОшибки = "" Тогда
			ТекстОшибки = НСтр("ru = 'Прохождение точки не сформировано.'");		    
		КонецЕсли; 
		//ПоказатьПредупреждение(, ТекстОшибки);
		упСервисныеФункцииКлиент.ПоказатьОповещениеПользователяНаше(ТекстОшибки, Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьПрохождениеТочкиНаСервере(Рейс, ТекстОшибки, Отказ)
	
	Возврат Документы.упРейс.СформироватьСледующееПрохождениеТочки(Рейс, ТекстОшибки, Отказ);
	
КонецФункции

#КонецОбласти 
