
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.упРейс") Тогда
		Организация = ДанныеЗаполнения.Организация;
		Рейс = ДанныеЗаполнения.Ссылка;
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
		
		сткЭкипаж = упРейс.ПолучитьЭкипажРейса(Рейс);
		ТранспортноеСредство	= сткЭкипаж.ТранспортноеСредство;
		Водитель				= сткЭкипаж.Водитель1

	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 

#КонецЕсли	