
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстОшибки = "";
	МассивДокументов = Новый СписокЗначений;
    МассивДокументов.ЗагрузитьЗначения(ПараметрКоманды);
    МассивДокументов = МассивДокументов.ВыгрузитьЗначения();
	ПроверитьВозможностьУстановкиСтатуса(МассивДокументов,ТекстОшибки);
	Если НЕ ТекстОшибки = "" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли; 
	упРаботаСоСтатусамиКлиент.УстановитьСтатусДокументам(МассивДокументов, ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.КВыполнению"));   
	
	Для каждого СсылкаНаЗаявку Из ПараметрКоманды Цикл	
		Структура = Новый Структура("Статус, Ссылка",ПредопределенноеЗначение("Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.КВыполнению"),СсылкаНаЗаявку);
		Оповестить("СменаСтатуса",Структура, ПараметрыВыполненияКоманды.Источник);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьУстановкиСтатуса(МассивДокументов,ТекстОшибки)
	
	МассивДокументовДляСменыСтатуса = Новый Массив;
	
	ПолучитьДанныеДляПроверки(МассивДокументов, ТекстОшибки);
	
	Для каждого Заявка Из МассивДокументов Цикл
		
		сткВозврата = упРемонтИТОТС.РазрешеноПеревестиКВыполнению(Заявка.Статус, Заявка.ТребуетсяСогласованиеЗаявкиНаРемонт);
	
		Если сткВозврата.Результат Тогда
		    МассивДокументовДляСменыСтатуса.Добавить(Заявка.Ссылка);
		Иначе	
			ТекстОшибки = ТекстОшибки + НСтр("ru = ' Статус не изменен.'") + сткВозврата.ТекстОшибки + Заявка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;	
	
	МассивДокументов = МассивДокументовДляСменыСтатуса;

КонецПроцедуры

Процедура ПолучитьДанныеДляПроверки(МассивДокументов,ТекстОшибки)
	
	ДанныеДокументов = Новый ТаблицаЗначений;
	ДанныеДокументов.Колонки.Добавить("Ссылка");
	ДанныеДокументов.Колонки.Добавить("ТребуетсяСогласованиеЗаявкиНаРемонт",Новый ОписаниеТипов("Булево"));
	ДанныеДокументов.Колонки.Добавить("Статус");

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	упЗаявкаНаРемонтИТОТС.Ссылка,
		|	упЗаявкаНаРемонтИТОТС.ВидРемонта.ТребуетсяСогласованиеЗаявкиНаРемонт КАК ТребуетсяСогласованиеЗаявкиНаРемонт,
		|	упЗаявкаНаРемонтИТОТС.ВидРемонта,
		|	ВЫБОР
		|		КОГДА упЗаявкаНаРемонтИТОТС.ПометкаУдаления
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.Отменена)
		|		ИНАЧЕ ЕСТЬNULL(тбСтатусы.Статус, ЗНАЧЕНИЕ(Перечисление.упСтатусыЗаявкиНаРемонтИТОТС.Новая))
		|	КОНЕЦ КАК Статус
		|ИЗ
		|	Документ.упЗаявкаНаРемонтИТОТС КАК упЗаявкаНаРемонтИТОТС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.упСтатусыЗаявокНаРемонтИТОТС.СрезПоследних КАК тбСтатусы
		|		ПО тбСтатусы.Документ = упЗаявкаНаРемонтИТОТС.Ссылка
		|ГДЕ
		|	упЗаявкаНаРемонтИТОТС.Ссылка В(&МассивДокументов)";
		
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ВидРемонта = Справочники.упВидыРемонтов.ПустаяСсылка() Тогда
			ТекстОшибки = ТекстОшибки + НСтр("ru = 'Статус не изменен.'") + НСтр("ru = ' Не заполнен вид ремонта у документа '") + ВыборкаДетальныеЗаписи.Ссылка;
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДанныеДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);

	КонецЦикла;
	
  	МассивДокументов = ДанныеДокументов;
	
КонецПроцедуры // ПолучитьДанныеДляПроверки()
 


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 


