////////////////////////////////////////////////////////////////////////////////
// Подсистема "Даты запрета изменения".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет изменить работу интерфейса при встраивании.
//
// Параметры:
//  НастройкиРаботыИнтерфейса - Структура - содержит свойство:
//   * ИспользоватьВнешнихПользователей - Булево - (начальное значение Ложь),
//     если установить Истина, тогда даты запрета можно будет настраивать для внешних пользователей.
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	
	
КонецПроцедуры

// Содержит описание таблиц и полей объектов для проверки запретов изменения данных.
//   Вызывается из процедуры ИзменениеЗапрещено общего модуля ДатыЗапретаИзменения,
//   используемой в подписке на событие ПередЗаписью объекта для проверки наличия
//   запретов и отказа от изменений запрещенного объекта.
//
// Параметры:
//  ИсточникиДанных - ТаблицаЗначений - с колонками:
//   * Таблица     - Строка - полное имя объекта метаданных,
//                   например, Метаданные.Документы.ПриходнаяНакладная.ПолноеИмя().
//   * ПолеДаты    - Строка - имя реквизита объекта или табличной части,
//                   например "Дата", "Товары.ДатаОтгрузки".
//   * Раздел      - Строка - имя предопределенного элемента
//                   "ПланВидовХарактеристикСсылка.РазделыДатЗапрета".
//   * ПолеОбъекта - Строка - имя реквизита объекта или реквизита табличной части,
//                   например "Организация", "Товары.Склад".
//
//  Для добавления строки имеется процедура ДобавитьСтроку в общем модуле ДатыЗапретаИзменения.
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	
	//Документы
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упВходящаяПретензия", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упДвижениеДокументовРейса", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упДоверенность", "Дата");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упДокументТранспортногоСредстваВодителя", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЗаданиеНаПеревозкуГруза", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЗаправкаСливГСМ", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЗапросУсловийПеревозки", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЗаявкаНаПеревозкуГруза", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЗаявкаНаТС", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упИзменениеСостоянияТранспортногоСредства", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упИсходящаяПретензия", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаОстатковАгрегатов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаОстатковГСМ", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаОстатковМатериалов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаПробегаТС", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаРегистров", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаРейса", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упОперацияСистемыПлатон", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упОтчетИнкассатора", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПеремещениеАгрегатов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПеремещениеМатериалов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПересчетГрузовыхМест", "Дата");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПодтверждениеЗаявкиНаТС", "Дата");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПоступлениеАгрегатов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПоступлениеМатериалов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПредложениеПеревозчика", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПринятиеКУчетуТранспортногоСредства", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПрисоединениеОтсоединениеПрицепа", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПроисшествиеВПути", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПрохождениеТочки", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПрочиеРасходы", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПутевойЛист", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упРегламентнаяОперация", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упРейс", "Дата");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упРемонтИТОТС", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упРемонтИТОТС", "ПериодРаспределенияЗатратНачало");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЗаявкаНаРемонтИТОТС", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЗаявкаНаРемонтИТОТС", "ПериодРаспределенияЗатратНачало");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упВводНачальныхОстатков", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упИзменениеСостоянийОборудования", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упРаспределениеПрочихРасходов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упРаспределениеПрямыхРасходов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упРаспределениеРасходовБудущихПериодов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСписаниеПрочихРасходов", "Дата");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упАвансовыйОтчет", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упИзменениеНаправленияДеятельностиТранспортногоСредства", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКоммерческоеПредложение", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаНаработкиОборудования", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упКорректировкаЭтаповПеревозки", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упПередачаТранспортногоСредстваПодразделению", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упУстановкаЛимитовРасходаГСМ", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упУстановкаНормРасходаГСМ", "ДатаНачалаДействия");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЧекККМ", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упЭтапПодбораПеревозчика", "Дата");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСлужебноеРасследование", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСнятиеСУчетаТранспортногоСредства", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСобытиеМониторинга", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСписаниеАгрегатов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСписаниеМатериалов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСтрахованиеГруза", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упСчетНаОплатуЗаказчику", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упУстановкаЗначенийПоказателейРасчета", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упУстановкаПравилРасчетаДоходовИРасходов", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упФактическиеДоходы", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упФактическиеРасходы", "Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.упШтраф", "Дата");
	
	//Регистры сведений
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.упВыдачаТопливныхКарт", "Период");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.упУчетнаяПолитика", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.упУстановленныеТрекеры", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.упВсегоРасходыПоРейсу", "Рейс.Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.упПлановыеПараметрыРейса", "Рейс.Дата");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.упФактическиеПараметрыРейса", "Рейс.Дата");
	
	//Регистры накопления
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упАгрегатыНаСкладах", "Период");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упДоходы", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упДоходыРасходыПредприятия", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упОстаткиГрузовыхМест", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упОстаткиГСМ", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упОстаткиМатериалов", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упПрочиеРасходы", "Период");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упРасходы", "Период");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.упРасходыНаТС", "Период");
	
КонецПроцедуры

// Позволяет переопределить выполнение проверок запретов по произвольному условию.
//
// Параметры:
//  Объект       - СправочникОбъект,
//                 ДокументОбъект,
//                 ПланВидовХарактеристикОбъект,
//                 ПланСчетовОбъект,
//                 ПланВидовРасчетаОбъект,
//                 БизнесПроцессОбъект,
//                 ЗадачаОбъект,
//                 ПланОбменаОбъект - объект данных (ПередЗаписью или ПриЧтенииНаСервере).
//               - РегистрСведенийНаборЗаписей,
//                 РегистрНакопленияНаборЗаписей,
//                 РегистрБухгалтерииНаборЗаписей,
//                 РегистрРасчетаНаборЗаписей - набор записей (ПередЗаписью или ПриЧтенииНаСервере).
//
//                 Для документов в свойство ДополнительныеСвойства вставляется свойство РежимЗаписи,
//                 если вызов делается в процессе записи документа.
//  
//  ПроверкаЗапретаИзменения    - Булево - когда Истина, тогда проверка изменения выполняется.
//                                Если установить Ложь, тогда проверка запрета изменения будет пропущена.
//
//  УзелПроверкиЗапретаЗагрузки - Неопределено - проверка запрета загрузки не выполняется.
//                              - ПланыОбменаСсылка - проверка запрета загрузки выполняется. Если
//                                установить Неопределено, проверка запрета загрузки будет пропущена.
//
//  ВерсияОбъекта               - Строка - начальное значение "". Проверяются обе версии объекта.
//                                Если установить "СтараяВерсия" или "НоваяВерсия", тогда будет
//                                выполнена проверка только старой или только новой версии объекта.
//
Процедура ПередПроверкойЗапретаИзменения(Объект, ПроверкаЗапретаИзменения, УзелПроверкиЗапретаЗагрузки, ВерсияОбъекта) Экспорт
	
	ТипИсточника = ТипЗнч(Объект);
	
	Если ТипИсточника = Тип("ДокументОбъект.упВходящаяПретензия")  Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Удовлетворена, Удовлетворена частично, Отклонена, Отменена
		
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыВходящейПретензии.Удовлетворена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыВходящейПретензии.УдовлетворенаЧастично);
		СписокСтатусов.Добавить(Перечисления.упСтатусыВходящейПретензии.Отклонена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыВходящейПретензии.Отменена);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыВходящихПретензийСрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыВходящихПретензий.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыВходящихПретензийСрезПоследних
		|ГДЕ
		|	упСтатусыВходящихПретензийСрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упЗаданиеНаПеревозкуГруза") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки:  Выполнено, Отменено, Отказ
		
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Выполнено);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Отменено);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаданияНаПеревозкуГруза.Отказ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыЗаданийНаПеревозкуГрузаСрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыЗаданийНаПеревозкуГруза.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыЗаданийНаПеревозкуГрузаСрезПоследних
		|ГДЕ
		|	упСтатусыЗаданийНаПеревозкуГрузаСрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упЗапросУсловийПеревозки") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Закрыт, Отменен
		
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗапросаУсловийПеревозки.Закрыт);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗапросаУсловийПеревозки.Отменен);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыЗапросовУсловийПеревозокСрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыЗапросовУсловийПеревозок.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыЗапросовУсловийПеревозокСрезПоследних
		|ГДЕ
		|	упСтатусыЗапросовУсловийПеревозокСрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упЗаявкаНаПеревозкуГруза") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Выполнена, Выполнена частично, Отменена, Отказ
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Выполнена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.ВыполненаЧастично);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Отменена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаПеревозкуГруза.Отказ);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыЗаявокНаПеревозкуГрузаСрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыЗаявокНаПеревозкуГруза.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыЗаявокНаПеревозкуГрузаСрезПоследних
		|ГДЕ
		|	упСтатусыЗаявокНаПеревозкуГрузаСрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упЗаявкаНаТС") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Подтверждена, Отклонена
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаТС.Подтверждена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаТС.Отклонена);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыЗаявокНаТССрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыЗаявокНаТС.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыЗаявокНаТССрезПоследних
		|ГДЕ
		|	упСтатусыЗаявокНаТССрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упИсходящаяПретензия") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Удовлетворена, Удовлетворена частично, Отклонена, Отменена
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыИсходящейПретензии.Удовлетворена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыИсходящейПретензии.УдовлетворенаЧастично);
		СписокСтатусов.Добавить(Перечисления.упСтатусыИсходящейПретензии.Отклонена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыИсходящейПретензии.Отменена);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыИсходящихПретензийСрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыИсходящихПретензий.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыИсходящихПретензийСрезПоследних
		|ГДЕ
		|	упСтатусыИсходящихПретензийСрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упПутевойЛист") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Закрыт, Отменен
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыПутевогоЛиста.Закрыт);
		СписокСтатусов.Добавить(Перечисления.упСтатусыПутевогоЛиста.Отменен);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыПутевыхЛистовСрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыПутевыхЛистов.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыПутевыхЛистовСрезПоследних
		|ГДЕ
		|	упСтатусыПутевыхЛистовСрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упРейс")
		ИЛИ ТипИсточника = Тип("РегистрСведенийНаборЗаписей.упВсегоРасходыПоРейсу")
		ИЛИ ТипИсточника = Тип("РегистрСведенийНаборЗаписей.упПлановыеПараметрыРейса")
		ИЛИ ТипИсточника = Тип("РегистрСведенийНаборЗаписей.упФактическиеПараметрыРейса") Тогда
		
		
		Если ТипИсточника = Тип("ДокументОбъект.упРейс") Тогда
			
			Если Объект.ЭтоНовый() Тогда
				ПроверкаЗапретаИзменения = Истина;
				Возврат;	
			КонецЕсли;
			
			Рейс = Объект.Ссылка;
		Иначе
			Рейс = Объект.Отбор.Рейс.Значение;
		КонецЕсли;
		
		// Статусы проверки: Отменен, Завершен
		
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыРейса.Отменен);
		СписокСтатусов.Добавить(Перечисления.упСтатусыРейса.Завершен);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	упСтатусыРейсовСрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыРейсов.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыРейсовСрезПоследних
		|ГДЕ
		|	упСтатусыРейсовСрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",Рейс);
		Запрос.УстановитьПараметр("СписокСтатусов",СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упРемонтИТОТС") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Завершен, Отменен
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыРемонтаИТОТС.Завершен);
		СписокСтатусов.Добавить(Перечисления.упСтатусыРемонтаИТОТС.Отменен);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	упСтатусыРемонтовИТОТССрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыРемонтовИТОТС.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыРемонтовИТОТССрезПоследних
		|ГДЕ
		|	упСтатусыРемонтовИТОТССрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",         Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.упЗаявкаНаРемонтИТОТС") Тогда
		
		Если Объект.ЭтоНовый() Тогда
			ПроверкаЗапретаИзменения = Истина;
			Возврат;	
		КонецЕсли;
		
		// Статусы проверки: Выполнена, Отменена
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Выполнена);
		СписокСтатусов.Добавить(Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Отменена);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	упСтатусыЗаявокНаРемонтИТОТССрезПоследних.Документ
		|ИЗ
		|	РегистрСведений.упСтатусыЗаявокНаРемонтИТОТС.СрезПоследних(, Документ = &Ссылка) КАК упСтатусыЗаявокНаРемонтИТОТССрезПоследних
		|ГДЕ
		|	упСтатусыЗаявокНаРемонтИТОТССрезПоследних.Статус В (&СписокСтатусов)";
		
		Запрос.УстановитьПараметр("Ссылка",         Объект.Ссылка);
		Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			ПроверкаЗапретаИзменения = Ложь;
		Иначе
			ПроверкаЗапретаИзменения = Истина;
		КонецЕсли; 
		
	Иначе
		
		ПроверкаЗапретаИзменения = Истина;	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
