
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возращает ссылку на температурный режим в указанном диапазоне.  
//
// Параметры:
//  ТемператураОт  - Число - Температура.
//  ТемператураДо  - Число - Температура.
//
// Возвращаемое значение:
//   Число - Результат выполнения.
//
Функция ПолучитьТемпературныйРежим(ТемператураОт, ТемператураДо) Экспорт

	текРезультат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	упТемпературныеРежимы.Ссылка КАК ТемпературныйРежим
	|ИЗ
	|	Справочник.упТемпературныеРежимы КАК упТемпературныеРежимы
	|ГДЕ
	|	упТемпературныеРежимы.ТемператураОт <= &ТемператураОт
	|	И упТемпературныеРежимы.ТемператураДо >= &ТемператураДо";
	Запрос.УстановитьПараметр("ТемператураОт", ТемператураОт);
	Запрос.УстановитьПараметр("ТемператураДо", ТемператураДо);
	текВыборка	= Запрос.Выполнить().Выбрать();
	
	Если текВыборка.Следующий() Тогда
	
		текРезультат = текВыборка.ТемпературныйРежим;
	
	КонецЕсли;
	
	Возврат текРезультат;

КонецФункции // ПолучитьТемпературныйРежим()

#КонецОбласти

#КонецЕсли