
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ДатаОстатков) Тогда
		ДатаОстатков = Параметры.ДатаОстатков
	Иначе
		ДатаОстатков = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	ВидФормы = Параметры.Материал;
	
	Если ВидФормы = "ГСМ" Тогда
		Элементы.ГруппаСтраницыМатериалы.ТекущаяСтраница = Элементы.СтраницаОстаткиГСМ;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиГСМ, "Период", Новый Граница(ДатаОстатков, ВидГраницы.Включая), Истина);
	Иначе	
				
		Элементы.ГруппаСтраницыМатериалы.ТекущаяСтраница = Элементы.СтраницаОстаткиЗапчастей;
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ОстаткиЗапчастей, "Период", Новый Граница(ДатаОстатков, ВидГраницы.Включая), Истина);
		
		ТранспортноеСредство = Неопределено;
		Если НЕ Параметры.Свойство("ТранспортноеСредство", ТранспортноеСредство) = Неопределено  Тогда
			
			мсвМоделейТС = Новый Массив;
			мсвМоделейТС.Добавить(Справочники.упМоделиТС.ПустаяСсылка());
			Если ЗначениеЗаполнено(ТранспортноеСредство) Тогда
				МодельТС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТранспортноеСредство, "Модель");
				Если ЗначениеЗаполнено(МодельТС) Тогда
					мсвМоделейТС.Добавить(МодельТС);
				КонецЕсли; 
			КонецЕсли;	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОстаткиЗапчастей.Отбор, "МодельТС", мсвМоделейТС, ВидСравненияКомпоновкиДанных.ВСписке,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

		КонецЕсли;
		
	КонецЕсли; 
	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОстаткиГСМВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текСтрока = Элементы.ОстаткиГСМ.ДанныеСтроки(ВыбраннаяСтрока);
	сткПараметры = Новый Структура("Склад, ГСМ, Количество, ЕдиницаИзмерения");
	ЗаполнитьЗначенияСвойств(сткПараметры, текСтрока);
	
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ВводКоличестваЗавершение", ЭтаФорма, сткПараметры), текСтрока.Количество, НСтр(СтрШаблон("ru = 'Укажите количество ГСМ (%1)'", текСтрока.ЕдиницаИзмерения)), 15, 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиЗапчастейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текСтрока = Элементы.ОстаткиЗапчастей.ДанныеСтроки(ВыбраннаяСтрока);
	сткПараметры = Новый Структура("Склад, Запчасть, Количество, ЕдиницаИзмерения");
	ЗаполнитьЗначенияСвойств(сткПараметры, текСтрока);
	
	ПоказатьВводЧисла(Новый ОписаниеОповещения("ВводКоличестваЗавершение", ЭтаФорма, сткПараметры), текСтрока.Количество, НСтр(СтрШаблон("ru = 'Укажите количество запчастей (%1)'", текСтрока.ЕдиницаИзмерения)), 15, 3);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	мсвРезультат = СформироватьВозвращаемоеЗначение();
	Закрыть(мсвРезультат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимость()
	
	ЭтаФорма.Заголовок = НСтр(СтрШаблон("ru = 'Остатки на %1'", Формат(ДатаОстатков, "ДФ='dd.MM.yyyy ЧЧ:mm:сс'")));
	
	Элементы.ПодобранныеМатериалыГСМ.Видимость = (ВидФормы = "ГСМ");
	Элементы.ПодобранныеМатериалыЗапчасть.Видимость = (ВидФормы <> "ГСМ");

КонецПроцедуры

&НаСервере
Функция СформироватьВозвращаемоеЗначение()
	
	мсвРезультат = Новый Массив;
	
	тзПодобранныеМатериалы = ПодобранныеМатериалы.Выгрузить();
	тзПодобранныеМатериалы.Свернуть("Запчасть, ГСМ, Склад","Количество");
	
	Для каждого текСтрока Из ПодобранныеМатериалы Цикл
		сткСоставСтроки = Новый Структура("Запчасть, ГСМ, Склад, Количество");
	    ЗаполнитьЗначенияСвойств(сткСоставСтроки, текСтрока);
		мсвРезультат.Добавить(сткСоставСтроки);
	КонецЦикла; 
	
	Возврат мсвРезультат;
		
КонецФункции

#Область ОповещенияПоСобытиям

&НаКлиенте
Процедура ВводКоличестваЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> Неопределено Тогда
		КоличествоОстаток = ДополнительныеПараметры.Количество;
		Количество = Ответ;
		Отказ = Ложь;
		Если Количество = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Количество не может быть равно нулю'");
			Отказ = Истина;
		ИначеЕсли Количество < 0 Тогда	
			ТекстСообщения = НСтр("ru = 'Количество не может быть отрицательным'");
			Отказ = Истина;
		ИначеЕсли Количество > КоличествоОстаток Тогда
			ТекстСообщения = НСтр("ru = 'Количество не может привышать отстаток'");
			Отказ = Истина;
		КонецЕсли; 
		
		Если Отказ Тогда
			ПоказатьПредупреждение(,ТекстСообщения);
		Иначе
			НоваяСтрока = ПодобранныеМатериалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДополнительныеПараметры,, "Количество");
			НоваяСтрока.Количество = Ответ;
			
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 