
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СнятьПризнакОбработки(Команда)
	
	СнятьПризнакОбработкиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СнятьПризнакОбработкиНаСервере()

	Для Каждого текСтрока Из Элементы.Список.ВыделенныеСтроки Цикл 
		Запись = РегистрыСведений.упПроизошедшиеСобытия.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, текСтрока);
		Запись.Прочитать();
		Запись.ДатаНачалаОбработки = '00010101';
		Запись.СтатусОтработки     = Перечисления.упСтатусыОтработкиСобытий.Открыто;
		Запись.Записать();
	КонецЦикла;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти