#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ТипСтатьиДоходовИРасходов = Перечисления.упТипыСтатейДоходовРасходов.СтатьяДоходов Тогда
		ИсключаемыеРеквизиты = Новый Массив;
		ИсключаемыеРеквизиты.Добавить("ПравилаРаспределения");
		ИсключаемыеРеквизиты.Добавить("ВариантРасходов");
		ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовПоРейсам");
		ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовПоТС");
		ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовНаФинансовыйРезультат");
		ИсключаемыеРеквизиты.Добавить("СтатьяСписанияРасходов");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
	ИначеЕсли ТипСтатьиДоходовИРасходов = Перечисления.упТипыСтатейДоходовРасходов.СтатьяРасходов Тогда
		ЭтоПрямыеРасходы 		 = ВариантРасходов = Перечисления.упВариантыРасходов.Прямые;
		ЭтоКосвенныеРасходы 	 = ВариантРасходов = Перечисления.упВариантыРасходов.Косвенные;
		ЭтоРасходыБудущихПериодов = ВариантРасходов = Перечисления.упВариантыРасходов.РасходыБудущихПериодов;
		
		ИсключаемыеРеквизиты = Новый Массив;
				
		Если ЭтоРасходыБудущихПериодов Тогда
			ИсключаемыеРеквизиты.Добавить("ПравилаРаспределения");
			ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовПоРейсам");
			ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовПоТС");
			ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовНаФинансовыйРезультат");
		ИначеЕсли ЭтоПрямыеРасходы Тогда	
			ИсключаемыеРеквизиты.Добавить("СтатьяСписанияРасходов");
			ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовПоРейсам");
			ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовПоТС");
			ИсключаемыеРеквизиты.Добавить("ПравилоРаспределенияКосвенныхРасходовНаФинансовыйРезультат");
		ИначеЕсли ЭтоКосвенныеРасходы Тогда		
			ИсключаемыеРеквизиты.Добавить("СтатьяСписанияРасходов");
		КонецЕсли;
		
		Если ИсключаемыеРеквизиты.Количество() > 0 Тогда
			ИсключаемыеРеквизиты = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИсключаемыеРеквизиты);	
			ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, ИсключаемыеРеквизиты);
		КонецЕсли;
		
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли

