
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ЗначенияЗаполнения	= Новый Структура("Партнер", ПараметрКоманды);
	
	Контрагент = ПолучитьСвязанногоКонтрагента(ПараметрКоманды);
	Если Контрагент = Неопределено Тогда
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Справочник.упКонтрагенты.Форма.ФормаЭлемента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ИначеЕсли ЗначениеЗаполнено(Контрагент) Тогда 
		ПараметрыФормы = Новый Структура("Ключ", Контрагент);
		ОткрытьФорму("Справочник.упКонтрагенты.Форма.ФормаЭлемента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		Отбор	= Новый Структура("Партнер", ПараметрКоманды);
		ПараметрыФормы	= Новый Структура("Отбор", Отбор);
		ОткрытьФорму("Справочник.упКонтрагенты.Форма.ФормаСпискаПараметрическая", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСвязанногоКонтрагента(Партнер)

	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	упКонтрагенты.Ссылка
	|ИЗ
	|	Справочник.упКонтрагенты КАК упКонтрагенты
	|ГДЕ
	|	упКонтрагенты.Партнер = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	РезультатЗапроса = Запрос.Выполнить();
	
	текВыборка = РезультатЗапроса.Выбрать();
	
	Если текВыборка.Количество() > 0  Тогда
		
		Если текВыборка.Количество() = 1 Тогда
			Если текВыборка.Следующий() Тогда
				Результат = текВыборка.Ссылка;
			КонецЕсли;
		Иначе
			Результат = Справочники.упКонтрагенты.ПустаяСсылка(); 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции // ПолучитьСвязанногоКонтрагента()


#КонецОбласти 