
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение справочника	
//
// Параметры:
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Элемент = Справочники.упНазначенияДатчиков.Топливо.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.Пробег.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.ТревожнаяКнопка.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Дискретный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.Зажигание.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Дискретный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.ДвигательЗаведен.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Дискретный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.ЗначениеСкорости.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	Элемент = Справочники.упНазначенияДатчиков.Одометр.ПолучитьОбъект();
	Элемент.ТипЗначения = Перечисления.упТипыЗначений.Непрерывный;
	Элемент.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПервоначальноеЗаполнение()

#КонецОбласти 

#КонецЕсли