
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	сткОтбор = СформирватьПараметрыФормы(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор", сткОтбор);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыФормы.Вставить("КлючВарианта", "АнализДвиженияГСМКонтекст");
	ПараметрыФормы.Вставить("ВидимостьКомандВариантовОтчетов", Ложь);
	
	ОткрытьФорму("Отчет.упДокументыИзменявшиеОстаткиГСМ.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Функция СформирватьПараметрыФормы(Ссылка)
	
	сткРезультат = Новый Структура();
	сткРезультат.Вставить("Документ", Ссылка);
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти