
#Область ПрограммныйИнтерфейс

// Заполнение периода планирования данными справочника.
//
// Параметры:
//  ПериодПланирования  - Дата - Период.
//
// Возвращаемое значение:
//   Дата   - Период планирования.
//
Функция УстановитьПериодПланирования(ПериодПланирования) Экспорт
	
	Если ЗначениеЗаполнено(ПериодПланирования) Тогда
		Если ТипЗнч(ПериодПланирования) = Тип("СправочникСсылка.упПериодыПланирования") Тогда
			сткДанныеПериода = Справочники.упПериодыПланирования.РассчитатьПериодПланирования(ПериодПланирования);
			ПериодПланированияНачало    = сткДанныеПериода.НачалоПериода;
			ПериодПланированияОкончание = сткДанныеПериода.ОкончаниеПериода;
		Иначе
			ПериодПланированияНачало    = ПериодПланирования.ДатаНачала;
			ПериодПланированияОкончание = ПериодПланирования.Датаокончания;
		КонецЕсли;
	Иначе
		ПериодПланированияНачало    = ТекущаяДатаСеанса() - 15552000;
		ПериодПланированияОкончание = ТекущаяДатаСеанса() + 15552000;
	КонецЕсли;

	
КонецФункции

#КонецОбласти
