
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Нет.

#КонецОбласти
	
#Область ПрограммныйИнтерфейс

// Получить разрешенное значение. К текущему значению применяются ограничения кодом.
//
Функция ПолучитьРазрешенноеЗначение() Экспорт 
	
	Порог = Неопределено;
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Если упСервисныеФункции.ПолучитьЗначениеКонстанты(Метаданные.Константы.упТипМаршрутизатора.Имя) = Перечисления.упТипыМаршрутизаторов.СитиГИД Тогда
			Порог = 1;
		Иначе
			Порог = 3;
		КонецЕсли; 
	КонецЕсли; 
	Если Порог <> Неопределено И Порог < Значение Тогда
		Значение = Порог;
	КонецЕсли;
	Возврат Значение;
	
КонецФункции

#КонецОбласти

#КонецЕсли


