#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	сткОтбор = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(Параметры.Отбор);
	упВводНаОсновании.УстановитьВидимостьКоманд(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидТранспортнойУслуги = Неопределено;
	Если сткОтбор.Свойство("ВидТранспортнойУслуги", ВидТранспортнойУслуги) Тогда
		сткПараметры = Новый Структура("Отбор", сткОтбор);
		Если ВидТранспортнойУслуги = ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.УслугиСпецтехники") Тогда
			Отказ = Истина;
			ОткрытьФорму("Документ.упЗаявкаНаПеревозкуГруза.Форма.ФормаВыбораСпецТехника", сткПараметры, ЭтаФорма.ВладелецФормы);
			
		ИначеЕсли ВидТранспортнойУслуги = ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.ПеревозкаПассажиров") Тогда
			Отказ = Истина;
			ОткрытьФорму("Документ.упЗаявкаНаПеревозкуГруза.Форма.ФормаВыбораПассажирскиеПеревозки", сткПараметры, ЭтаФорма.ВладелецФормы);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

