
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьВидимостьПоВидуКТ();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	ОбновитьВидимостьПоВидуКТ();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийКоманд

// Нет.

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВидимостьПоВидуКТ()
	
	Если Объект.Вид = Перечисления.упВидыКассовойТехники.IBox Тогда
		Элементы.РегистрационныйНомер.Доступность = Ложь;
		Элементы.СерийныйНомер.Видимость = Ложь;
		Элементы.ГруппаСтраницыВидыКТ.ТекущаяСтраница = Элементы.ГруппаIBOX;
	Иначе
		Элементы.РегистрационныйНомер.Доступность = Истина;
		Элементы.СерийныйНомер.Видимость = Истина;
		Элементы.ГруппаСтраницыВидыКТ.ТекущаяСтраница = Элементы.ГруппаАТОЛ;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 



