
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор, ЗаголовокФормы", Новый Структура("ТипРасчета",ПредопределенноеЗначение("Перечисление.упТипРасчета.Тарификация")), "Оценочные шкалы");
	ОткрытьФорму("Справочник.упОценочнаяШкала.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "Тарификация", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

#КонецОбласти