
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Водитель", Параметры.Водитель);	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", Параметры.ТекущаяДата);	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Значение = Элементы.Список.ДанныеСтроки(Значение).Регистратор;
	СтандартнаяОбработка = Ложь;
	Закрыть(Значение);
	
КонецПроцедуры

#КонецОбласти
