
#Область СлужебныеПроцедурыИФункции

// Процедура производит первоначальное заполнение предопределенных элементов справочника.
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	текЭлемент = Справочники.упСтилиПолигонов.Основной.ПолучитьОбъект();
	текЭлемент.ЦветГраницы         = "#00FF00";
	текЭлемент.ТолщинаГраницы      = 2;
	текЭлемент.ПрозрачностьГраницы = 0;
	текЭлемент.ЦветЗаливки         = "#BBFF2F";
	текЭлемент.ПрозрачностьЗаливки = 80;
	текЭлемент.Записать();
	
КонецПроцедуры	

#КонецОбласти 