
#Область ОбработчикиСобытий


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.упСтилиЛиний") Тогда
		Наименование        = ДанныеЗаполнения.Наименование;
		ПрозрачностьЗаливки = 80;
		ПрозрачностьГраницы = ДанныеЗаполнения.Прозрачность;
		ТолщинаГраницы      = ДанныеЗаполнения.Толщина;
		ЦветГраницы         = ДанныеЗаполнения.Цвет;
		ЦветЗаливки         = ДанныеЗаполнения.Цвет;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
// Нет.
#КонецОбласти 